<?php
return [
    [
        "name" => "北京市",
        "pid" => 86,
        "code" => 110000,
        "mark" => "北京市"
    ],
    [
        "name" => "东城区",
        "pid" => 110000,
        "code" => 110101,
        "mark" => "北京市东城区"
    ],
    [
        "name" => "西城区",
        "pid" => 110000,
        "code" => 110102,
        "mark" => "北京市西城区"
    ],
    [
        "name" => "朝阳区",
        "pid" => 110000,
        "code" => 110105,
        "mark" => "北京市朝阳区"
    ],
    [
        "name" => "丰台区",
        "pid" => 110000,
        "code" => 110106,
        "mark" => "北京市丰台区"
    ],
    [
        "name" => "石景山区",
        "pid" => 110000,
        "code" => 110107,
        "mark" => "北京市石景山区"
    ],
    [
        "name" => "海淀区",
        "pid" => 110000,
        "code" => 110108,
        "mark" => "北京市海淀区"
    ],
    [
        "name" => "门头沟区",
        "pid" => 110000,
        "code" => 110109,
        "mark" => "北京市门头沟区"
    ],
    [
        "name" => "房山区",
        "pid" => 110000,
        "code" => 110111,
        "mark" => "北京市房山区"
    ],
    [
        "name" => "通州区",
        "pid" => 110000,
        "code" => 110112,
        "mark" => "北京市通州区"
    ],
    [
        "name" => "顺义区",
        "pid" => 110000,
        "code" => 110113,
        "mark" => "北京市顺义区"
    ],
    [
        "name" => "昌平区",
        "pid" => 110000,
        "code" => 110114,
        "mark" => "北京市昌平区"
    ],
    [
        "name" => "大兴区",
        "pid" => 110000,
        "code" => 110115,
        "mark" => "北京市大兴区"
    ],
    [
        "name" => "怀柔区",
        "pid" => 110000,
        "code" => 110116,
        "mark" => "北京市怀柔区"
    ],
    [
        "name" => "平谷区",
        "pid" => 110000,
        "code" => 110117,
        "mark" => "北京市平谷区"
    ],
    [
        "name" => "密云区",
        "pid" => 110000,
        "code" => 110118,
        "mark" => "北京市密云区"
    ],
    [
        "name" => "延庆区",
        "pid" => 110000,
        "code" => 110119,
        "mark" => "北京市延庆区"
    ],
    [
        "name" => "天津市",
        "pid" => 86,
        "code" => 120000,
        "mark" => "天津市"
    ],
    [
        "name" => "和平区",
        "pid" => 120000,
        "code" => 120101,
        "mark" => "天津市和平区"
    ],
    [
        "name" => "河东区",
        "pid" => 120000,
        "code" => 120102,
        "mark" => "天津市河东区"
    ],
    [
        "name" => "河西区",
        "pid" => 120000,
        "code" => 120103,
        "mark" => "天津市河西区"
    ],
    [
        "name" => "南开区",
        "pid" => 120000,
        "code" => 120104,
        "mark" => "天津市南开区"
    ],
    [
        "name" => "河北区",
        "pid" => 120000,
        "code" => 120105,
        "mark" => "天津市河北区"
    ],
    [
        "name" => "红桥区",
        "pid" => 120000,
        "code" => 120106,
        "mark" => "天津市红桥区"
    ],
    [
        "name" => "东丽区",
        "pid" => 120000,
        "code" => 120110,
        "mark" => "天津市东丽区"
    ],
    [
        "name" => "西青区",
        "pid" => 120000,
        "code" => 120111,
        "mark" => "天津市西青区"
    ],
    [
        "name" => "津南区",
        "pid" => 120000,
        "code" => 120112,
        "mark" => "天津市津南区"
    ],
    [
        "name" => "北辰区",
        "pid" => 120000,
        "code" => 120113,
        "mark" => "天津市北辰区"
    ],
    [
        "name" => "武清区",
        "pid" => 120000,
        "code" => 120114,
        "mark" => "天津市武清区"
    ],
    [
        "name" => "宝坻区",
        "pid" => 120000,
        "code" => 120115,
        "mark" => "天津市宝坻区"
    ],
    [
        "name" => "滨海新区",
        "pid" => 120000,
        "code" => 120116,
        "mark" => "天津市滨海新区"
    ],
    [
        "name" => "宁河区",
        "pid" => 120000,
        "code" => 120117,
        "mark" => "天津市宁河区"
    ],
    [
        "name" => "静海区",
        "pid" => 120000,
        "code" => 120118,
        "mark" => "天津市静海区"
    ],
    [
        "name" => "蓟州区",
        "pid" => 120000,
        "code" => 120119,
        "mark" => "天津市蓟州区"
    ],
    [
        "name" => "河北省",
        "pid" => 86,
        "code" => 130000,
        "mark" => "河北省"
    ],
    [
        "name" => "石家庄市",
        "pid" => 130000,
        "code" => 130100,
        "mark" => "河北省石家庄市"
    ],
    [
        "name" => "长安区",
        "pid" => 130100,
        "code" => 130102,
        "mark" => "河北省石家庄市长安区"
    ],
    [
        "name" => "桥西区",
        "pid" => 130100,
        "code" => 130104,
        "mark" => "河北省石家庄市桥西区"
    ],
    [
        "name" => "新华区",
        "pid" => 130100,
        "code" => 130105,
        "mark" => "河北省石家庄市新华区"
    ],
    [
        "name" => "井陉矿区",
        "pid" => 130100,
        "code" => 130107,
        "mark" => "河北省石家庄市井陉矿区"
    ],
    [
        "name" => "裕华区",
        "pid" => 130100,
        "code" => 130108,
        "mark" => "河北省石家庄市裕华区"
    ],
    [
        "name" => "藁城区",
        "pid" => 130100,
        "code" => 130109,
        "mark" => "河北省石家庄市藁城区"
    ],
    [
        "name" => "鹿泉区",
        "pid" => 130100,
        "code" => 130110,
        "mark" => "河北省石家庄市鹿泉区"
    ],
    [
        "name" => "栾城区",
        "pid" => 130100,
        "code" => 130111,
        "mark" => "河北省石家庄市栾城区"
    ],
    [
        "name" => "井陉县",
        "pid" => 130100,
        "code" => 130121,
        "mark" => "河北省石家庄市井陉县"
    ],
    [
        "name" => "正定县",
        "pid" => 130100,
        "code" => 130123,
        "mark" => "河北省石家庄市正定县"
    ],
    [
        "name" => "行唐县",
        "pid" => 130100,
        "code" => 130125,
        "mark" => "河北省石家庄市行唐县"
    ],
    [
        "name" => "灵寿县",
        "pid" => 130100,
        "code" => 130126,
        "mark" => "河北省石家庄市灵寿县"
    ],
    [
        "name" => "高邑县",
        "pid" => 130100,
        "code" => 130127,
        "mark" => "河北省石家庄市高邑县"
    ],
    [
        "name" => "深泽县",
        "pid" => 130100,
        "code" => 130128,
        "mark" => "河北省石家庄市深泽县"
    ],
    [
        "name" => "赞皇县",
        "pid" => 130100,
        "code" => 130129,
        "mark" => "河北省石家庄市赞皇县"
    ],
    [
        "name" => "无极县",
        "pid" => 130100,
        "code" => 130130,
        "mark" => "河北省石家庄市无极县"
    ],
    [
        "name" => "平山县",
        "pid" => 130100,
        "code" => 130131,
        "mark" => "河北省石家庄市平山县"
    ],
    [
        "name" => "元氏县",
        "pid" => 130100,
        "code" => 130132,
        "mark" => "河北省石家庄市元氏县"
    ],
    [
        "name" => "赵县",
        "pid" => 130100,
        "code" => 130133,
        "mark" => "河北省石家庄市赵县"
    ],
    [
        "name" => "晋州市",
        "pid" => 130100,
        "code" => 130183,
        "mark" => "河北省石家庄市晋州市"
    ],
    [
        "name" => "新乐市",
        "pid" => 130100,
        "code" => 130184,
        "mark" => "河北省石家庄市新乐市"
    ],
    [
        "name" => "唐山市",
        "pid" => 130000,
        "code" => 130200,
        "mark" => "河北省唐山市"
    ],
    [
        "name" => "路南区",
        "pid" => 130200,
        "code" => 130202,
        "mark" => "河北省唐山市路南区"
    ],
    [
        "name" => "路北区",
        "pid" => 130200,
        "code" => 130203,
        "mark" => "河北省唐山市路北区"
    ],
    [
        "name" => "古冶区",
        "pid" => 130200,
        "code" => 130204,
        "mark" => "河北省唐山市古冶区"
    ],
    [
        "name" => "开平区",
        "pid" => 130200,
        "code" => 130205,
        "mark" => "河北省唐山市开平区"
    ],
    [
        "name" => "丰南区",
        "pid" => 130200,
        "code" => 130207,
        "mark" => "河北省唐山市丰南区"
    ],
    [
        "name" => "丰润区",
        "pid" => 130200,
        "code" => 130208,
        "mark" => "河北省唐山市丰润区"
    ],
    [
        "name" => "曹妃甸区",
        "pid" => 130200,
        "code" => 130209,
        "mark" => "河北省唐山市曹妃甸区"
    ],
    [
        "name" => "滦县",
        "pid" => 130200,
        "code" => 130223,
        "mark" => "河北省唐山市滦县"
    ],
    [
        "name" => "滦南县",
        "pid" => 130200,
        "code" => 130224,
        "mark" => "河北省唐山市滦南县"
    ],
    [
        "name" => "乐亭县",
        "pid" => 130200,
        "code" => 130225,
        "mark" => "河北省唐山市乐亭县"
    ],
    [
        "name" => "迁西县",
        "pid" => 130200,
        "code" => 130227,
        "mark" => "河北省唐山市迁西县"
    ],
    [
        "name" => "玉田县",
        "pid" => 130200,
        "code" => 130229,
        "mark" => "河北省唐山市玉田县"
    ],
    [
        "name" => "遵化市",
        "pid" => 130200,
        "code" => 130281,
        "mark" => "河北省唐山市遵化市"
    ],
    [
        "name" => "迁安市",
        "pid" => 130200,
        "code" => 130283,
        "mark" => "河北省唐山市迁安市"
    ],
    [
        "name" => "秦皇岛市",
        "pid" => 130000,
        "code" => 130300,
        "mark" => "河北省秦皇岛市"
    ],
    [
        "name" => "海港区",
        "pid" => 130300,
        "code" => 130302,
        "mark" => "河北省秦皇岛市海港区"
    ],
    [
        "name" => "山海关区",
        "pid" => 130300,
        "code" => 130303,
        "mark" => "河北省秦皇岛市山海关区"
    ],
    [
        "name" => "北戴河区",
        "pid" => 130300,
        "code" => 130304,
        "mark" => "河北省秦皇岛市北戴河区"
    ],
    [
        "name" => "抚宁区",
        "pid" => 130300,
        "code" => 130306,
        "mark" => "河北省秦皇岛市抚宁区"
    ],
    [
        "name" => "青龙满族自治县",
        "pid" => 130300,
        "code" => 130321,
        "mark" => "河北省秦皇岛市青龙满族自治县"
    ],
    [
        "name" => "昌黎县",
        "pid" => 130300,
        "code" => 130322,
        "mark" => "河北省秦皇岛市昌黎县"
    ],
    [
        "name" => "卢龙县",
        "pid" => 130300,
        "code" => 130324,
        "mark" => "河北省秦皇岛市卢龙县"
    ],
    [
        "name" => "邯郸市",
        "pid" => 130000,
        "code" => 130400,
        "mark" => "河北省邯郸市"
    ],
    [
        "name" => "邯山区",
        "pid" => 130400,
        "code" => 130402,
        "mark" => "河北省邯郸市邯山区"
    ],
    [
        "name" => "丛台区",
        "pid" => 130400,
        "code" => 130403,
        "mark" => "河北省邯郸市丛台区"
    ],
    [
        "name" => "复兴区",
        "pid" => 130400,
        "code" => 130404,
        "mark" => "河北省邯郸市复兴区"
    ],
    [
        "name" => "峰峰矿区",
        "pid" => 130400,
        "code" => 130406,
        "mark" => "河北省邯郸市峰峰矿区"
    ],
    [
        "name" => "邯郸县",
        "pid" => 130400,
        "code" => 130421,
        "mark" => "河北省邯郸市邯郸县"
    ],
    [
        "name" => "临漳县",
        "pid" => 130400,
        "code" => 130423,
        "mark" => "河北省邯郸市临漳县"
    ],
    [
        "name" => "成安县",
        "pid" => 130400,
        "code" => 130424,
        "mark" => "河北省邯郸市成安县"
    ],
    [
        "name" => "大名县",
        "pid" => 130400,
        "code" => 130425,
        "mark" => "河北省邯郸市大名县"
    ],
    [
        "name" => "涉县",
        "pid" => 130400,
        "code" => 130426,
        "mark" => "河北省邯郸市涉县"
    ],
    [
        "name" => "磁县",
        "pid" => 130400,
        "code" => 130427,
        "mark" => "河北省邯郸市磁县"
    ],
    [
        "name" => "肥乡县",
        "pid" => 130400,
        "code" => 130428,
        "mark" => "河北省邯郸市肥乡县"
    ],
    [
        "name" => "永年县",
        "pid" => 130400,
        "code" => 130429,
        "mark" => "河北省邯郸市永年县"
    ],
    [
        "name" => "邱县",
        "pid" => 130400,
        "code" => 130430,
        "mark" => "河北省邯郸市邱县"
    ],
    [
        "name" => "鸡泽县",
        "pid" => 130400,
        "code" => 130431,
        "mark" => "河北省邯郸市鸡泽县"
    ],
    [
        "name" => "广平县",
        "pid" => 130400,
        "code" => 130432,
        "mark" => "河北省邯郸市广平县"
    ],
    [
        "name" => "馆陶县",
        "pid" => 130400,
        "code" => 130433,
        "mark" => "河北省邯郸市馆陶县"
    ],
    [
        "name" => "魏县",
        "pid" => 130400,
        "code" => 130434,
        "mark" => "河北省邯郸市魏县"
    ],
    [
        "name" => "曲周县",
        "pid" => 130400,
        "code" => 130435,
        "mark" => "河北省邯郸市曲周县"
    ],
    [
        "name" => "武安市",
        "pid" => 130400,
        "code" => 130481,
        "mark" => "河北省邯郸市武安市"
    ],
    [
        "name" => "邢台市",
        "pid" => 130000,
        "code" => 130500,
        "mark" => "河北省邢台市"
    ],
    [
        "name" => "桥东区",
        "pid" => 130500,
        "code" => 130502,
        "mark" => "河北省邢台市桥东区"
    ],
    [
        "name" => "桥西区",
        "pid" => 130500,
        "code" => 130503,
        "mark" => "河北省邢台市桥西区"
    ],
    [
        "name" => "邢台县",
        "pid" => 130500,
        "code" => 130521,
        "mark" => "河北省邢台市邢台县"
    ],
    [
        "name" => "临城县",
        "pid" => 130500,
        "code" => 130522,
        "mark" => "河北省邢台市临城县"
    ],
    [
        "name" => "内丘县",
        "pid" => 130500,
        "code" => 130523,
        "mark" => "河北省邢台市内丘县"
    ],
    [
        "name" => "柏乡县",
        "pid" => 130500,
        "code" => 130524,
        "mark" => "河北省邢台市柏乡县"
    ],
    [
        "name" => "隆尧县",
        "pid" => 130500,
        "code" => 130525,
        "mark" => "河北省邢台市隆尧县"
    ],
    [
        "name" => "任县",
        "pid" => 130500,
        "code" => 130526,
        "mark" => "河北省邢台市任县"
    ],
    [
        "name" => "南和县",
        "pid" => 130500,
        "code" => 130527,
        "mark" => "河北省邢台市南和县"
    ],
    [
        "name" => "宁晋县",
        "pid" => 130500,
        "code" => 130528,
        "mark" => "河北省邢台市宁晋县"
    ],
    [
        "name" => "巨鹿县",
        "pid" => 130500,
        "code" => 130529,
        "mark" => "河北省邢台市巨鹿县"
    ],
    [
        "name" => "新河县",
        "pid" => 130500,
        "code" => 130530,
        "mark" => "河北省邢台市新河县"
    ],
    [
        "name" => "广宗县",
        "pid" => 130500,
        "code" => 130531,
        "mark" => "河北省邢台市广宗县"
    ],
    [
        "name" => "平乡县",
        "pid" => 130500,
        "code" => 130532,
        "mark" => "河北省邢台市平乡县"
    ],
    [
        "name" => "威县",
        "pid" => 130500,
        "code" => 130533,
        "mark" => "河北省邢台市威县"
    ],
    [
        "name" => "清河县",
        "pid" => 130500,
        "code" => 130534,
        "mark" => "河北省邢台市清河县"
    ],
    [
        "name" => "临西县",
        "pid" => 130500,
        "code" => 130535,
        "mark" => "河北省邢台市临西县"
    ],
    [
        "name" => "南宫市",
        "pid" => 130500,
        "code" => 130581,
        "mark" => "河北省邢台市南宫市"
    ],
    [
        "name" => "沙河市",
        "pid" => 130500,
        "code" => 130582,
        "mark" => "河北省邢台市沙河市"
    ],
    [
        "name" => "保定市",
        "pid" => 130000,
        "code" => 130600,
        "mark" => "河北省保定市"
    ],
    [
        "name" => "竞秀区",
        "pid" => 130600,
        "code" => 130602,
        "mark" => "河北省保定市竞秀区"
    ],
    [
        "name" => "莲池区",
        "pid" => 130600,
        "code" => 130606,
        "mark" => "河北省保定市莲池区"
    ],
    [
        "name" => "满城区",
        "pid" => 130600,
        "code" => 130607,
        "mark" => "河北省保定市满城区"
    ],
    [
        "name" => "清苑区",
        "pid" => 130600,
        "code" => 130608,
        "mark" => "河北省保定市清苑区"
    ],
    [
        "name" => "徐水区",
        "pid" => 130600,
        "code" => 130609,
        "mark" => "河北省保定市徐水区"
    ],
    [
        "name" => "涞水县",
        "pid" => 130600,
        "code" => 130623,
        "mark" => "河北省保定市涞水县"
    ],
    [
        "name" => "阜平县",
        "pid" => 130600,
        "code" => 130624,
        "mark" => "河北省保定市阜平县"
    ],
    [
        "name" => "定兴县",
        "pid" => 130600,
        "code" => 130626,
        "mark" => "河北省保定市定兴县"
    ],
    [
        "name" => "唐县",
        "pid" => 130600,
        "code" => 130627,
        "mark" => "河北省保定市唐县"
    ],
    [
        "name" => "高阳县",
        "pid" => 130600,
        "code" => 130628,
        "mark" => "河北省保定市高阳县"
    ],
    [
        "name" => "容城县",
        "pid" => 130600,
        "code" => 130629,
        "mark" => "河北省保定市容城县"
    ],
    [
        "name" => "涞源县",
        "pid" => 130600,
        "code" => 130630,
        "mark" => "河北省保定市涞源县"
    ],
    [
        "name" => "望都县",
        "pid" => 130600,
        "code" => 130631,
        "mark" => "河北省保定市望都县"
    ],
    [
        "name" => "安新县",
        "pid" => 130600,
        "code" => 130632,
        "mark" => "河北省保定市安新县"
    ],
    [
        "name" => "易县",
        "pid" => 130600,
        "code" => 130633,
        "mark" => "河北省保定市易县"
    ],
    [
        "name" => "曲阳县",
        "pid" => 130600,
        "code" => 130634,
        "mark" => "河北省保定市曲阳县"
    ],
    [
        "name" => "蠡县",
        "pid" => 130600,
        "code" => 130635,
        "mark" => "河北省保定市蠡县"
    ],
    [
        "name" => "顺平县",
        "pid" => 130600,
        "code" => 130636,
        "mark" => "河北省保定市顺平县"
    ],
    [
        "name" => "博野县",
        "pid" => 130600,
        "code" => 130637,
        "mark" => "河北省保定市博野县"
    ],
    [
        "name" => "雄县",
        "pid" => 130600,
        "code" => 130638,
        "mark" => "河北省保定市雄县"
    ],
    [
        "name" => "涿州市",
        "pid" => 130600,
        "code" => 130681,
        "mark" => "河北省保定市涿州市"
    ],
    [
        "name" => "安国市",
        "pid" => 130600,
        "code" => 130683,
        "mark" => "河北省保定市安国市"
    ],
    [
        "name" => "高碑店市",
        "pid" => 130600,
        "code" => 130684,
        "mark" => "河北省保定市高碑店市"
    ],
    [
        "name" => "张家口市",
        "pid" => 130000,
        "code" => 130700,
        "mark" => "河北省张家口市"
    ],
    [
        "name" => "桥东区",
        "pid" => 130700,
        "code" => 130702,
        "mark" => "河北省张家口市桥东区"
    ],
    [
        "name" => "桥西区",
        "pid" => 130700,
        "code" => 130703,
        "mark" => "河北省张家口市桥西区"
    ],
    [
        "name" => "宣化区",
        "pid" => 130700,
        "code" => 130705,
        "mark" => "河北省张家口市宣化区"
    ],
    [
        "name" => "下花园区",
        "pid" => 130700,
        "code" => 130706,
        "mark" => "河北省张家口市下花园区"
    ],
    [
        "name" => "万全区",
        "pid" => 130700,
        "code" => 130708,
        "mark" => "河北省张家口市万全区"
    ],
    [
        "name" => "崇礼区",
        "pid" => 130700,
        "code" => 130709,
        "mark" => "河北省张家口市崇礼区"
    ],
    [
        "name" => "张北县",
        "pid" => 130700,
        "code" => 130722,
        "mark" => "河北省张家口市张北县"
    ],
    [
        "name" => "康保县",
        "pid" => 130700,
        "code" => 130723,
        "mark" => "河北省张家口市康保县"
    ],
    [
        "name" => "沽源县",
        "pid" => 130700,
        "code" => 130724,
        "mark" => "河北省张家口市沽源县"
    ],
    [
        "name" => "尚义县",
        "pid" => 130700,
        "code" => 130725,
        "mark" => "河北省张家口市尚义县"
    ],
    [
        "name" => "蔚县",
        "pid" => 130700,
        "code" => 130726,
        "mark" => "河北省张家口市蔚县"
    ],
    [
        "name" => "阳原县",
        "pid" => 130700,
        "code" => 130727,
        "mark" => "河北省张家口市阳原县"
    ],
    [
        "name" => "怀安县",
        "pid" => 130700,
        "code" => 130728,
        "mark" => "河北省张家口市怀安县"
    ],
    [
        "name" => "怀来县",
        "pid" => 130700,
        "code" => 130730,
        "mark" => "河北省张家口市怀来县"
    ],
    [
        "name" => "涿鹿县",
        "pid" => 130700,
        "code" => 130731,
        "mark" => "河北省张家口市涿鹿县"
    ],
    [
        "name" => "赤城县",
        "pid" => 130700,
        "code" => 130732,
        "mark" => "河北省张家口市赤城县"
    ],
    [
        "name" => "承德市",
        "pid" => 130000,
        "code" => 130800,
        "mark" => "河北省承德市"
    ],
    [
        "name" => "双桥区",
        "pid" => 130800,
        "code" => 130802,
        "mark" => "河北省承德市双桥区"
    ],
    [
        "name" => "双滦区",
        "pid" => 130800,
        "code" => 130803,
        "mark" => "河北省承德市双滦区"
    ],
    [
        "name" => "鹰手营子矿区",
        "pid" => 130800,
        "code" => 130804,
        "mark" => "河北省承德市鹰手营子矿区"
    ],
    [
        "name" => "承德县",
        "pid" => 130800,
        "code" => 130821,
        "mark" => "河北省承德市承德县"
    ],
    [
        "name" => "兴隆县",
        "pid" => 130800,
        "code" => 130822,
        "mark" => "河北省承德市兴隆县"
    ],
    [
        "name" => "平泉县",
        "pid" => 130800,
        "code" => 130823,
        "mark" => "河北省承德市平泉县"
    ],
    [
        "name" => "滦平县",
        "pid" => 130800,
        "code" => 130824,
        "mark" => "河北省承德市滦平县"
    ],
    [
        "name" => "隆化县",
        "pid" => 130800,
        "code" => 130825,
        "mark" => "河北省承德市隆化县"
    ],
    [
        "name" => "丰宁满族自治县",
        "pid" => 130800,
        "code" => 130826,
        "mark" => "河北省承德市丰宁满族自治县"
    ],
    [
        "name" => "宽城满族自治县",
        "pid" => 130800,
        "code" => 130827,
        "mark" => "河北省承德市宽城满族自治县"
    ],
    [
        "name" => "围场满族蒙古族自治县",
        "pid" => 130800,
        "code" => 130828,
        "mark" => "河北省承德市围场满族蒙古族自治县"
    ],
    [
        "name" => "沧州市",
        "pid" => 130000,
        "code" => 130900,
        "mark" => "河北省沧州市"
    ],
    [
        "name" => "新华区",
        "pid" => 130900,
        "code" => 130902,
        "mark" => "河北省沧州市新华区"
    ],
    [
        "name" => "运河区",
        "pid" => 130900,
        "code" => 130903,
        "mark" => "河北省沧州市运河区"
    ],
    [
        "name" => "沧县",
        "pid" => 130900,
        "code" => 130921,
        "mark" => "河北省沧州市沧县"
    ],
    [
        "name" => "青县",
        "pid" => 130900,
        "code" => 130922,
        "mark" => "河北省沧州市青县"
    ],
    [
        "name" => "东光县",
        "pid" => 130900,
        "code" => 130923,
        "mark" => "河北省沧州市东光县"
    ],
    [
        "name" => "海兴县",
        "pid" => 130900,
        "code" => 130924,
        "mark" => "河北省沧州市海兴县"
    ],
    [
        "name" => "盐山县",
        "pid" => 130900,
        "code" => 130925,
        "mark" => "河北省沧州市盐山县"
    ],
    [
        "name" => "肃宁县",
        "pid" => 130900,
        "code" => 130926,
        "mark" => "河北省沧州市肃宁县"
    ],
    [
        "name" => "南皮县",
        "pid" => 130900,
        "code" => 130927,
        "mark" => "河北省沧州市南皮县"
    ],
    [
        "name" => "吴桥县",
        "pid" => 130900,
        "code" => 130928,
        "mark" => "河北省沧州市吴桥县"
    ],
    [
        "name" => "献县",
        "pid" => 130900,
        "code" => 130929,
        "mark" => "河北省沧州市献县"
    ],
    [
        "name" => "孟村回族自治县",
        "pid" => 130900,
        "code" => 130930,
        "mark" => "河北省沧州市孟村回族自治县"
    ],
    [
        "name" => "泊头市",
        "pid" => 130900,
        "code" => 130981,
        "mark" => "河北省沧州市泊头市"
    ],
    [
        "name" => "任丘市",
        "pid" => 130900,
        "code" => 130982,
        "mark" => "河北省沧州市任丘市"
    ],
    [
        "name" => "黄骅市",
        "pid" => 130900,
        "code" => 130983,
        "mark" => "河北省沧州市黄骅市"
    ],
    [
        "name" => "河间市",
        "pid" => 130900,
        "code" => 130984,
        "mark" => "河北省沧州市河间市"
    ],
    [
        "name" => "廊坊市",
        "pid" => 130000,
        "code" => 131000,
        "mark" => "河北省廊坊市"
    ],
    [
        "name" => "安次区",
        "pid" => 131000,
        "code" => 131002,
        "mark" => "河北省廊坊市安次区"
    ],
    [
        "name" => "广阳区",
        "pid" => 131000,
        "code" => 131003,
        "mark" => "河北省廊坊市广阳区"
    ],
    [
        "name" => "固安县",
        "pid" => 131000,
        "code" => 131022,
        "mark" => "河北省廊坊市固安县"
    ],
    [
        "name" => "永清县",
        "pid" => 131000,
        "code" => 131023,
        "mark" => "河北省廊坊市永清县"
    ],
    [
        "name" => "香河县",
        "pid" => 131000,
        "code" => 131024,
        "mark" => "河北省廊坊市香河县"
    ],
    [
        "name" => "大城县",
        "pid" => 131000,
        "code" => 131025,
        "mark" => "河北省廊坊市大城县"
    ],
    [
        "name" => "文安县",
        "pid" => 131000,
        "code" => 131026,
        "mark" => "河北省廊坊市文安县"
    ],
    [
        "name" => "大厂回族自治县",
        "pid" => 131000,
        "code" => 131028,
        "mark" => "河北省廊坊市大厂回族自治县"
    ],
    [
        "name" => "霸州市",
        "pid" => 131000,
        "code" => 131081,
        "mark" => "河北省廊坊市霸州市"
    ],
    [
        "name" => "三河市",
        "pid" => 131000,
        "code" => 131082,
        "mark" => "河北省廊坊市三河市"
    ],
    [
        "name" => "衡水市",
        "pid" => 130000,
        "code" => 131100,
        "mark" => "河北省衡水市"
    ],
    [
        "name" => "桃城区",
        "pid" => 131100,
        "code" => 131102,
        "mark" => "河北省衡水市桃城区"
    ],
    [
        "name" => "冀州区",
        "pid" => 131100,
        "code" => 131103,
        "mark" => "河北省衡水市冀州区"
    ],
    [
        "name" => "枣强县",
        "pid" => 131100,
        "code" => 131121,
        "mark" => "河北省衡水市枣强县"
    ],
    [
        "name" => "武邑县",
        "pid" => 131100,
        "code" => 131122,
        "mark" => "河北省衡水市武邑县"
    ],
    [
        "name" => "武强县",
        "pid" => 131100,
        "code" => 131123,
        "mark" => "河北省衡水市武强县"
    ],
    [
        "name" => "饶阳县",
        "pid" => 131100,
        "code" => 131124,
        "mark" => "河北省衡水市饶阳县"
    ],
    [
        "name" => "安平县",
        "pid" => 131100,
        "code" => 131125,
        "mark" => "河北省衡水市安平县"
    ],
    [
        "name" => "故城县",
        "pid" => 131100,
        "code" => 131126,
        "mark" => "河北省衡水市故城县"
    ],
    [
        "name" => "景县",
        "pid" => 131100,
        "code" => 131127,
        "mark" => "河北省衡水市景县"
    ],
    [
        "name" => "阜城县",
        "pid" => 131100,
        "code" => 131128,
        "mark" => "河北省衡水市阜城县"
    ],
    [
        "name" => "深州市",
        "pid" => 131100,
        "code" => 131182,
        "mark" => "河北省衡水市深州市"
    ],
    [
        "name" => "定州市",
        "pid" => 130000,
        "code" => 139001,
        "mark" => "河北省定州市"
    ],
    [
        "name" => "辛集市",
        "pid" => 130000,
        "code" => 139002,
        "mark" => "河北省辛集市"
    ],
    [
        "name" => "山西省",
        "pid" => 86,
        "code" => 140000,
        "mark" => "山西省"
    ],
    [
        "name" => "太原市",
        "pid" => 140000,
        "code" => 140100,
        "mark" => "山西省太原市"
    ],
    [
        "name" => "小店区",
        "pid" => 140100,
        "code" => 140105,
        "mark" => "山西省太原市小店区"
    ],
    [
        "name" => "迎泽区",
        "pid" => 140100,
        "code" => 140106,
        "mark" => "山西省太原市迎泽区"
    ],
    [
        "name" => "杏花岭区",
        "pid" => 140100,
        "code" => 140107,
        "mark" => "山西省太原市杏花岭区"
    ],
    [
        "name" => "尖草坪区",
        "pid" => 140100,
        "code" => 140108,
        "mark" => "山西省太原市尖草坪区"
    ],
    [
        "name" => "万柏林区",
        "pid" => 140100,
        "code" => 140109,
        "mark" => "山西省太原市万柏林区"
    ],
    [
        "name" => "晋源区",
        "pid" => 140100,
        "code" => 140110,
        "mark" => "山西省太原市晋源区"
    ],
    [
        "name" => "清徐县",
        "pid" => 140100,
        "code" => 140121,
        "mark" => "山西省太原市清徐县"
    ],
    [
        "name" => "阳曲县",
        "pid" => 140100,
        "code" => 140122,
        "mark" => "山西省太原市阳曲县"
    ],
    [
        "name" => "娄烦县",
        "pid" => 140100,
        "code" => 140123,
        "mark" => "山西省太原市娄烦县"
    ],
    [
        "name" => "古交市",
        "pid" => 140100,
        "code" => 140181,
        "mark" => "山西省太原市古交市"
    ],
    [
        "name" => "大同市",
        "pid" => 140000,
        "code" => 140200,
        "mark" => "山西省大同市"
    ],
    [
        "name" => "城区",
        "pid" => 140200,
        "code" => 140202,
        "mark" => "山西省大同市城区"
    ],
    [
        "name" => "矿区",
        "pid" => 140200,
        "code" => 140203,
        "mark" => "山西省大同市矿区"
    ],
    [
        "name" => "南郊区",
        "pid" => 140200,
        "code" => 140211,
        "mark" => "山西省大同市南郊区"
    ],
    [
        "name" => "新荣区",
        "pid" => 140200,
        "code" => 140212,
        "mark" => "山西省大同市新荣区"
    ],
    [
        "name" => "阳高县",
        "pid" => 140200,
        "code" => 140221,
        "mark" => "山西省大同市阳高县"
    ],
    [
        "name" => "天镇县",
        "pid" => 140200,
        "code" => 140222,
        "mark" => "山西省大同市天镇县"
    ],
    [
        "name" => "广灵县",
        "pid" => 140200,
        "code" => 140223,
        "mark" => "山西省大同市广灵县"
    ],
    [
        "name" => "灵丘县",
        "pid" => 140200,
        "code" => 140224,
        "mark" => "山西省大同市灵丘县"
    ],
    [
        "name" => "浑源县",
        "pid" => 140200,
        "code" => 140225,
        "mark" => "山西省大同市浑源县"
    ],
    [
        "name" => "左云县",
        "pid" => 140200,
        "code" => 140226,
        "mark" => "山西省大同市左云县"
    ],
    [
        "name" => "大同县",
        "pid" => 140200,
        "code" => 140227,
        "mark" => "山西省大同市大同县"
    ],
    [
        "name" => "阳泉市",
        "pid" => 140000,
        "code" => 140300,
        "mark" => "山西省阳泉市"
    ],
    [
        "name" => "城区",
        "pid" => 140300,
        "code" => 140302,
        "mark" => "山西省阳泉市城区"
    ],
    [
        "name" => "矿区",
        "pid" => 140300,
        "code" => 140303,
        "mark" => "山西省阳泉市矿区"
    ],
    [
        "name" => "郊区",
        "pid" => 140300,
        "code" => 140311,
        "mark" => "山西省阳泉市郊区"
    ],
    [
        "name" => "平定县",
        "pid" => 140300,
        "code" => 140321,
        "mark" => "山西省阳泉市平定县"
    ],
    [
        "name" => "盂县",
        "pid" => 140300,
        "code" => 140322,
        "mark" => "山西省阳泉市盂县"
    ],
    [
        "name" => "长治市",
        "pid" => 140000,
        "code" => 140400,
        "mark" => "山西省长治市"
    ],
    [
        "name" => "城区",
        "pid" => 140400,
        "code" => 140402,
        "mark" => "山西省长治市城区"
    ],
    [
        "name" => "郊区",
        "pid" => 140400,
        "code" => 140411,
        "mark" => "山西省长治市郊区"
    ],
    [
        "name" => "长治县",
        "pid" => 140400,
        "code" => 140421,
        "mark" => "山西省长治市长治县"
    ],
    [
        "name" => "襄垣县",
        "pid" => 140400,
        "code" => 140423,
        "mark" => "山西省长治市襄垣县"
    ],
    [
        "name" => "屯留县",
        "pid" => 140400,
        "code" => 140424,
        "mark" => "山西省长治市屯留县"
    ],
    [
        "name" => "平顺县",
        "pid" => 140400,
        "code" => 140425,
        "mark" => "山西省长治市平顺县"
    ],
    [
        "name" => "黎城县",
        "pid" => 140400,
        "code" => 140426,
        "mark" => "山西省长治市黎城县"
    ],
    [
        "name" => "壶关县",
        "pid" => 140400,
        "code" => 140427,
        "mark" => "山西省长治市壶关县"
    ],
    [
        "name" => "长子县",
        "pid" => 140400,
        "code" => 140428,
        "mark" => "山西省长治市长子县"
    ],
    [
        "name" => "武乡县",
        "pid" => 140400,
        "code" => 140429,
        "mark" => "山西省长治市武乡县"
    ],
    [
        "name" => "沁县",
        "pid" => 140400,
        "code" => 140430,
        "mark" => "山西省长治市沁县"
    ],
    [
        "name" => "沁源县",
        "pid" => 140400,
        "code" => 140431,
        "mark" => "山西省长治市沁源县"
    ],
    [
        "name" => "潞城市",
        "pid" => 140400,
        "code" => 140481,
        "mark" => "山西省长治市潞城市"
    ],
    [
        "name" => "晋城市",
        "pid" => 140000,
        "code" => 140500,
        "mark" => "山西省晋城市"
    ],
    [
        "name" => "城区",
        "pid" => 140500,
        "code" => 140502,
        "mark" => "山西省晋城市城区"
    ],
    [
        "name" => "沁水县",
        "pid" => 140500,
        "code" => 140521,
        "mark" => "山西省晋城市沁水县"
    ],
    [
        "name" => "阳城县",
        "pid" => 140500,
        "code" => 140522,
        "mark" => "山西省晋城市阳城县"
    ],
    [
        "name" => "陵川县",
        "pid" => 140500,
        "code" => 140524,
        "mark" => "山西省晋城市陵川县"
    ],
    [
        "name" => "泽州县",
        "pid" => 140500,
        "code" => 140525,
        "mark" => "山西省晋城市泽州县"
    ],
    [
        "name" => "高平市",
        "pid" => 140500,
        "code" => 140581,
        "mark" => "山西省晋城市高平市"
    ],
    [
        "name" => "朔州市",
        "pid" => 140000,
        "code" => 140600,
        "mark" => "山西省朔州市"
    ],
    [
        "name" => "朔城区",
        "pid" => 140600,
        "code" => 140602,
        "mark" => "山西省朔州市朔城区"
    ],
    [
        "name" => "平鲁区",
        "pid" => 140600,
        "code" => 140603,
        "mark" => "山西省朔州市平鲁区"
    ],
    [
        "name" => "山阴县",
        "pid" => 140600,
        "code" => 140621,
        "mark" => "山西省朔州市山阴县"
    ],
    [
        "name" => "应县",
        "pid" => 140600,
        "code" => 140622,
        "mark" => "山西省朔州市应县"
    ],
    [
        "name" => "右玉县",
        "pid" => 140600,
        "code" => 140623,
        "mark" => "山西省朔州市右玉县"
    ],
    [
        "name" => "怀仁县",
        "pid" => 140600,
        "code" => 140624,
        "mark" => "山西省朔州市怀仁县"
    ],
    [
        "name" => "晋中市",
        "pid" => 140000,
        "code" => 140700,
        "mark" => "山西省晋中市"
    ],
    [
        "name" => "榆次区",
        "pid" => 140700,
        "code" => 140702,
        "mark" => "山西省晋中市榆次区"
    ],
    [
        "name" => "榆社县",
        "pid" => 140700,
        "code" => 140721,
        "mark" => "山西省晋中市榆社县"
    ],
    [
        "name" => "左权县",
        "pid" => 140700,
        "code" => 140722,
        "mark" => "山西省晋中市左权县"
    ],
    [
        "name" => "和顺县",
        "pid" => 140700,
        "code" => 140723,
        "mark" => "山西省晋中市和顺县"
    ],
    [
        "name" => "昔阳县",
        "pid" => 140700,
        "code" => 140724,
        "mark" => "山西省晋中市昔阳县"
    ],
    [
        "name" => "寿阳县",
        "pid" => 140700,
        "code" => 140725,
        "mark" => "山西省晋中市寿阳县"
    ],
    [
        "name" => "太谷县",
        "pid" => 140700,
        "code" => 140726,
        "mark" => "山西省晋中市太谷县"
    ],
    [
        "name" => "祁县",
        "pid" => 140700,
        "code" => 140727,
        "mark" => "山西省晋中市祁县"
    ],
    [
        "name" => "平遥县",
        "pid" => 140700,
        "code" => 140728,
        "mark" => "山西省晋中市平遥县"
    ],
    [
        "name" => "灵石县",
        "pid" => 140700,
        "code" => 140729,
        "mark" => "山西省晋中市灵石县"
    ],
    [
        "name" => "介休市",
        "pid" => 140700,
        "code" => 140781,
        "mark" => "山西省晋中市介休市"
    ],
    [
        "name" => "运城市",
        "pid" => 140000,
        "code" => 140800,
        "mark" => "山西省运城市"
    ],
    [
        "name" => "盐湖区",
        "pid" => 140800,
        "code" => 140802,
        "mark" => "山西省运城市盐湖区"
    ],
    [
        "name" => "临猗县",
        "pid" => 140800,
        "code" => 140821,
        "mark" => "山西省运城市临猗县"
    ],
    [
        "name" => "万荣县",
        "pid" => 140800,
        "code" => 140822,
        "mark" => "山西省运城市万荣县"
    ],
    [
        "name" => "闻喜县",
        "pid" => 140800,
        "code" => 140823,
        "mark" => "山西省运城市闻喜县"
    ],
    [
        "name" => "稷山县",
        "pid" => 140800,
        "code" => 140824,
        "mark" => "山西省运城市稷山县"
    ],
    [
        "name" => "新绛县",
        "pid" => 140800,
        "code" => 140825,
        "mark" => "山西省运城市新绛县"
    ],
    [
        "name" => "绛县",
        "pid" => 140800,
        "code" => 140826,
        "mark" => "山西省运城市绛县"
    ],
    [
        "name" => "垣曲县",
        "pid" => 140800,
        "code" => 140827,
        "mark" => "山西省运城市垣曲县"
    ],
    [
        "name" => "夏县",
        "pid" => 140800,
        "code" => 140828,
        "mark" => "山西省运城市夏县"
    ],
    [
        "name" => "平陆县",
        "pid" => 140800,
        "code" => 140829,
        "mark" => "山西省运城市平陆县"
    ],
    [
        "name" => "芮城县",
        "pid" => 140800,
        "code" => 140830,
        "mark" => "山西省运城市芮城县"
    ],
    [
        "name" => "永济市",
        "pid" => 140800,
        "code" => 140881,
        "mark" => "山西省运城市永济市"
    ],
    [
        "name" => "河津市",
        "pid" => 140800,
        "code" => 140882,
        "mark" => "山西省运城市河津市"
    ],
    [
        "name" => "忻州市",
        "pid" => 140000,
        "code" => 140900,
        "mark" => "山西省忻州市"
    ],
    [
        "name" => "忻府区",
        "pid" => 140900,
        "code" => 140902,
        "mark" => "山西省忻州市忻府区"
    ],
    [
        "name" => "定襄县",
        "pid" => 140900,
        "code" => 140921,
        "mark" => "山西省忻州市定襄县"
    ],
    [
        "name" => "五台县",
        "pid" => 140900,
        "code" => 140922,
        "mark" => "山西省忻州市五台县"
    ],
    [
        "name" => "代县",
        "pid" => 140900,
        "code" => 140923,
        "mark" => "山西省忻州市代县"
    ],
    [
        "name" => "繁峙县",
        "pid" => 140900,
        "code" => 140924,
        "mark" => "山西省忻州市繁峙县"
    ],
    [
        "name" => "宁武县",
        "pid" => 140900,
        "code" => 140925,
        "mark" => "山西省忻州市宁武县"
    ],
    [
        "name" => "静乐县",
        "pid" => 140900,
        "code" => 140926,
        "mark" => "山西省忻州市静乐县"
    ],
    [
        "name" => "神池县",
        "pid" => 140900,
        "code" => 140927,
        "mark" => "山西省忻州市神池县"
    ],
    [
        "name" => "五寨县",
        "pid" => 140900,
        "code" => 140928,
        "mark" => "山西省忻州市五寨县"
    ],
    [
        "name" => "岢岚县",
        "pid" => 140900,
        "code" => 140929,
        "mark" => "山西省忻州市岢岚县"
    ],
    [
        "name" => "河曲县",
        "pid" => 140900,
        "code" => 140930,
        "mark" => "山西省忻州市河曲县"
    ],
    [
        "name" => "保德县",
        "pid" => 140900,
        "code" => 140931,
        "mark" => "山西省忻州市保德县"
    ],
    [
        "name" => "偏关县",
        "pid" => 140900,
        "code" => 140932,
        "mark" => "山西省忻州市偏关县"
    ],
    [
        "name" => "原平市",
        "pid" => 140900,
        "code" => 140981,
        "mark" => "山西省忻州市原平市"
    ],
    [
        "name" => "临汾市",
        "pid" => 140000,
        "code" => 141000,
        "mark" => "山西省临汾市"
    ],
    [
        "name" => "尧都区",
        "pid" => 141000,
        "code" => 141002,
        "mark" => "山西省临汾市尧都区"
    ],
    [
        "name" => "曲沃县",
        "pid" => 141000,
        "code" => 141021,
        "mark" => "山西省临汾市曲沃县"
    ],
    [
        "name" => "翼城县",
        "pid" => 141000,
        "code" => 141022,
        "mark" => "山西省临汾市翼城县"
    ],
    [
        "name" => "襄汾县",
        "pid" => 141000,
        "code" => 141023,
        "mark" => "山西省临汾市襄汾县"
    ],
    [
        "name" => "洪洞县",
        "pid" => 141000,
        "code" => 141024,
        "mark" => "山西省临汾市洪洞县"
    ],
    [
        "name" => "古县",
        "pid" => 141000,
        "code" => 141025,
        "mark" => "山西省临汾市古县"
    ],
    [
        "name" => "安泽县",
        "pid" => 141000,
        "code" => 141026,
        "mark" => "山西省临汾市安泽县"
    ],
    [
        "name" => "浮山县",
        "pid" => 141000,
        "code" => 141027,
        "mark" => "山西省临汾市浮山县"
    ],
    [
        "name" => "吉县",
        "pid" => 141000,
        "code" => 141028,
        "mark" => "山西省临汾市吉县"
    ],
    [
        "name" => "乡宁县",
        "pid" => 141000,
        "code" => 141029,
        "mark" => "山西省临汾市乡宁县"
    ],
    [
        "name" => "大宁县",
        "pid" => 141000,
        "code" => 141030,
        "mark" => "山西省临汾市大宁县"
    ],
    [
        "name" => "隰县",
        "pid" => 141000,
        "code" => 141031,
        "mark" => "山西省临汾市隰县"
    ],
    [
        "name" => "永和县",
        "pid" => 141000,
        "code" => 141032,
        "mark" => "山西省临汾市永和县"
    ],
    [
        "name" => "蒲县",
        "pid" => 141000,
        "code" => 141033,
        "mark" => "山西省临汾市蒲县"
    ],
    [
        "name" => "汾西县",
        "pid" => 141000,
        "code" => 141034,
        "mark" => "山西省临汾市汾西县"
    ],
    [
        "name" => "侯马市",
        "pid" => 141000,
        "code" => 141081,
        "mark" => "山西省临汾市侯马市"
    ],
    [
        "name" => "霍州市",
        "pid" => 141000,
        "code" => 141082,
        "mark" => "山西省临汾市霍州市"
    ],
    [
        "name" => "吕梁市",
        "pid" => 140000,
        "code" => 141100,
        "mark" => "山西省吕梁市"
    ],
    [
        "name" => "离石区",
        "pid" => 141100,
        "code" => 141102,
        "mark" => "山西省吕梁市离石区"
    ],
    [
        "name" => "文水县",
        "pid" => 141100,
        "code" => 141121,
        "mark" => "山西省吕梁市文水县"
    ],
    [
        "name" => "交城县",
        "pid" => 141100,
        "code" => 141122,
        "mark" => "山西省吕梁市交城县"
    ],
    [
        "name" => "兴县",
        "pid" => 141100,
        "code" => 141123,
        "mark" => "山西省吕梁市兴县"
    ],
    [
        "name" => "临县",
        "pid" => 141100,
        "code" => 141124,
        "mark" => "山西省吕梁市临县"
    ],
    [
        "name" => "柳林县",
        "pid" => 141100,
        "code" => 141125,
        "mark" => "山西省吕梁市柳林县"
    ],
    [
        "name" => "石楼县",
        "pid" => 141100,
        "code" => 141126,
        "mark" => "山西省吕梁市石楼县"
    ],
    [
        "name" => "岚县",
        "pid" => 141100,
        "code" => 141127,
        "mark" => "山西省吕梁市岚县"
    ],
    [
        "name" => "方山县",
        "pid" => 141100,
        "code" => 141128,
        "mark" => "山西省吕梁市方山县"
    ],
    [
        "name" => "中阳县",
        "pid" => 141100,
        "code" => 141129,
        "mark" => "山西省吕梁市中阳县"
    ],
    [
        "name" => "交口县",
        "pid" => 141100,
        "code" => 141130,
        "mark" => "山西省吕梁市交口县"
    ],
    [
        "name" => "孝义市",
        "pid" => 141100,
        "code" => 141181,
        "mark" => "山西省吕梁市孝义市"
    ],
    [
        "name" => "汾阳市",
        "pid" => 141100,
        "code" => 141182,
        "mark" => "山西省吕梁市汾阳市"
    ],
    [
        "name" => "内蒙古自治区",
        "pid" => 86,
        "code" => 150000,
        "mark" => "内蒙古自治区"
    ],
    [
        "name" => "呼和浩特市",
        "pid" => 150000,
        "code" => 150100,
        "mark" => "内蒙古自治区呼和浩特市"
    ],
    [
        "name" => "新城区",
        "pid" => 150100,
        "code" => 150102,
        "mark" => "内蒙古自治区呼和浩特市新城区"
    ],
    [
        "name" => "回民区",
        "pid" => 150100,
        "code" => 150103,
        "mark" => "内蒙古自治区呼和浩特市回民区"
    ],
    [
        "name" => "玉泉区",
        "pid" => 150100,
        "code" => 150104,
        "mark" => "内蒙古自治区呼和浩特市玉泉区"
    ],
    [
        "name" => "赛罕区",
        "pid" => 150100,
        "code" => 150105,
        "mark" => "内蒙古自治区呼和浩特市赛罕区"
    ],
    [
        "name" => "土默特左旗",
        "pid" => 150100,
        "code" => 150121,
        "mark" => "内蒙古自治区呼和浩特市土默特左旗"
    ],
    [
        "name" => "托克托县",
        "pid" => 150100,
        "code" => 150122,
        "mark" => "内蒙古自治区呼和浩特市托克托县"
    ],
    [
        "name" => "和林格尔县",
        "pid" => 150100,
        "code" => 150123,
        "mark" => "内蒙古自治区呼和浩特市和林格尔县"
    ],
    [
        "name" => "清水河县",
        "pid" => 150100,
        "code" => 150124,
        "mark" => "内蒙古自治区呼和浩特市清水河县"
    ],
    [
        "name" => "武川县",
        "pid" => 150100,
        "code" => 150125,
        "mark" => "内蒙古自治区呼和浩特市武川县"
    ],
    [
        "name" => "包头市",
        "pid" => 150000,
        "code" => 150200,
        "mark" => "内蒙古自治区包头市"
    ],
    [
        "name" => "东河区",
        "pid" => 150200,
        "code" => 150202,
        "mark" => "内蒙古自治区包头市东河区"
    ],
    [
        "name" => "昆都仑区",
        "pid" => 150200,
        "code" => 150203,
        "mark" => "内蒙古自治区包头市昆都仑区"
    ],
    [
        "name" => "青山区",
        "pid" => 150200,
        "code" => 150204,
        "mark" => "内蒙古自治区包头市青山区"
    ],
    [
        "name" => "石拐区",
        "pid" => 150200,
        "code" => 150205,
        "mark" => "内蒙古自治区包头市石拐区"
    ],
    [
        "name" => "白云鄂博矿区",
        "pid" => 150200,
        "code" => 150206,
        "mark" => "内蒙古自治区包头市白云鄂博矿区"
    ],
    [
        "name" => "九原区",
        "pid" => 150200,
        "code" => 150207,
        "mark" => "内蒙古自治区包头市九原区"
    ],
    [
        "name" => "土默特右旗",
        "pid" => 150200,
        "code" => 150221,
        "mark" => "内蒙古自治区包头市土默特右旗"
    ],
    [
        "name" => "固阳县",
        "pid" => 150200,
        "code" => 150222,
        "mark" => "内蒙古自治区包头市固阳县"
    ],
    [
        "name" => "达尔罕茂明安联合旗",
        "pid" => 150200,
        "code" => 150223,
        "mark" => "内蒙古自治区包头市达尔罕茂明安联合旗"
    ],
    [
        "name" => "乌海市",
        "pid" => 150000,
        "code" => 150300,
        "mark" => "内蒙古自治区乌海市"
    ],
    [
        "name" => "海勃湾区",
        "pid" => 150300,
        "code" => 150302,
        "mark" => "内蒙古自治区乌海市海勃湾区"
    ],
    [
        "name" => "海南区",
        "pid" => 150300,
        "code" => 150303,
        "mark" => "内蒙古自治区乌海市海南区"
    ],
    [
        "name" => "乌达区",
        "pid" => 150300,
        "code" => 150304,
        "mark" => "内蒙古自治区乌海市乌达区"
    ],
    [
        "name" => "赤峰市",
        "pid" => 150000,
        "code" => 150400,
        "mark" => "内蒙古自治区赤峰市"
    ],
    [
        "name" => "红山区",
        "pid" => 150400,
        "code" => 150402,
        "mark" => "内蒙古自治区赤峰市红山区"
    ],
    [
        "name" => "元宝山区",
        "pid" => 150400,
        "code" => 150403,
        "mark" => "内蒙古自治区赤峰市元宝山区"
    ],
    [
        "name" => "松山区",
        "pid" => 150400,
        "code" => 150404,
        "mark" => "内蒙古自治区赤峰市松山区"
    ],
    [
        "name" => "阿鲁科尔沁旗",
        "pid" => 150400,
        "code" => 150421,
        "mark" => "内蒙古自治区赤峰市阿鲁科尔沁旗"
    ],
    [
        "name" => "巴林左旗",
        "pid" => 150400,
        "code" => 150422,
        "mark" => "内蒙古自治区赤峰市巴林左旗"
    ],
    [
        "name" => "巴林右旗",
        "pid" => 150400,
        "code" => 150423,
        "mark" => "内蒙古自治区赤峰市巴林右旗"
    ],
    [
        "name" => "林西县",
        "pid" => 150400,
        "code" => 150424,
        "mark" => "内蒙古自治区赤峰市林西县"
    ],
    [
        "name" => "克什克腾旗",
        "pid" => 150400,
        "code" => 150425,
        "mark" => "内蒙古自治区赤峰市克什克腾旗"
    ],
    [
        "name" => "翁牛特旗",
        "pid" => 150400,
        "code" => 150426,
        "mark" => "内蒙古自治区赤峰市翁牛特旗"
    ],
    [
        "name" => "喀喇沁旗",
        "pid" => 150400,
        "code" => 150428,
        "mark" => "内蒙古自治区赤峰市喀喇沁旗"
    ],
    [
        "name" => "宁城县",
        "pid" => 150400,
        "code" => 150429,
        "mark" => "内蒙古自治区赤峰市宁城县"
    ],
    [
        "name" => "敖汉旗",
        "pid" => 150400,
        "code" => 150430,
        "mark" => "内蒙古自治区赤峰市敖汉旗"
    ],
    [
        "name" => "通辽市",
        "pid" => 150000,
        "code" => 150500,
        "mark" => "内蒙古自治区通辽市"
    ],
    [
        "name" => "科尔沁区",
        "pid" => 150500,
        "code" => 150502,
        "mark" => "内蒙古自治区通辽市科尔沁区"
    ],
    [
        "name" => "科尔沁左翼中旗",
        "pid" => 150500,
        "code" => 150521,
        "mark" => "内蒙古自治区通辽市科尔沁左翼中旗"
    ],
    [
        "name" => "科尔沁左翼后旗",
        "pid" => 150500,
        "code" => 150522,
        "mark" => "内蒙古自治区通辽市科尔沁左翼后旗"
    ],
    [
        "name" => "开鲁县",
        "pid" => 150500,
        "code" => 150523,
        "mark" => "内蒙古自治区通辽市开鲁县"
    ],
    [
        "name" => "库伦旗",
        "pid" => 150500,
        "code" => 150524,
        "mark" => "内蒙古自治区通辽市库伦旗"
    ],
    [
        "name" => "奈曼旗",
        "pid" => 150500,
        "code" => 150525,
        "mark" => "内蒙古自治区通辽市奈曼旗"
    ],
    [
        "name" => "扎鲁特旗",
        "pid" => 150500,
        "code" => 150526,
        "mark" => "内蒙古自治区通辽市扎鲁特旗"
    ],
    [
        "name" => "霍林郭勒市",
        "pid" => 150500,
        "code" => 150581,
        "mark" => "内蒙古自治区通辽市霍林郭勒市"
    ],
    [
        "name" => "鄂尔多斯市",
        "pid" => 150000,
        "code" => 150600,
        "mark" => "内蒙古自治区鄂尔多斯市"
    ],
    [
        "name" => "东胜区",
        "pid" => 150600,
        "code" => 150602,
        "mark" => "内蒙古自治区鄂尔多斯市东胜区"
    ],
    [
        "name" => "康巴什区",
        "pid" => 150600,
        "code" => 150603,
        "mark" => "内蒙古自治区鄂尔多斯市康巴什区"
    ],
    [
        "name" => "达拉特旗",
        "pid" => 150600,
        "code" => 150621,
        "mark" => "内蒙古自治区鄂尔多斯市达拉特旗"
    ],
    [
        "name" => "准格尔旗",
        "pid" => 150600,
        "code" => 150622,
        "mark" => "内蒙古自治区鄂尔多斯市准格尔旗"
    ],
    [
        "name" => "鄂托克前旗",
        "pid" => 150600,
        "code" => 150623,
        "mark" => "内蒙古自治区鄂尔多斯市鄂托克前旗"
    ],
    [
        "name" => "鄂托克旗",
        "pid" => 150600,
        "code" => 150624,
        "mark" => "内蒙古自治区鄂尔多斯市鄂托克旗"
    ],
    [
        "name" => "杭锦旗",
        "pid" => 150600,
        "code" => 150625,
        "mark" => "内蒙古自治区鄂尔多斯市杭锦旗"
    ],
    [
        "name" => "乌审旗",
        "pid" => 150600,
        "code" => 150626,
        "mark" => "内蒙古自治区鄂尔多斯市乌审旗"
    ],
    [
        "name" => "伊金霍洛旗",
        "pid" => 150600,
        "code" => 150627,
        "mark" => "内蒙古自治区鄂尔多斯市伊金霍洛旗"
    ],
    [
        "name" => "呼伦贝尔市",
        "pid" => 150000,
        "code" => 150700,
        "mark" => "内蒙古自治区呼伦贝尔市"
    ],
    [
        "name" => "海拉尔区",
        "pid" => 150700,
        "code" => 150702,
        "mark" => "内蒙古自治区呼伦贝尔市海拉尔区"
    ],
    [
        "name" => "扎赉诺尔区",
        "pid" => 150700,
        "code" => 150703,
        "mark" => "内蒙古自治区呼伦贝尔市扎赉诺尔区"
    ],
    [
        "name" => "阿荣旗",
        "pid" => 150700,
        "code" => 150721,
        "mark" => "内蒙古自治区呼伦贝尔市阿荣旗"
    ],
    [
        "name" => "莫力达瓦达斡尔族自治旗",
        "pid" => 150700,
        "code" => 150722,
        "mark" => "内蒙古自治区呼伦贝尔市莫力达瓦达斡尔族自治旗"
    ],
    [
        "name" => "鄂伦春自治旗",
        "pid" => 150700,
        "code" => 150723,
        "mark" => "内蒙古自治区呼伦贝尔市鄂伦春自治旗"
    ],
    [
        "name" => "鄂温克族自治旗",
        "pid" => 150700,
        "code" => 150724,
        "mark" => "内蒙古自治区呼伦贝尔市鄂温克族自治旗"
    ],
    [
        "name" => "陈巴尔虎旗",
        "pid" => 150700,
        "code" => 150725,
        "mark" => "内蒙古自治区呼伦贝尔市陈巴尔虎旗"
    ],
    [
        "name" => "新巴尔虎左旗",
        "pid" => 150700,
        "code" => 150726,
        "mark" => "内蒙古自治区呼伦贝尔市新巴尔虎左旗"
    ],
    [
        "name" => "新巴尔虎右旗",
        "pid" => 150700,
        "code" => 150727,
        "mark" => "内蒙古自治区呼伦贝尔市新巴尔虎右旗"
    ],
    [
        "name" => "满洲里市",
        "pid" => 150700,
        "code" => 150781,
        "mark" => "内蒙古自治区呼伦贝尔市满洲里市"
    ],
    [
        "name" => "牙克石市",
        "pid" => 150700,
        "code" => 150782,
        "mark" => "内蒙古自治区呼伦贝尔市牙克石市"
    ],
    [
        "name" => "扎兰屯市",
        "pid" => 150700,
        "code" => 150783,
        "mark" => "内蒙古自治区呼伦贝尔市扎兰屯市"
    ],
    [
        "name" => "额尔古纳市",
        "pid" => 150700,
        "code" => 150784,
        "mark" => "内蒙古自治区呼伦贝尔市额尔古纳市"
    ],
    [
        "name" => "根河市",
        "pid" => 150700,
        "code" => 150785,
        "mark" => "内蒙古自治区呼伦贝尔市根河市"
    ],
    [
        "name" => "巴彦淖尔市",
        "pid" => 150000,
        "code" => 150800,
        "mark" => "内蒙古自治区巴彦淖尔市"
    ],
    [
        "name" => "临河区",
        "pid" => 150800,
        "code" => 150802,
        "mark" => "内蒙古自治区巴彦淖尔市临河区"
    ],
    [
        "name" => "五原县",
        "pid" => 150800,
        "code" => 150821,
        "mark" => "内蒙古自治区巴彦淖尔市五原县"
    ],
    [
        "name" => "磴口县",
        "pid" => 150800,
        "code" => 150822,
        "mark" => "内蒙古自治区巴彦淖尔市磴口县"
    ],
    [
        "name" => "乌拉特前旗",
        "pid" => 150800,
        "code" => 150823,
        "mark" => "内蒙古自治区巴彦淖尔市乌拉特前旗"
    ],
    [
        "name" => "乌拉特中旗",
        "pid" => 150800,
        "code" => 150824,
        "mark" => "内蒙古自治区巴彦淖尔市乌拉特中旗"
    ],
    [
        "name" => "乌拉特后旗",
        "pid" => 150800,
        "code" => 150825,
        "mark" => "内蒙古自治区巴彦淖尔市乌拉特后旗"
    ],
    [
        "name" => "杭锦后旗",
        "pid" => 150800,
        "code" => 150826,
        "mark" => "内蒙古自治区巴彦淖尔市杭锦后旗"
    ],
    [
        "name" => "乌兰察布市",
        "pid" => 150000,
        "code" => 150900,
        "mark" => "内蒙古自治区乌兰察布市"
    ],
    [
        "name" => "集宁区",
        "pid" => 150900,
        "code" => 150902,
        "mark" => "内蒙古自治区乌兰察布市集宁区"
    ],
    [
        "name" => "卓资县",
        "pid" => 150900,
        "code" => 150921,
        "mark" => "内蒙古自治区乌兰察布市卓资县"
    ],
    [
        "name" => "化德县",
        "pid" => 150900,
        "code" => 150922,
        "mark" => "内蒙古自治区乌兰察布市化德县"
    ],
    [
        "name" => "商都县",
        "pid" => 150900,
        "code" => 150923,
        "mark" => "内蒙古自治区乌兰察布市商都县"
    ],
    [
        "name" => "兴和县",
        "pid" => 150900,
        "code" => 150924,
        "mark" => "内蒙古自治区乌兰察布市兴和县"
    ],
    [
        "name" => "凉城县",
        "pid" => 150900,
        "code" => 150925,
        "mark" => "内蒙古自治区乌兰察布市凉城县"
    ],
    [
        "name" => "察哈尔右翼前旗",
        "pid" => 150900,
        "code" => 150926,
        "mark" => "内蒙古自治区乌兰察布市察哈尔右翼前旗"
    ],
    [
        "name" => "察哈尔右翼中旗",
        "pid" => 150900,
        "code" => 150927,
        "mark" => "内蒙古自治区乌兰察布市察哈尔右翼中旗"
    ],
    [
        "name" => "察哈尔右翼后旗",
        "pid" => 150900,
        "code" => 150928,
        "mark" => "内蒙古自治区乌兰察布市察哈尔右翼后旗"
    ],
    [
        "name" => "四子王旗",
        "pid" => 150900,
        "code" => 150929,
        "mark" => "内蒙古自治区乌兰察布市四子王旗"
    ],
    [
        "name" => "丰镇市",
        "pid" => 150900,
        "code" => 150981,
        "mark" => "内蒙古自治区乌兰察布市丰镇市"
    ],
    [
        "name" => "兴安盟",
        "pid" => 150900,
        "code" => 152200,
        "mark" => "内蒙古自治区乌兰察布市兴安盟"
    ],
    [
        "name" => "乌兰浩特市",
        "pid" => 150900,
        "code" => 152201,
        "mark" => "内蒙古自治区乌兰察布市乌兰浩特市"
    ],
    [
        "name" => "阿尔山市",
        "pid" => 150900,
        "code" => 152202,
        "mark" => "内蒙古自治区乌兰察布市阿尔山市"
    ],
    [
        "name" => "科尔沁右翼前旗",
        "pid" => 150900,
        "code" => 152221,
        "mark" => "内蒙古自治区乌兰察布市科尔沁右翼前旗"
    ],
    [
        "name" => "科尔沁右翼中旗",
        "pid" => 150900,
        "code" => 152222,
        "mark" => "内蒙古自治区乌兰察布市科尔沁右翼中旗"
    ],
    [
        "name" => "扎赉特旗",
        "pid" => 150900,
        "code" => 152223,
        "mark" => "内蒙古自治区乌兰察布市扎赉特旗"
    ],
    [
        "name" => "突泉县",
        "pid" => 150900,
        "code" => 152224,
        "mark" => "内蒙古自治区乌兰察布市突泉县"
    ],
    [
        "name" => "锡林郭勒盟",
        "pid" => 150000,
        "code" => 152500,
        "mark" => "内蒙古自治区锡林郭勒盟"
    ],
    [
        "name" => "二连浩特市",
        "pid" => 152500,
        "code" => 152501,
        "mark" => "内蒙古自治区锡林郭勒盟二连浩特市"
    ],
    [
        "name" => "锡林浩特市",
        "pid" => 152500,
        "code" => 152502,
        "mark" => "内蒙古自治区锡林郭勒盟锡林浩特市"
    ],
    [
        "name" => "阿巴嘎旗",
        "pid" => 152500,
        "code" => 152522,
        "mark" => "内蒙古自治区锡林郭勒盟阿巴嘎旗"
    ],
    [
        "name" => "苏尼特左旗",
        "pid" => 152500,
        "code" => 152523,
        "mark" => "内蒙古自治区锡林郭勒盟苏尼特左旗"
    ],
    [
        "name" => "苏尼特右旗",
        "pid" => 152500,
        "code" => 152524,
        "mark" => "内蒙古自治区锡林郭勒盟苏尼特右旗"
    ],
    [
        "name" => "东乌珠穆沁旗",
        "pid" => 152500,
        "code" => 152525,
        "mark" => "内蒙古自治区锡林郭勒盟东乌珠穆沁旗"
    ],
    [
        "name" => "西乌珠穆沁旗",
        "pid" => 152500,
        "code" => 152526,
        "mark" => "内蒙古自治区锡林郭勒盟西乌珠穆沁旗"
    ],
    [
        "name" => "太仆寺旗",
        "pid" => 152500,
        "code" => 152527,
        "mark" => "内蒙古自治区锡林郭勒盟太仆寺旗"
    ],
    [
        "name" => "镶黄旗",
        "pid" => 152500,
        "code" => 152528,
        "mark" => "内蒙古自治区锡林郭勒盟镶黄旗"
    ],
    [
        "name" => "正镶白旗",
        "pid" => 152500,
        "code" => 152529,
        "mark" => "内蒙古自治区锡林郭勒盟正镶白旗"
    ],
    [
        "name" => "正蓝旗",
        "pid" => 152500,
        "code" => 152530,
        "mark" => "内蒙古自治区锡林郭勒盟正蓝旗"
    ],
    [
        "name" => "多伦县",
        "pid" => 152500,
        "code" => 152531,
        "mark" => "内蒙古自治区锡林郭勒盟多伦县"
    ],
    [
        "name" => "阿拉善盟",
        "pid" => 150000,
        "code" => 152900,
        "mark" => "内蒙古自治区阿拉善盟"
    ],
    [
        "name" => "阿拉善左旗",
        "pid" => 152900,
        "code" => 152921,
        "mark" => "内蒙古自治区阿拉善盟阿拉善左旗"
    ],
    [
        "name" => "阿拉善右旗",
        "pid" => 152900,
        "code" => 152922,
        "mark" => "内蒙古自治区阿拉善盟阿拉善右旗"
    ],
    [
        "name" => "额济纳旗",
        "pid" => 152900,
        "code" => 152923,
        "mark" => "内蒙古自治区阿拉善盟额济纳旗"
    ],
    [
        "name" => "辽宁省",
        "pid" => 86,
        "code" => 210000,
        "mark" => "辽宁省"
    ],
    [
        "name" => "沈阳市",
        "pid" => 210000,
        "code" => 210100,
        "mark" => "辽宁省沈阳市"
    ],
    [
        "name" => "和平区",
        "pid" => 210100,
        "code" => 210102,
        "mark" => "辽宁省沈阳市和平区"
    ],
    [
        "name" => "沈河区",
        "pid" => 210100,
        "code" => 210103,
        "mark" => "辽宁省沈阳市沈河区"
    ],
    [
        "name" => "大东区",
        "pid" => 210100,
        "code" => 210104,
        "mark" => "辽宁省沈阳市大东区"
    ],
    [
        "name" => "皇姑区",
        "pid" => 210100,
        "code" => 210105,
        "mark" => "辽宁省沈阳市皇姑区"
    ],
    [
        "name" => "铁西区",
        "pid" => 210100,
        "code" => 210106,
        "mark" => "辽宁省沈阳市铁西区"
    ],
    [
        "name" => "苏家屯区",
        "pid" => 210100,
        "code" => 210111,
        "mark" => "辽宁省沈阳市苏家屯区"
    ],
    [
        "name" => "浑南区",
        "pid" => 210100,
        "code" => 210112,
        "mark" => "辽宁省沈阳市浑南区"
    ],
    [
        "name" => "沈北新区",
        "pid" => 210100,
        "code" => 210113,
        "mark" => "辽宁省沈阳市沈北新区"
    ],
    [
        "name" => "于洪区",
        "pid" => 210100,
        "code" => 210114,
        "mark" => "辽宁省沈阳市于洪区"
    ],
    [
        "name" => "辽中区",
        "pid" => 210100,
        "code" => 210115,
        "mark" => "辽宁省沈阳市辽中区"
    ],
    [
        "name" => "康平县",
        "pid" => 210100,
        "code" => 210123,
        "mark" => "辽宁省沈阳市康平县"
    ],
    [
        "name" => "法库县",
        "pid" => 210100,
        "code" => 210124,
        "mark" => "辽宁省沈阳市法库县"
    ],
    [
        "name" => "新民市",
        "pid" => 210100,
        "code" => 210181,
        "mark" => "辽宁省沈阳市新民市"
    ],
    [
        "name" => "大连市",
        "pid" => 210000,
        "code" => 210200,
        "mark" => "辽宁省大连市"
    ],
    [
        "name" => "中山区",
        "pid" => 210200,
        "code" => 210202,
        "mark" => "辽宁省大连市中山区"
    ],
    [
        "name" => "西岗区",
        "pid" => 210200,
        "code" => 210203,
        "mark" => "辽宁省大连市西岗区"
    ],
    [
        "name" => "沙河口区",
        "pid" => 210200,
        "code" => 210204,
        "mark" => "辽宁省大连市沙河口区"
    ],
    [
        "name" => "甘井子区",
        "pid" => 210200,
        "code" => 210211,
        "mark" => "辽宁省大连市甘井子区"
    ],
    [
        "name" => "旅顺口区",
        "pid" => 210200,
        "code" => 210212,
        "mark" => "辽宁省大连市旅顺口区"
    ],
    [
        "name" => "金州区",
        "pid" => 210200,
        "code" => 210213,
        "mark" => "辽宁省大连市金州区"
    ],
    [
        "name" => "普兰店区",
        "pid" => 210200,
        "code" => 210214,
        "mark" => "辽宁省大连市普兰店区"
    ],
    [
        "name" => "长海县",
        "pid" => 210200,
        "code" => 210224,
        "mark" => "辽宁省大连市长海县"
    ],
    [
        "name" => "瓦房店市",
        "pid" => 210200,
        "code" => 210281,
        "mark" => "辽宁省大连市瓦房店市"
    ],
    [
        "name" => "庄河市",
        "pid" => 210200,
        "code" => 210283,
        "mark" => "辽宁省大连市庄河市"
    ],
    [
        "name" => "鞍山市",
        "pid" => 210000,
        "code" => 210300,
        "mark" => "辽宁省鞍山市"
    ],
    [
        "name" => "铁东区",
        "pid" => 210300,
        "code" => 210302,
        "mark" => "辽宁省鞍山市铁东区"
    ],
    [
        "name" => "铁西区",
        "pid" => 210300,
        "code" => 210303,
        "mark" => "辽宁省鞍山市铁西区"
    ],
    [
        "name" => "立山区",
        "pid" => 210300,
        "code" => 210304,
        "mark" => "辽宁省鞍山市立山区"
    ],
    [
        "name" => "千山区",
        "pid" => 210300,
        "code" => 210311,
        "mark" => "辽宁省鞍山市千山区"
    ],
    [
        "name" => "台安县",
        "pid" => 210300,
        "code" => 210321,
        "mark" => "辽宁省鞍山市台安县"
    ],
    [
        "name" => "岫岩满族自治县",
        "pid" => 210300,
        "code" => 210323,
        "mark" => "辽宁省鞍山市岫岩满族自治县"
    ],
    [
        "name" => "海城市",
        "pid" => 210300,
        "code" => 210381,
        "mark" => "辽宁省鞍山市海城市"
    ],
    [
        "name" => "抚顺市",
        "pid" => 210000,
        "code" => 210400,
        "mark" => "辽宁省抚顺市"
    ],
    [
        "name" => "新抚区",
        "pid" => 210400,
        "code" => 210402,
        "mark" => "辽宁省抚顺市新抚区"
    ],
    [
        "name" => "东洲区",
        "pid" => 210400,
        "code" => 210403,
        "mark" => "辽宁省抚顺市东洲区"
    ],
    [
        "name" => "望花区",
        "pid" => 210400,
        "code" => 210404,
        "mark" => "辽宁省抚顺市望花区"
    ],
    [
        "name" => "顺城区",
        "pid" => 210400,
        "code" => 210411,
        "mark" => "辽宁省抚顺市顺城区"
    ],
    [
        "name" => "抚顺县",
        "pid" => 210400,
        "code" => 210421,
        "mark" => "辽宁省抚顺市抚顺县"
    ],
    [
        "name" => "新宾满族自治县",
        "pid" => 210400,
        "code" => 210422,
        "mark" => "辽宁省抚顺市新宾满族自治县"
    ],
    [
        "name" => "清原满族自治县",
        "pid" => 210400,
        "code" => 210423,
        "mark" => "辽宁省抚顺市清原满族自治县"
    ],
    [
        "name" => "本溪市",
        "pid" => 210000,
        "code" => 210500,
        "mark" => "辽宁省本溪市"
    ],
    [
        "name" => "平山区",
        "pid" => 210500,
        "code" => 210502,
        "mark" => "辽宁省本溪市平山区"
    ],
    [
        "name" => "溪湖区",
        "pid" => 210500,
        "code" => 210503,
        "mark" => "辽宁省本溪市溪湖区"
    ],
    [
        "name" => "明山区",
        "pid" => 210500,
        "code" => 210504,
        "mark" => "辽宁省本溪市明山区"
    ],
    [
        "name" => "南芬区",
        "pid" => 210500,
        "code" => 210505,
        "mark" => "辽宁省本溪市南芬区"
    ],
    [
        "name" => "本溪满族自治县",
        "pid" => 210500,
        "code" => 210521,
        "mark" => "辽宁省本溪市本溪满族自治县"
    ],
    [
        "name" => "桓仁满族自治县",
        "pid" => 210500,
        "code" => 210522,
        "mark" => "辽宁省本溪市桓仁满族自治县"
    ],
    [
        "name" => "丹东市",
        "pid" => 210000,
        "code" => 210600,
        "mark" => "辽宁省丹东市"
    ],
    [
        "name" => "元宝区",
        "pid" => 210600,
        "code" => 210602,
        "mark" => "辽宁省丹东市元宝区"
    ],
    [
        "name" => "振兴区",
        "pid" => 210600,
        "code" => 210603,
        "mark" => "辽宁省丹东市振兴区"
    ],
    [
        "name" => "振安区",
        "pid" => 210600,
        "code" => 210604,
        "mark" => "辽宁省丹东市振安区"
    ],
    [
        "name" => "宽甸满族自治县",
        "pid" => 210600,
        "code" => 210624,
        "mark" => "辽宁省丹东市宽甸满族自治县"
    ],
    [
        "name" => "东港市",
        "pid" => 210600,
        "code" => 210681,
        "mark" => "辽宁省丹东市东港市"
    ],
    [
        "name" => "凤城市",
        "pid" => 210600,
        "code" => 210682,
        "mark" => "辽宁省丹东市凤城市"
    ],
    [
        "name" => "锦州市",
        "pid" => 210000,
        "code" => 210700,
        "mark" => "辽宁省锦州市"
    ],
    [
        "name" => "古塔区",
        "pid" => 210700,
        "code" => 210702,
        "mark" => "辽宁省锦州市古塔区"
    ],
    [
        "name" => "凌河区",
        "pid" => 210700,
        "code" => 210703,
        "mark" => "辽宁省锦州市凌河区"
    ],
    [
        "name" => "太和区",
        "pid" => 210700,
        "code" => 210711,
        "mark" => "辽宁省锦州市太和区"
    ],
    [
        "name" => "黑山县",
        "pid" => 210700,
        "code" => 210726,
        "mark" => "辽宁省锦州市黑山县"
    ],
    [
        "name" => "义县",
        "pid" => 210700,
        "code" => 210727,
        "mark" => "辽宁省锦州市义县"
    ],
    [
        "name" => "凌海市",
        "pid" => 210700,
        "code" => 210781,
        "mark" => "辽宁省锦州市凌海市"
    ],
    [
        "name" => "北镇市",
        "pid" => 210700,
        "code" => 210782,
        "mark" => "辽宁省锦州市北镇市"
    ],
    [
        "name" => "营口市",
        "pid" => 210000,
        "code" => 210800,
        "mark" => "辽宁省营口市"
    ],
    [
        "name" => "站前区",
        "pid" => 210800,
        "code" => 210802,
        "mark" => "辽宁省营口市站前区"
    ],
    [
        "name" => "西市区",
        "pid" => 210800,
        "code" => 210803,
        "mark" => "辽宁省营口市西市区"
    ],
    [
        "name" => "鲅鱼圈区",
        "pid" => 210800,
        "code" => 210804,
        "mark" => "辽宁省营口市鲅鱼圈区"
    ],
    [
        "name" => "老边区",
        "pid" => 210800,
        "code" => 210811,
        "mark" => "辽宁省营口市老边区"
    ],
    [
        "name" => "盖州市",
        "pid" => 210800,
        "code" => 210881,
        "mark" => "辽宁省营口市盖州市"
    ],
    [
        "name" => "大石桥市",
        "pid" => 210800,
        "code" => 210882,
        "mark" => "辽宁省营口市大石桥市"
    ],
    [
        "name" => "阜新市",
        "pid" => 210000,
        "code" => 210900,
        "mark" => "辽宁省阜新市"
    ],
    [
        "name" => "海州区",
        "pid" => 210900,
        "code" => 210902,
        "mark" => "辽宁省阜新市海州区"
    ],
    [
        "name" => "新邱区",
        "pid" => 210900,
        "code" => 210903,
        "mark" => "辽宁省阜新市新邱区"
    ],
    [
        "name" => "太平区",
        "pid" => 210900,
        "code" => 210904,
        "mark" => "辽宁省阜新市太平区"
    ],
    [
        "name" => "清河门区",
        "pid" => 210900,
        "code" => 210905,
        "mark" => "辽宁省阜新市清河门区"
    ],
    [
        "name" => "细河区",
        "pid" => 210900,
        "code" => 210911,
        "mark" => "辽宁省阜新市细河区"
    ],
    [
        "name" => "阜新蒙古族自治县",
        "pid" => 210900,
        "code" => 210921,
        "mark" => "辽宁省阜新市阜新蒙古族自治县"
    ],
    [
        "name" => "彰武县",
        "pid" => 210900,
        "code" => 210922,
        "mark" => "辽宁省阜新市彰武县"
    ],
    [
        "name" => "辽阳市",
        "pid" => 210000,
        "code" => 211000,
        "mark" => "辽宁省辽阳市"
    ],
    [
        "name" => "白塔区",
        "pid" => 211000,
        "code" => 211002,
        "mark" => "辽宁省辽阳市白塔区"
    ],
    [
        "name" => "文圣区",
        "pid" => 211000,
        "code" => 211003,
        "mark" => "辽宁省辽阳市文圣区"
    ],
    [
        "name" => "宏伟区",
        "pid" => 211000,
        "code" => 211004,
        "mark" => "辽宁省辽阳市宏伟区"
    ],
    [
        "name" => "弓长岭区",
        "pid" => 211000,
        "code" => 211005,
        "mark" => "辽宁省辽阳市弓长岭区"
    ],
    [
        "name" => "太子河区",
        "pid" => 211000,
        "code" => 211011,
        "mark" => "辽宁省辽阳市太子河区"
    ],
    [
        "name" => "辽阳县",
        "pid" => 211000,
        "code" => 211021,
        "mark" => "辽宁省辽阳市辽阳县"
    ],
    [
        "name" => "灯塔市",
        "pid" => 211000,
        "code" => 211081,
        "mark" => "辽宁省辽阳市灯塔市"
    ],
    [
        "name" => "盘锦市",
        "pid" => 210000,
        "code" => 211100,
        "mark" => "辽宁省盘锦市"
    ],
    [
        "name" => "双台子区",
        "pid" => 211100,
        "code" => 211102,
        "mark" => "辽宁省盘锦市双台子区"
    ],
    [
        "name" => "兴隆台区",
        "pid" => 211100,
        "code" => 211103,
        "mark" => "辽宁省盘锦市兴隆台区"
    ],
    [
        "name" => "大洼区",
        "pid" => 211100,
        "code" => 211104,
        "mark" => "辽宁省盘锦市大洼区"
    ],
    [
        "name" => "盘山县",
        "pid" => 211100,
        "code" => 211122,
        "mark" => "辽宁省盘锦市盘山县"
    ],
    [
        "name" => "铁岭市",
        "pid" => 210000,
        "code" => 211200,
        "mark" => "辽宁省铁岭市"
    ],
    [
        "name" => "银州区",
        "pid" => 211200,
        "code" => 211202,
        "mark" => "辽宁省铁岭市银州区"
    ],
    [
        "name" => "清河区",
        "pid" => 211200,
        "code" => 211204,
        "mark" => "辽宁省铁岭市清河区"
    ],
    [
        "name" => "铁岭县",
        "pid" => 211200,
        "code" => 211221,
        "mark" => "辽宁省铁岭市铁岭县"
    ],
    [
        "name" => "西丰县",
        "pid" => 211200,
        "code" => 211223,
        "mark" => "辽宁省铁岭市西丰县"
    ],
    [
        "name" => "昌图县",
        "pid" => 211200,
        "code" => 211224,
        "mark" => "辽宁省铁岭市昌图县"
    ],
    [
        "name" => "调兵山市",
        "pid" => 211200,
        "code" => 211281,
        "mark" => "辽宁省铁岭市调兵山市"
    ],
    [
        "name" => "开原市",
        "pid" => 211200,
        "code" => 211282,
        "mark" => "辽宁省铁岭市开原市"
    ],
    [
        "name" => "朝阳市",
        "pid" => 210000,
        "code" => 211300,
        "mark" => "辽宁省朝阳市"
    ],
    [
        "name" => "双塔区",
        "pid" => 211300,
        "code" => 211302,
        "mark" => "辽宁省朝阳市双塔区"
    ],
    [
        "name" => "龙城区",
        "pid" => 211300,
        "code" => 211303,
        "mark" => "辽宁省朝阳市龙城区"
    ],
    [
        "name" => "朝阳县",
        "pid" => 211300,
        "code" => 211321,
        "mark" => "辽宁省朝阳市朝阳县"
    ],
    [
        "name" => "建平县",
        "pid" => 211300,
        "code" => 211322,
        "mark" => "辽宁省朝阳市建平县"
    ],
    [
        "name" => "喀喇沁左翼蒙古族自治县",
        "pid" => 211300,
        "code" => 211324,
        "mark" => "辽宁省朝阳市喀喇沁左翼蒙古族自治县"
    ],
    [
        "name" => "北票市",
        "pid" => 211300,
        "code" => 211381,
        "mark" => "辽宁省朝阳市北票市"
    ],
    [
        "name" => "凌源市",
        "pid" => 211300,
        "code" => 211382,
        "mark" => "辽宁省朝阳市凌源市"
    ],
    [
        "name" => "葫芦岛市",
        "pid" => 210000,
        "code" => 211400,
        "mark" => "辽宁省葫芦岛市"
    ],
    [
        "name" => "连山区",
        "pid" => 211400,
        "code" => 211402,
        "mark" => "辽宁省葫芦岛市连山区"
    ],
    [
        "name" => "龙港区",
        "pid" => 211400,
        "code" => 211403,
        "mark" => "辽宁省葫芦岛市龙港区"
    ],
    [
        "name" => "南票区",
        "pid" => 211400,
        "code" => 211404,
        "mark" => "辽宁省葫芦岛市南票区"
    ],
    [
        "name" => "绥中县",
        "pid" => 211400,
        "code" => 211421,
        "mark" => "辽宁省葫芦岛市绥中县"
    ],
    [
        "name" => "建昌县",
        "pid" => 211400,
        "code" => 211422,
        "mark" => "辽宁省葫芦岛市建昌县"
    ],
    [
        "name" => "兴城市",
        "pid" => 211400,
        "code" => 211481,
        "mark" => "辽宁省葫芦岛市兴城市"
    ],
    [
        "name" => "吉林省",
        "pid" => 86,
        "code" => 220000,
        "mark" => "吉林省"
    ],
    [
        "name" => "长春市",
        "pid" => 220000,
        "code" => 220100,
        "mark" => "吉林省长春市"
    ],
    [
        "name" => "南关区",
        "pid" => 220100,
        "code" => 220102,
        "mark" => "吉林省长春市南关区"
    ],
    [
        "name" => "宽城区",
        "pid" => 220100,
        "code" => 220103,
        "mark" => "吉林省长春市宽城区"
    ],
    [
        "name" => "朝阳区",
        "pid" => 220100,
        "code" => 220104,
        "mark" => "吉林省长春市朝阳区"
    ],
    [
        "name" => "二道区",
        "pid" => 220100,
        "code" => 220105,
        "mark" => "吉林省长春市二道区"
    ],
    [
        "name" => "绿园区",
        "pid" => 220100,
        "code" => 220106,
        "mark" => "吉林省长春市绿园区"
    ],
    [
        "name" => "双阳区",
        "pid" => 220100,
        "code" => 220112,
        "mark" => "吉林省长春市双阳区"
    ],
    [
        "name" => "九台区",
        "pid" => 220100,
        "code" => 220113,
        "mark" => "吉林省长春市九台区"
    ],
    [
        "name" => "农安县",
        "pid" => 220100,
        "code" => 220122,
        "mark" => "吉林省长春市农安县"
    ],
    [
        "name" => "榆树市",
        "pid" => 220100,
        "code" => 220182,
        "mark" => "吉林省长春市榆树市"
    ],
    [
        "name" => "德惠市",
        "pid" => 220100,
        "code" => 220183,
        "mark" => "吉林省长春市德惠市"
    ],
    [
        "name" => "吉林市",
        "pid" => 220000,
        "code" => 220200,
        "mark" => "吉林省吉林市"
    ],
    [
        "name" => "昌邑区",
        "pid" => 220200,
        "code" => 220202,
        "mark" => "吉林省吉林市昌邑区"
    ],
    [
        "name" => "龙潭区",
        "pid" => 220200,
        "code" => 220203,
        "mark" => "吉林省吉林市龙潭区"
    ],
    [
        "name" => "船营区",
        "pid" => 220200,
        "code" => 220204,
        "mark" => "吉林省吉林市船营区"
    ],
    [
        "name" => "丰满区",
        "pid" => 220200,
        "code" => 220211,
        "mark" => "吉林省吉林市丰满区"
    ],
    [
        "name" => "永吉县",
        "pid" => 220200,
        "code" => 220221,
        "mark" => "吉林省吉林市永吉县"
    ],
    [
        "name" => "蛟河市",
        "pid" => 220200,
        "code" => 220281,
        "mark" => "吉林省吉林市蛟河市"
    ],
    [
        "name" => "桦甸市",
        "pid" => 220200,
        "code" => 220282,
        "mark" => "吉林省吉林市桦甸市"
    ],
    [
        "name" => "舒兰市",
        "pid" => 220200,
        "code" => 220283,
        "mark" => "吉林省吉林市舒兰市"
    ],
    [
        "name" => "磐石市",
        "pid" => 220200,
        "code" => 220284,
        "mark" => "吉林省吉林市磐石市"
    ],
    [
        "name" => "四平市",
        "pid" => 220000,
        "code" => 220300,
        "mark" => "吉林省四平市"
    ],
    [
        "name" => "铁西区",
        "pid" => 220300,
        "code" => 220302,
        "mark" => "吉林省四平市铁西区"
    ],
    [
        "name" => "铁东区",
        "pid" => 220300,
        "code" => 220303,
        "mark" => "吉林省四平市铁东区"
    ],
    [
        "name" => "梨树县",
        "pid" => 220300,
        "code" => 220322,
        "mark" => "吉林省四平市梨树县"
    ],
    [
        "name" => "伊通满族自治县",
        "pid" => 220300,
        "code" => 220323,
        "mark" => "吉林省四平市伊通满族自治县"
    ],
    [
        "name" => "公主岭市",
        "pid" => 220300,
        "code" => 220381,
        "mark" => "吉林省四平市公主岭市"
    ],
    [
        "name" => "双辽市",
        "pid" => 220300,
        "code" => 220382,
        "mark" => "吉林省四平市双辽市"
    ],
    [
        "name" => "辽源市",
        "pid" => 220000,
        "code" => 220400,
        "mark" => "吉林省辽源市"
    ],
    [
        "name" => "龙山区",
        "pid" => 220400,
        "code" => 220402,
        "mark" => "吉林省辽源市龙山区"
    ],
    [
        "name" => "西安区",
        "pid" => 220400,
        "code" => 220403,
        "mark" => "吉林省辽源市西安区"
    ],
    [
        "name" => "东丰县",
        "pid" => 220400,
        "code" => 220421,
        "mark" => "吉林省辽源市东丰县"
    ],
    [
        "name" => "东辽县",
        "pid" => 220400,
        "code" => 220422,
        "mark" => "吉林省辽源市东辽县"
    ],
    [
        "name" => "通化市",
        "pid" => 220000,
        "code" => 220500,
        "mark" => "吉林省通化市"
    ],
    [
        "name" => "东昌区",
        "pid" => 220500,
        "code" => 220502,
        "mark" => "吉林省通化市东昌区"
    ],
    [
        "name" => "二道江区",
        "pid" => 220500,
        "code" => 220503,
        "mark" => "吉林省通化市二道江区"
    ],
    [
        "name" => "通化县",
        "pid" => 220500,
        "code" => 220521,
        "mark" => "吉林省通化市通化县"
    ],
    [
        "name" => "辉南县",
        "pid" => 220500,
        "code" => 220523,
        "mark" => "吉林省通化市辉南县"
    ],
    [
        "name" => "柳河县",
        "pid" => 220500,
        "code" => 220524,
        "mark" => "吉林省通化市柳河县"
    ],
    [
        "name" => "梅河口市",
        "pid" => 220500,
        "code" => 220581,
        "mark" => "吉林省通化市梅河口市"
    ],
    [
        "name" => "集安市",
        "pid" => 220500,
        "code" => 220582,
        "mark" => "吉林省通化市集安市"
    ],
    [
        "name" => "白山市",
        "pid" => 220000,
        "code" => 220600,
        "mark" => "吉林省白山市"
    ],
    [
        "name" => "浑江区",
        "pid" => 220600,
        "code" => 220602,
        "mark" => "吉林省白山市浑江区"
    ],
    [
        "name" => "江源区",
        "pid" => 220600,
        "code" => 220605,
        "mark" => "吉林省白山市江源区"
    ],
    [
        "name" => "抚松县",
        "pid" => 220600,
        "code" => 220621,
        "mark" => "吉林省白山市抚松县"
    ],
    [
        "name" => "靖宇县",
        "pid" => 220600,
        "code" => 220622,
        "mark" => "吉林省白山市靖宇县"
    ],
    [
        "name" => "长白朝鲜族自治县",
        "pid" => 220600,
        "code" => 220623,
        "mark" => "吉林省白山市长白朝鲜族自治县"
    ],
    [
        "name" => "临江市",
        "pid" => 220600,
        "code" => 220681,
        "mark" => "吉林省白山市临江市"
    ],
    [
        "name" => "松原市",
        "pid" => 220000,
        "code" => 220700,
        "mark" => "吉林省松原市"
    ],
    [
        "name" => "宁江区",
        "pid" => 220700,
        "code" => 220702,
        "mark" => "吉林省松原市宁江区"
    ],
    [
        "name" => "前郭尔罗斯蒙古族自治县",
        "pid" => 220700,
        "code" => 220721,
        "mark" => "吉林省松原市前郭尔罗斯蒙古族自治县"
    ],
    [
        "name" => "长岭县",
        "pid" => 220700,
        "code" => 220722,
        "mark" => "吉林省松原市长岭县"
    ],
    [
        "name" => "乾安县",
        "pid" => 220700,
        "code" => 220723,
        "mark" => "吉林省松原市乾安县"
    ],
    [
        "name" => "扶余市",
        "pid" => 220700,
        "code" => 220781,
        "mark" => "吉林省松原市扶余市"
    ],
    [
        "name" => "白城市",
        "pid" => 220000,
        "code" => 220800,
        "mark" => "吉林省白城市"
    ],
    [
        "name" => "洮北区",
        "pid" => 220800,
        "code" => 220802,
        "mark" => "吉林省白城市洮北区"
    ],
    [
        "name" => "镇赉县",
        "pid" => 220800,
        "code" => 220821,
        "mark" => "吉林省白城市镇赉县"
    ],
    [
        "name" => "通榆县",
        "pid" => 220800,
        "code" => 220822,
        "mark" => "吉林省白城市通榆县"
    ],
    [
        "name" => "洮南市",
        "pid" => 220800,
        "code" => 220881,
        "mark" => "吉林省白城市洮南市"
    ],
    [
        "name" => "大安市",
        "pid" => 220800,
        "code" => 220882,
        "mark" => "吉林省白城市大安市"
    ],
    [
        "name" => "延边朝鲜族自治州",
        "pid" => 220000,
        "code" => 222400,
        "mark" => "吉林省延边朝鲜族自治州"
    ],
    [
        "name" => "延吉市",
        "pid" => 222400,
        "code" => 222401,
        "mark" => "吉林省延边朝鲜族自治州延吉市"
    ],
    [
        "name" => "图们市",
        "pid" => 222400,
        "code" => 222402,
        "mark" => "吉林省延边朝鲜族自治州图们市"
    ],
    [
        "name" => "敦化市",
        "pid" => 222400,
        "code" => 222403,
        "mark" => "吉林省延边朝鲜族自治州敦化市"
    ],
    [
        "name" => "珲春市",
        "pid" => 222400,
        "code" => 222404,
        "mark" => "吉林省延边朝鲜族自治州珲春市"
    ],
    [
        "name" => "龙井市",
        "pid" => 222400,
        "code" => 222405,
        "mark" => "吉林省延边朝鲜族自治州龙井市"
    ],
    [
        "name" => "和龙市",
        "pid" => 222400,
        "code" => 222406,
        "mark" => "吉林省延边朝鲜族自治州和龙市"
    ],
    [
        "name" => "汪清县",
        "pid" => 222400,
        "code" => 222424,
        "mark" => "吉林省延边朝鲜族自治州汪清县"
    ],
    [
        "name" => "安图县",
        "pid" => 222400,
        "code" => 222426,
        "mark" => "吉林省延边朝鲜族自治州安图县"
    ],
    [
        "name" => "黑龙江省",
        "pid" => 86,
        "code" => 230000,
        "mark" => "黑龙江省"
    ],
    [
        "name" => "哈尔滨市",
        "pid" => 230000,
        "code" => 230100,
        "mark" => "黑龙江省哈尔滨市"
    ],
    [
        "name" => "道里区",
        "pid" => 230100,
        "code" => 230102,
        "mark" => "黑龙江省哈尔滨市道里区"
    ],
    [
        "name" => "南岗区",
        "pid" => 230100,
        "code" => 230103,
        "mark" => "黑龙江省哈尔滨市南岗区"
    ],
    [
        "name" => "道外区",
        "pid" => 230100,
        "code" => 230104,
        "mark" => "黑龙江省哈尔滨市道外区"
    ],
    [
        "name" => "平房区",
        "pid" => 230100,
        "code" => 230108,
        "mark" => "黑龙江省哈尔滨市平房区"
    ],
    [
        "name" => "松北区",
        "pid" => 230100,
        "code" => 230109,
        "mark" => "黑龙江省哈尔滨市松北区"
    ],
    [
        "name" => "香坊区",
        "pid" => 230100,
        "code" => 230110,
        "mark" => "黑龙江省哈尔滨市香坊区"
    ],
    [
        "name" => "呼兰区",
        "pid" => 230100,
        "code" => 230111,
        "mark" => "黑龙江省哈尔滨市呼兰区"
    ],
    [
        "name" => "阿城区",
        "pid" => 230100,
        "code" => 230112,
        "mark" => "黑龙江省哈尔滨市阿城区"
    ],
    [
        "name" => "双城区",
        "pid" => 230100,
        "code" => 230113,
        "mark" => "黑龙江省哈尔滨市双城区"
    ],
    [
        "name" => "依兰县",
        "pid" => 230100,
        "code" => 230123,
        "mark" => "黑龙江省哈尔滨市依兰县"
    ],
    [
        "name" => "方正县",
        "pid" => 230100,
        "code" => 230124,
        "mark" => "黑龙江省哈尔滨市方正县"
    ],
    [
        "name" => "宾县",
        "pid" => 230100,
        "code" => 230125,
        "mark" => "黑龙江省哈尔滨市宾县"
    ],
    [
        "name" => "巴彦县",
        "pid" => 230100,
        "code" => 230126,
        "mark" => "黑龙江省哈尔滨市巴彦县"
    ],
    [
        "name" => "木兰县",
        "pid" => 230100,
        "code" => 230127,
        "mark" => "黑龙江省哈尔滨市木兰县"
    ],
    [
        "name" => "通河县",
        "pid" => 230100,
        "code" => 230128,
        "mark" => "黑龙江省哈尔滨市通河县"
    ],
    [
        "name" => "延寿县",
        "pid" => 230100,
        "code" => 230129,
        "mark" => "黑龙江省哈尔滨市延寿县"
    ],
    [
        "name" => "尚志市",
        "pid" => 230100,
        "code" => 230183,
        "mark" => "黑龙江省哈尔滨市尚志市"
    ],
    [
        "name" => "五常市",
        "pid" => 230100,
        "code" => 230184,
        "mark" => "黑龙江省哈尔滨市五常市"
    ],
    [
        "name" => "齐齐哈尔市",
        "pid" => 230000,
        "code" => 230200,
        "mark" => "黑龙江省齐齐哈尔市"
    ],
    [
        "name" => "龙沙区",
        "pid" => 230200,
        "code" => 230202,
        "mark" => "黑龙江省齐齐哈尔市龙沙区"
    ],
    [
        "name" => "建华区",
        "pid" => 230200,
        "code" => 230203,
        "mark" => "黑龙江省齐齐哈尔市建华区"
    ],
    [
        "name" => "铁锋区",
        "pid" => 230200,
        "code" => 230204,
        "mark" => "黑龙江省齐齐哈尔市铁锋区"
    ],
    [
        "name" => "昂昂溪区",
        "pid" => 230200,
        "code" => 230205,
        "mark" => "黑龙江省齐齐哈尔市昂昂溪区"
    ],
    [
        "name" => "富拉尔基区",
        "pid" => 230200,
        "code" => 230206,
        "mark" => "黑龙江省齐齐哈尔市富拉尔基区"
    ],
    [
        "name" => "碾子山区",
        "pid" => 230200,
        "code" => 230207,
        "mark" => "黑龙江省齐齐哈尔市碾子山区"
    ],
    [
        "name" => "梅里斯达斡尔族区",
        "pid" => 230200,
        "code" => 230208,
        "mark" => "黑龙江省齐齐哈尔市梅里斯达斡尔族区"
    ],
    [
        "name" => "龙江县",
        "pid" => 230200,
        "code" => 230221,
        "mark" => "黑龙江省齐齐哈尔市龙江县"
    ],
    [
        "name" => "依安县",
        "pid" => 230200,
        "code" => 230223,
        "mark" => "黑龙江省齐齐哈尔市依安县"
    ],
    [
        "name" => "泰来县",
        "pid" => 230200,
        "code" => 230224,
        "mark" => "黑龙江省齐齐哈尔市泰来县"
    ],
    [
        "name" => "甘南县",
        "pid" => 230200,
        "code" => 230225,
        "mark" => "黑龙江省齐齐哈尔市甘南县"
    ],
    [
        "name" => "富裕县",
        "pid" => 230200,
        "code" => 230227,
        "mark" => "黑龙江省齐齐哈尔市富裕县"
    ],
    [
        "name" => "克山县",
        "pid" => 230200,
        "code" => 230229,
        "mark" => "黑龙江省齐齐哈尔市克山县"
    ],
    [
        "name" => "克东县",
        "pid" => 230200,
        "code" => 230230,
        "mark" => "黑龙江省齐齐哈尔市克东县"
    ],
    [
        "name" => "拜泉县",
        "pid" => 230200,
        "code" => 230231,
        "mark" => "黑龙江省齐齐哈尔市拜泉县"
    ],
    [
        "name" => "讷河市",
        "pid" => 230200,
        "code" => 230281,
        "mark" => "黑龙江省齐齐哈尔市讷河市"
    ],
    [
        "name" => "鸡西市",
        "pid" => 230000,
        "code" => 230300,
        "mark" => "黑龙江省鸡西市"
    ],
    [
        "name" => "鸡冠区",
        "pid" => 230300,
        "code" => 230302,
        "mark" => "黑龙江省鸡西市鸡冠区"
    ],
    [
        "name" => "恒山区",
        "pid" => 230300,
        "code" => 230303,
        "mark" => "黑龙江省鸡西市恒山区"
    ],
    [
        "name" => "滴道区",
        "pid" => 230300,
        "code" => 230304,
        "mark" => "黑龙江省鸡西市滴道区"
    ],
    [
        "name" => "梨树区",
        "pid" => 230300,
        "code" => 230305,
        "mark" => "黑龙江省鸡西市梨树区"
    ],
    [
        "name" => "城子河区",
        "pid" => 230300,
        "code" => 230306,
        "mark" => "黑龙江省鸡西市城子河区"
    ],
    [
        "name" => "麻山区",
        "pid" => 230300,
        "code" => 230307,
        "mark" => "黑龙江省鸡西市麻山区"
    ],
    [
        "name" => "鸡东县",
        "pid" => 230300,
        "code" => 230321,
        "mark" => "黑龙江省鸡西市鸡东县"
    ],
    [
        "name" => "虎林市",
        "pid" => 230300,
        "code" => 230381,
        "mark" => "黑龙江省鸡西市虎林市"
    ],
    [
        "name" => "密山市",
        "pid" => 230300,
        "code" => 230382,
        "mark" => "黑龙江省鸡西市密山市"
    ],
    [
        "name" => "鹤岗市",
        "pid" => 230000,
        "code" => 230400,
        "mark" => "黑龙江省鹤岗市"
    ],
    [
        "name" => "向阳区",
        "pid" => 230400,
        "code" => 230402,
        "mark" => "黑龙江省鹤岗市向阳区"
    ],
    [
        "name" => "工农区",
        "pid" => 230400,
        "code" => 230403,
        "mark" => "黑龙江省鹤岗市工农区"
    ],
    [
        "name" => "南山区",
        "pid" => 230400,
        "code" => 230404,
        "mark" => "黑龙江省鹤岗市南山区"
    ],
    [
        "name" => "兴安区",
        "pid" => 230400,
        "code" => 230405,
        "mark" => "黑龙江省鹤岗市兴安区"
    ],
    [
        "name" => "东山区",
        "pid" => 230400,
        "code" => 230406,
        "mark" => "黑龙江省鹤岗市东山区"
    ],
    [
        "name" => "兴山区",
        "pid" => 230400,
        "code" => 230407,
        "mark" => "黑龙江省鹤岗市兴山区"
    ],
    [
        "name" => "萝北县",
        "pid" => 230400,
        "code" => 230421,
        "mark" => "黑龙江省鹤岗市萝北县"
    ],
    [
        "name" => "绥滨县",
        "pid" => 230400,
        "code" => 230422,
        "mark" => "黑龙江省鹤岗市绥滨县"
    ],
    [
        "name" => "双鸭山市",
        "pid" => 230000,
        "code" => 230500,
        "mark" => "黑龙江省双鸭山市"
    ],
    [
        "name" => "尖山区",
        "pid" => 230500,
        "code" => 230502,
        "mark" => "黑龙江省双鸭山市尖山区"
    ],
    [
        "name" => "岭东区",
        "pid" => 230500,
        "code" => 230503,
        "mark" => "黑龙江省双鸭山市岭东区"
    ],
    [
        "name" => "四方台区",
        "pid" => 230500,
        "code" => 230505,
        "mark" => "黑龙江省双鸭山市四方台区"
    ],
    [
        "name" => "宝山区",
        "pid" => 230500,
        "code" => 230506,
        "mark" => "黑龙江省双鸭山市宝山区"
    ],
    [
        "name" => "集贤县",
        "pid" => 230500,
        "code" => 230521,
        "mark" => "黑龙江省双鸭山市集贤县"
    ],
    [
        "name" => "友谊县",
        "pid" => 230500,
        "code" => 230522,
        "mark" => "黑龙江省双鸭山市友谊县"
    ],
    [
        "name" => "宝清县",
        "pid" => 230500,
        "code" => 230523,
        "mark" => "黑龙江省双鸭山市宝清县"
    ],
    [
        "name" => "饶河县",
        "pid" => 230500,
        "code" => 230524,
        "mark" => "黑龙江省双鸭山市饶河县"
    ],
    [
        "name" => "大庆市",
        "pid" => 230000,
        "code" => 230600,
        "mark" => "黑龙江省大庆市"
    ],
    [
        "name" => "萨尔图区",
        "pid" => 230600,
        "code" => 230602,
        "mark" => "黑龙江省大庆市萨尔图区"
    ],
    [
        "name" => "龙凤区",
        "pid" => 230600,
        "code" => 230603,
        "mark" => "黑龙江省大庆市龙凤区"
    ],
    [
        "name" => "让胡路区",
        "pid" => 230600,
        "code" => 230604,
        "mark" => "黑龙江省大庆市让胡路区"
    ],
    [
        "name" => "红岗区",
        "pid" => 230600,
        "code" => 230605,
        "mark" => "黑龙江省大庆市红岗区"
    ],
    [
        "name" => "大同区",
        "pid" => 230600,
        "code" => 230606,
        "mark" => "黑龙江省大庆市大同区"
    ],
    [
        "name" => "肇州县",
        "pid" => 230600,
        "code" => 230621,
        "mark" => "黑龙江省大庆市肇州县"
    ],
    [
        "name" => "肇源县",
        "pid" => 230600,
        "code" => 230622,
        "mark" => "黑龙江省大庆市肇源县"
    ],
    [
        "name" => "林甸县",
        "pid" => 230600,
        "code" => 230623,
        "mark" => "黑龙江省大庆市林甸县"
    ],
    [
        "name" => "杜尔伯特蒙古族自治县",
        "pid" => 230600,
        "code" => 230624,
        "mark" => "黑龙江省大庆市杜尔伯特蒙古族自治县"
    ],
    [
        "name" => "伊春市",
        "pid" => 230000,
        "code" => 230700,
        "mark" => "黑龙江省伊春市"
    ],
    [
        "name" => "伊春区",
        "pid" => 230700,
        "code" => 230702,
        "mark" => "黑龙江省伊春市伊春区"
    ],
    [
        "name" => "南岔区",
        "pid" => 230700,
        "code" => 230703,
        "mark" => "黑龙江省伊春市南岔区"
    ],
    [
        "name" => "友好区",
        "pid" => 230700,
        "code" => 230704,
        "mark" => "黑龙江省伊春市友好区"
    ],
    [
        "name" => "西林区",
        "pid" => 230700,
        "code" => 230705,
        "mark" => "黑龙江省伊春市西林区"
    ],
    [
        "name" => "翠峦区",
        "pid" => 230700,
        "code" => 230706,
        "mark" => "黑龙江省伊春市翠峦区"
    ],
    [
        "name" => "新青区",
        "pid" => 230700,
        "code" => 230707,
        "mark" => "黑龙江省伊春市新青区"
    ],
    [
        "name" => "美溪区",
        "pid" => 230700,
        "code" => 230708,
        "mark" => "黑龙江省伊春市美溪区"
    ],
    [
        "name" => "金山屯区",
        "pid" => 230700,
        "code" => 230709,
        "mark" => "黑龙江省伊春市金山屯区"
    ],
    [
        "name" => "五营区",
        "pid" => 230700,
        "code" => 230710,
        "mark" => "黑龙江省伊春市五营区"
    ],
    [
        "name" => "乌马河区",
        "pid" => 230700,
        "code" => 230711,
        "mark" => "黑龙江省伊春市乌马河区"
    ],
    [
        "name" => "汤旺河区",
        "pid" => 230700,
        "code" => 230712,
        "mark" => "黑龙江省伊春市汤旺河区"
    ],
    [
        "name" => "带岭区",
        "pid" => 230700,
        "code" => 230713,
        "mark" => "黑龙江省伊春市带岭区"
    ],
    [
        "name" => "乌伊岭区",
        "pid" => 230700,
        "code" => 230714,
        "mark" => "黑龙江省伊春市乌伊岭区"
    ],
    [
        "name" => "红星区",
        "pid" => 230700,
        "code" => 230715,
        "mark" => "黑龙江省伊春市红星区"
    ],
    [
        "name" => "上甘岭区",
        "pid" => 230700,
        "code" => 230716,
        "mark" => "黑龙江省伊春市上甘岭区"
    ],
    [
        "name" => "嘉荫县",
        "pid" => 230700,
        "code" => 230722,
        "mark" => "黑龙江省伊春市嘉荫县"
    ],
    [
        "name" => "铁力市",
        "pid" => 230700,
        "code" => 230781,
        "mark" => "黑龙江省伊春市铁力市"
    ],
    [
        "name" => "佳木斯市",
        "pid" => 230000,
        "code" => 230800,
        "mark" => "黑龙江省佳木斯市"
    ],
    [
        "name" => "向阳区",
        "pid" => 230800,
        "code" => 230803,
        "mark" => "黑龙江省佳木斯市向阳区"
    ],
    [
        "name" => "前进区",
        "pid" => 230800,
        "code" => 230804,
        "mark" => "黑龙江省佳木斯市前进区"
    ],
    [
        "name" => "东风区",
        "pid" => 230800,
        "code" => 230805,
        "mark" => "黑龙江省佳木斯市东风区"
    ],
    [
        "name" => "郊区",
        "pid" => 230800,
        "code" => 230811,
        "mark" => "黑龙江省佳木斯市郊区"
    ],
    [
        "name" => "桦南县",
        "pid" => 230800,
        "code" => 230822,
        "mark" => "黑龙江省佳木斯市桦南县"
    ],
    [
        "name" => "桦川县",
        "pid" => 230800,
        "code" => 230826,
        "mark" => "黑龙江省佳木斯市桦川县"
    ],
    [
        "name" => "汤原县",
        "pid" => 230800,
        "code" => 230828,
        "mark" => "黑龙江省佳木斯市汤原县"
    ],
    [
        "name" => "同江市",
        "pid" => 230800,
        "code" => 230881,
        "mark" => "黑龙江省佳木斯市同江市"
    ],
    [
        "name" => "富锦市",
        "pid" => 230800,
        "code" => 230882,
        "mark" => "黑龙江省佳木斯市富锦市"
    ],
    [
        "name" => "抚远市",
        "pid" => 230800,
        "code" => 230883,
        "mark" => "黑龙江省佳木斯市抚远市"
    ],
    [
        "name" => "七台河市",
        "pid" => 230000,
        "code" => 230900,
        "mark" => "黑龙江省七台河市"
    ],
    [
        "name" => "新兴区",
        "pid" => 230900,
        "code" => 230902,
        "mark" => "黑龙江省七台河市新兴区"
    ],
    [
        "name" => "桃山区",
        "pid" => 230900,
        "code" => 230903,
        "mark" => "黑龙江省七台河市桃山区"
    ],
    [
        "name" => "茄子河区",
        "pid" => 230900,
        "code" => 230904,
        "mark" => "黑龙江省七台河市茄子河区"
    ],
    [
        "name" => "勃利县",
        "pid" => 230900,
        "code" => 230921,
        "mark" => "黑龙江省七台河市勃利县"
    ],
    [
        "name" => "牡丹江市",
        "pid" => 230000,
        "code" => 231000,
        "mark" => "黑龙江省牡丹江市"
    ],
    [
        "name" => "东安区",
        "pid" => 231000,
        "code" => 231002,
        "mark" => "黑龙江省牡丹江市东安区"
    ],
    [
        "name" => "阳明区",
        "pid" => 231000,
        "code" => 231003,
        "mark" => "黑龙江省牡丹江市阳明区"
    ],
    [
        "name" => "爱民区",
        "pid" => 231000,
        "code" => 231004,
        "mark" => "黑龙江省牡丹江市爱民区"
    ],
    [
        "name" => "西安区",
        "pid" => 231000,
        "code" => 231005,
        "mark" => "黑龙江省牡丹江市西安区"
    ],
    [
        "name" => "林口县",
        "pid" => 231000,
        "code" => 231025,
        "mark" => "黑龙江省牡丹江市林口县"
    ],
    [
        "name" => "绥芬河市",
        "pid" => 231000,
        "code" => 231081,
        "mark" => "黑龙江省牡丹江市绥芬河市"
    ],
    [
        "name" => "海林市",
        "pid" => 231000,
        "code" => 231083,
        "mark" => "黑龙江省牡丹江市海林市"
    ],
    [
        "name" => "宁安市",
        "pid" => 231000,
        "code" => 231084,
        "mark" => "黑龙江省牡丹江市宁安市"
    ],
    [
        "name" => "穆棱市",
        "pid" => 231000,
        "code" => 231085,
        "mark" => "黑龙江省牡丹江市穆棱市"
    ],
    [
        "name" => "东宁市",
        "pid" => 231000,
        "code" => 231086,
        "mark" => "黑龙江省牡丹江市东宁市"
    ],
    [
        "name" => "黑河市",
        "pid" => 230000,
        "code" => 231100,
        "mark" => "黑龙江省黑河市"
    ],
    [
        "name" => "爱辉区",
        "pid" => 231100,
        "code" => 231102,
        "mark" => "黑龙江省黑河市爱辉区"
    ],
    [
        "name" => "嫩江县",
        "pid" => 231100,
        "code" => 231121,
        "mark" => "黑龙江省黑河市嫩江县"
    ],
    [
        "name" => "逊克县",
        "pid" => 231100,
        "code" => 231123,
        "mark" => "黑龙江省黑河市逊克县"
    ],
    [
        "name" => "孙吴县",
        "pid" => 231100,
        "code" => 231124,
        "mark" => "黑龙江省黑河市孙吴县"
    ],
    [
        "name" => "北安市",
        "pid" => 231100,
        "code" => 231181,
        "mark" => "黑龙江省黑河市北安市"
    ],
    [
        "name" => "五大连池市",
        "pid" => 231100,
        "code" => 231182,
        "mark" => "黑龙江省黑河市五大连池市"
    ],
    [
        "name" => "绥化市",
        "pid" => 230000,
        "code" => 231200,
        "mark" => "黑龙江省绥化市"
    ],
    [
        "name" => "北林区",
        "pid" => 231200,
        "code" => 231202,
        "mark" => "黑龙江省绥化市北林区"
    ],
    [
        "name" => "望奎县",
        "pid" => 231200,
        "code" => 231221,
        "mark" => "黑龙江省绥化市望奎县"
    ],
    [
        "name" => "兰西县",
        "pid" => 231200,
        "code" => 231222,
        "mark" => "黑龙江省绥化市兰西县"
    ],
    [
        "name" => "青冈县",
        "pid" => 231200,
        "code" => 231223,
        "mark" => "黑龙江省绥化市青冈县"
    ],
    [
        "name" => "庆安县",
        "pid" => 231200,
        "code" => 231224,
        "mark" => "黑龙江省绥化市庆安县"
    ],
    [
        "name" => "明水县",
        "pid" => 231200,
        "code" => 231225,
        "mark" => "黑龙江省绥化市明水县"
    ],
    [
        "name" => "绥棱县",
        "pid" => 231200,
        "code" => 231226,
        "mark" => "黑龙江省绥化市绥棱县"
    ],
    [
        "name" => "安达市",
        "pid" => 231200,
        "code" => 231281,
        "mark" => "黑龙江省绥化市安达市"
    ],
    [
        "name" => "肇东市",
        "pid" => 231200,
        "code" => 231282,
        "mark" => "黑龙江省绥化市肇东市"
    ],
    [
        "name" => "海伦市",
        "pid" => 231200,
        "code" => 231283,
        "mark" => "黑龙江省绥化市海伦市"
    ],
    [
        "name" => "大兴安岭地区",
        "pid" => 230000,
        "code" => 232700,
        "mark" => "黑龙江省大兴安岭地区"
    ],
    [
        "name" => "呼玛县",
        "pid" => 232700,
        "code" => 232721,
        "mark" => "黑龙江省大兴安岭地区呼玛县"
    ],
    [
        "name" => "塔河县",
        "pid" => 232700,
        "code" => 232722,
        "mark" => "黑龙江省大兴安岭地区塔河县"
    ],
    [
        "name" => "漠河县",
        "pid" => 232700,
        "code" => 232723,
        "mark" => "黑龙江省大兴安岭地区漠河县"
    ],
    [
        "name" => "上海市",
        "pid" => 86,
        "code" => 310000,
        "mark" => "上海市"
    ],
    [
        "name" => "黄浦区",
        "pid" => 310000,
        "code" => 310101,
        "mark" => "上海市黄浦区"
    ],
    [
        "name" => "徐汇区",
        "pid" => 310000,
        "code" => 310104,
        "mark" => "上海市徐汇区"
    ],
    [
        "name" => "长宁区",
        "pid" => 310000,
        "code" => 310105,
        "mark" => "上海市长宁区"
    ],
    [
        "name" => "静安区",
        "pid" => 310000,
        "code" => 310106,
        "mark" => "上海市静安区"
    ],
    [
        "name" => "普陀区",
        "pid" => 310000,
        "code" => 310107,
        "mark" => "上海市普陀区"
    ],
    [
        "name" => "虹口区",
        "pid" => 310000,
        "code" => 310109,
        "mark" => "上海市虹口区"
    ],
    [
        "name" => "杨浦区",
        "pid" => 310000,
        "code" => 310110,
        "mark" => "上海市杨浦区"
    ],
    [
        "name" => "闵行区",
        "pid" => 310000,
        "code" => 310112,
        "mark" => "上海市闵行区"
    ],
    [
        "name" => "宝山区",
        "pid" => 310000,
        "code" => 310113,
        "mark" => "上海市宝山区"
    ],
    [
        "name" => "嘉定区",
        "pid" => 310000,
        "code" => 310114,
        "mark" => "上海市嘉定区"
    ],
    [
        "name" => "浦东新区",
        "pid" => 310000,
        "code" => 310115,
        "mark" => "上海市浦东新区"
    ],
    [
        "name" => "金山区",
        "pid" => 310000,
        "code" => 310116,
        "mark" => "上海市金山区"
    ],
    [
        "name" => "松江区",
        "pid" => 310000,
        "code" => 310117,
        "mark" => "上海市松江区"
    ],
    [
        "name" => "青浦区",
        "pid" => 310000,
        "code" => 310118,
        "mark" => "上海市青浦区"
    ],
    [
        "name" => "奉贤区",
        "pid" => 310000,
        "code" => 310120,
        "mark" => "上海市奉贤区"
    ],
    [
        "name" => "崇明区",
        "pid" => 310000,
        "code" => 310151,
        "mark" => "上海市崇明区"
    ],
    [
        "name" => "江苏省",
        "pid" => 86,
        "code" => 320000,
        "mark" => "江苏省"
    ],
    [
        "name" => "南京市",
        "pid" => 320000,
        "code" => 320100,
        "mark" => "江苏省南京市"
    ],
    [
        "name" => "玄武区",
        "pid" => 320100,
        "code" => 320102,
        "mark" => "江苏省南京市玄武区"
    ],
    [
        "name" => "秦淮区",
        "pid" => 320100,
        "code" => 320104,
        "mark" => "江苏省南京市秦淮区"
    ],
    [
        "name" => "建邺区",
        "pid" => 320100,
        "code" => 320105,
        "mark" => "江苏省南京市建邺区"
    ],
    [
        "name" => "鼓楼区",
        "pid" => 320100,
        "code" => 320106,
        "mark" => "江苏省南京市鼓楼区"
    ],
    [
        "name" => "浦口区",
        "pid" => 320100,
        "code" => 320111,
        "mark" => "江苏省南京市浦口区"
    ],
    [
        "name" => "栖霞区",
        "pid" => 320100,
        "code" => 320113,
        "mark" => "江苏省南京市栖霞区"
    ],
    [
        "name" => "雨花台区",
        "pid" => 320100,
        "code" => 320114,
        "mark" => "江苏省南京市雨花台区"
    ],
    [
        "name" => "江宁区",
        "pid" => 320100,
        "code" => 320115,
        "mark" => "江苏省南京市江宁区"
    ],
    [
        "name" => "六合区",
        "pid" => 320100,
        "code" => 320116,
        "mark" => "江苏省南京市六合区"
    ],
    [
        "name" => "溧水区",
        "pid" => 320100,
        "code" => 320117,
        "mark" => "江苏省南京市溧水区"
    ],
    [
        "name" => "高淳区",
        "pid" => 320100,
        "code" => 320118,
        "mark" => "江苏省南京市高淳区"
    ],
    [
        "name" => "无锡市",
        "pid" => 320000,
        "code" => 320200,
        "mark" => "江苏省无锡市"
    ],
    [
        "name" => "锡山区",
        "pid" => 320200,
        "code" => 320205,
        "mark" => "江苏省无锡市锡山区"
    ],
    [
        "name" => "惠山区",
        "pid" => 320200,
        "code" => 320206,
        "mark" => "江苏省无锡市惠山区"
    ],
    [
        "name" => "滨湖区",
        "pid" => 320200,
        "code" => 320211,
        "mark" => "江苏省无锡市滨湖区"
    ],
    [
        "name" => "梁溪区",
        "pid" => 320200,
        "code" => 320213,
        "mark" => "江苏省无锡市梁溪区"
    ],
    [
        "name" => "新吴区",
        "pid" => 320200,
        "code" => 320214,
        "mark" => "江苏省无锡市新吴区"
    ],
    [
        "name" => "江阴市",
        "pid" => 320200,
        "code" => 320281,
        "mark" => "江苏省无锡市江阴市"
    ],
    [
        "name" => "宜兴市",
        "pid" => 320200,
        "code" => 320282,
        "mark" => "江苏省无锡市宜兴市"
    ],
    [
        "name" => "徐州市",
        "pid" => 320000,
        "code" => 320300,
        "mark" => "江苏省徐州市"
    ],
    [
        "name" => "鼓楼区",
        "pid" => 320300,
        "code" => 320302,
        "mark" => "江苏省徐州市鼓楼区"
    ],
    [
        "name" => "云龙区",
        "pid" => 320300,
        "code" => 320303,
        "mark" => "江苏省徐州市云龙区"
    ],
    [
        "name" => "贾汪区",
        "pid" => 320300,
        "code" => 320305,
        "mark" => "江苏省徐州市贾汪区"
    ],
    [
        "name" => "泉山区",
        "pid" => 320300,
        "code" => 320311,
        "mark" => "江苏省徐州市泉山区"
    ],
    [
        "name" => "铜山区",
        "pid" => 320300,
        "code" => 320312,
        "mark" => "江苏省徐州市铜山区"
    ],
    [
        "name" => "丰县",
        "pid" => 320300,
        "code" => 320321,
        "mark" => "江苏省徐州市丰县"
    ],
    [
        "name" => "沛县",
        "pid" => 320300,
        "code" => 320322,
        "mark" => "江苏省徐州市沛县"
    ],
    [
        "name" => "睢宁县",
        "pid" => 320300,
        "code" => 320324,
        "mark" => "江苏省徐州市睢宁县"
    ],
    [
        "name" => "新沂市",
        "pid" => 320300,
        "code" => 320381,
        "mark" => "江苏省徐州市新沂市"
    ],
    [
        "name" => "邳州市",
        "pid" => 320300,
        "code" => 320382,
        "mark" => "江苏省徐州市邳州市"
    ],
    [
        "name" => "常州市",
        "pid" => 320000,
        "code" => 320400,
        "mark" => "江苏省常州市"
    ],
    [
        "name" => "天宁区",
        "pid" => 320400,
        "code" => 320402,
        "mark" => "江苏省常州市天宁区"
    ],
    [
        "name" => "钟楼区",
        "pid" => 320400,
        "code" => 320404,
        "mark" => "江苏省常州市钟楼区"
    ],
    [
        "name" => "新北区",
        "pid" => 320400,
        "code" => 320411,
        "mark" => "江苏省常州市新北区"
    ],
    [
        "name" => "武进区",
        "pid" => 320400,
        "code" => 320412,
        "mark" => "江苏省常州市武进区"
    ],
    [
        "name" => "金坛区",
        "pid" => 320400,
        "code" => 320413,
        "mark" => "江苏省常州市金坛区"
    ],
    [
        "name" => "溧阳市",
        "pid" => 320400,
        "code" => 320481,
        "mark" => "江苏省常州市溧阳市"
    ],
    [
        "name" => "苏州市",
        "pid" => 320000,
        "code" => 320500,
        "mark" => "江苏省苏州市"
    ],
    [
        "name" => "虎丘区",
        "pid" => 320500,
        "code" => 320505,
        "mark" => "江苏省苏州市虎丘区"
    ],
    [
        "name" => "吴中区",
        "pid" => 320500,
        "code" => 320506,
        "mark" => "江苏省苏州市吴中区"
    ],
    [
        "name" => "相城区",
        "pid" => 320500,
        "code" => 320507,
        "mark" => "江苏省苏州市相城区"
    ],
    [
        "name" => "姑苏区",
        "pid" => 320500,
        "code" => 320508,
        "mark" => "江苏省苏州市姑苏区"
    ],
    [
        "name" => "吴江区",
        "pid" => 320500,
        "code" => 320509,
        "mark" => "江苏省苏州市吴江区"
    ],
    [
        "name" => "常熟市",
        "pid" => 320500,
        "code" => 320581,
        "mark" => "江苏省苏州市常熟市"
    ],
    [
        "name" => "张家港市",
        "pid" => 320500,
        "code" => 320582,
        "mark" => "江苏省苏州市张家港市"
    ],
    [
        "name" => "昆山市",
        "pid" => 320500,
        "code" => 320583,
        "mark" => "江苏省苏州市昆山市"
    ],
    [
        "name" => "太仓市",
        "pid" => 320500,
        "code" => 320585,
        "mark" => "江苏省苏州市太仓市"
    ],
    [
        "name" => "南通市",
        "pid" => 320000,
        "code" => 320600,
        "mark" => "江苏省南通市"
    ],
    [
        "name" => "崇川区",
        "pid" => 320600,
        "code" => 320602,
        "mark" => "江苏省南通市崇川区"
    ],
    [
        "name" => "港闸区",
        "pid" => 320600,
        "code" => 320611,
        "mark" => "江苏省南通市港闸区"
    ],
    [
        "name" => "通州区",
        "pid" => 320600,
        "code" => 320612,
        "mark" => "江苏省南通市通州区"
    ],
    [
        "name" => "海安县",
        "pid" => 320600,
        "code" => 320621,
        "mark" => "江苏省南通市海安县"
    ],
    [
        "name" => "如东县",
        "pid" => 320600,
        "code" => 320623,
        "mark" => "江苏省南通市如东县"
    ],
    [
        "name" => "启东市",
        "pid" => 320600,
        "code" => 320681,
        "mark" => "江苏省南通市启东市"
    ],
    [
        "name" => "如皋市",
        "pid" => 320600,
        "code" => 320682,
        "mark" => "江苏省南通市如皋市"
    ],
    [
        "name" => "海门市",
        "pid" => 320600,
        "code" => 320684,
        "mark" => "江苏省南通市海门市"
    ],
    [
        "name" => "连云港市",
        "pid" => 320000,
        "code" => 320700,
        "mark" => "江苏省连云港市"
    ],
    [
        "name" => "连云区",
        "pid" => 320700,
        "code" => 320703,
        "mark" => "江苏省连云港市连云区"
    ],
    [
        "name" => "海州区",
        "pid" => 320700,
        "code" => 320706,
        "mark" => "江苏省连云港市海州区"
    ],
    [
        "name" => "赣榆区",
        "pid" => 320700,
        "code" => 320707,
        "mark" => "江苏省连云港市赣榆区"
    ],
    [
        "name" => "东海县",
        "pid" => 320700,
        "code" => 320722,
        "mark" => "江苏省连云港市东海县"
    ],
    [
        "name" => "灌云县",
        "pid" => 320700,
        "code" => 320723,
        "mark" => "江苏省连云港市灌云县"
    ],
    [
        "name" => "灌南县",
        "pid" => 320700,
        "code" => 320724,
        "mark" => "江苏省连云港市灌南县"
    ],
    [
        "name" => "淮安市",
        "pid" => 320000,
        "code" => 320800,
        "mark" => "江苏省淮安市"
    ],
    [
        "name" => "淮安区",
        "pid" => 320800,
        "code" => 320803,
        "mark" => "江苏省淮安市淮安区"
    ],
    [
        "name" => "淮阴区",
        "pid" => 320800,
        "code" => 320804,
        "mark" => "江苏省淮安市淮阴区"
    ],
    [
        "name" => "清江浦区",
        "pid" => 320800,
        "code" => 320812,
        "mark" => "江苏省淮安市清江浦区"
    ],
    [
        "name" => "洪泽区",
        "pid" => 320800,
        "code" => 320813,
        "mark" => "江苏省淮安市洪泽区"
    ],
    [
        "name" => "涟水县",
        "pid" => 320800,
        "code" => 320826,
        "mark" => "江苏省淮安市涟水县"
    ],
    [
        "name" => "盱眙县",
        "pid" => 320800,
        "code" => 320830,
        "mark" => "江苏省淮安市盱眙县"
    ],
    [
        "name" => "金湖县",
        "pid" => 320800,
        "code" => 320831,
        "mark" => "江苏省淮安市金湖县"
    ],
    [
        "name" => "盐城市",
        "pid" => 320000,
        "code" => 320900,
        "mark" => "江苏省盐城市"
    ],
    [
        "name" => "亭湖区",
        "pid" => 320900,
        "code" => 320902,
        "mark" => "江苏省盐城市亭湖区"
    ],
    [
        "name" => "盐都区",
        "pid" => 320900,
        "code" => 320903,
        "mark" => "江苏省盐城市盐都区"
    ],
    [
        "name" => "大丰区",
        "pid" => 320900,
        "code" => 320904,
        "mark" => "江苏省盐城市大丰区"
    ],
    [
        "name" => "响水县",
        "pid" => 320900,
        "code" => 320921,
        "mark" => "江苏省盐城市响水县"
    ],
    [
        "name" => "滨海县",
        "pid" => 320900,
        "code" => 320922,
        "mark" => "江苏省盐城市滨海县"
    ],
    [
        "name" => "阜宁县",
        "pid" => 320900,
        "code" => 320923,
        "mark" => "江苏省盐城市阜宁县"
    ],
    [
        "name" => "射阳县",
        "pid" => 320900,
        "code" => 320924,
        "mark" => "江苏省盐城市射阳县"
    ],
    [
        "name" => "建湖县",
        "pid" => 320900,
        "code" => 320925,
        "mark" => "江苏省盐城市建湖县"
    ],
    [
        "name" => "东台市",
        "pid" => 320900,
        "code" => 320981,
        "mark" => "江苏省盐城市东台市"
    ],
    [
        "name" => "扬州市",
        "pid" => 320000,
        "code" => 321000,
        "mark" => "江苏省扬州市"
    ],
    [
        "name" => "广陵区",
        "pid" => 321000,
        "code" => 321002,
        "mark" => "江苏省扬州市广陵区"
    ],
    [
        "name" => "邗江区",
        "pid" => 321000,
        "code" => 321003,
        "mark" => "江苏省扬州市邗江区"
    ],
    [
        "name" => "江都区",
        "pid" => 321000,
        "code" => 321012,
        "mark" => "江苏省扬州市江都区"
    ],
    [
        "name" => "宝应县",
        "pid" => 321000,
        "code" => 321023,
        "mark" => "江苏省扬州市宝应县"
    ],
    [
        "name" => "仪征市",
        "pid" => 321000,
        "code" => 321081,
        "mark" => "江苏省扬州市仪征市"
    ],
    [
        "name" => "高邮市",
        "pid" => 321000,
        "code" => 321084,
        "mark" => "江苏省扬州市高邮市"
    ],
    [
        "name" => "镇江市",
        "pid" => 320000,
        "code" => 321100,
        "mark" => "江苏省镇江市"
    ],
    [
        "name" => "京口区",
        "pid" => 321100,
        "code" => 321102,
        "mark" => "江苏省镇江市京口区"
    ],
    [
        "name" => "润州区",
        "pid" => 321100,
        "code" => 321111,
        "mark" => "江苏省镇江市润州区"
    ],
    [
        "name" => "丹徒区",
        "pid" => 321100,
        "code" => 321112,
        "mark" => "江苏省镇江市丹徒区"
    ],
    [
        "name" => "丹阳市",
        "pid" => 321100,
        "code" => 321181,
        "mark" => "江苏省镇江市丹阳市"
    ],
    [
        "name" => "扬中市",
        "pid" => 321100,
        "code" => 321182,
        "mark" => "江苏省镇江市扬中市"
    ],
    [
        "name" => "句容市",
        "pid" => 321100,
        "code" => 321183,
        "mark" => "江苏省镇江市句容市"
    ],
    [
        "name" => "泰州市",
        "pid" => 320000,
        "code" => 321200,
        "mark" => "江苏省泰州市"
    ],
    [
        "name" => "海陵区",
        "pid" => 321200,
        "code" => 321202,
        "mark" => "江苏省泰州市海陵区"
    ],
    [
        "name" => "高港区",
        "pid" => 321200,
        "code" => 321203,
        "mark" => "江苏省泰州市高港区"
    ],
    [
        "name" => "姜堰区",
        "pid" => 321200,
        "code" => 321204,
        "mark" => "江苏省泰州市姜堰区"
    ],
    [
        "name" => "兴化市",
        "pid" => 321200,
        "code" => 321281,
        "mark" => "江苏省泰州市兴化市"
    ],
    [
        "name" => "靖江市",
        "pid" => 321200,
        "code" => 321282,
        "mark" => "江苏省泰州市靖江市"
    ],
    [
        "name" => "泰兴市",
        "pid" => 321200,
        "code" => 321283,
        "mark" => "江苏省泰州市泰兴市"
    ],
    [
        "name" => "宿迁市",
        "pid" => 320000,
        "code" => 321300,
        "mark" => "江苏省宿迁市"
    ],
    [
        "name" => "宿城区",
        "pid" => 321300,
        "code" => 321302,
        "mark" => "江苏省宿迁市宿城区"
    ],
    [
        "name" => "宿豫区",
        "pid" => 321300,
        "code" => 321311,
        "mark" => "江苏省宿迁市宿豫区"
    ],
    [
        "name" => "沭阳县",
        "pid" => 321300,
        "code" => 321322,
        "mark" => "江苏省宿迁市沭阳县"
    ],
    [
        "name" => "泗阳县",
        "pid" => 321300,
        "code" => 321323,
        "mark" => "江苏省宿迁市泗阳县"
    ],
    [
        "name" => "泗洪县",
        "pid" => 321300,
        "code" => 321324,
        "mark" => "江苏省宿迁市泗洪县"
    ],
    [
        "name" => "浙江省",
        "pid" => 86,
        "code" => 330000,
        "mark" => "浙江省"
    ],
    [
        "name" => "杭州市",
        "pid" => 330000,
        "code" => 330100,
        "mark" => "浙江省杭州市"
    ],
    [
        "name" => "上城区",
        "pid" => 330100,
        "code" => 330102,
        "mark" => "浙江省杭州市上城区"
    ],
    [
        "name" => "下城区",
        "pid" => 330100,
        "code" => 330103,
        "mark" => "浙江省杭州市下城区"
    ],
    [
        "name" => "江干区",
        "pid" => 330100,
        "code" => 330104,
        "mark" => "浙江省杭州市江干区"
    ],
    [
        "name" => "拱墅区",
        "pid" => 330100,
        "code" => 330105,
        "mark" => "浙江省杭州市拱墅区"
    ],
    [
        "name" => "西湖区",
        "pid" => 330100,
        "code" => 330106,
        "mark" => "浙江省杭州市西湖区"
    ],
    [
        "name" => "滨江区",
        "pid" => 330100,
        "code" => 330108,
        "mark" => "浙江省杭州市滨江区"
    ],
    [
        "name" => "萧山区",
        "pid" => 330100,
        "code" => 330109,
        "mark" => "浙江省杭州市萧山区"
    ],
    [
        "name" => "余杭区",
        "pid" => 330100,
        "code" => 330110,
        "mark" => "浙江省杭州市余杭区"
    ],
    [
        "name" => "富阳区",
        "pid" => 330100,
        "code" => 330111,
        "mark" => "浙江省杭州市富阳区"
    ],
    [
        "name" => "桐庐县",
        "pid" => 330100,
        "code" => 330122,
        "mark" => "浙江省杭州市桐庐县"
    ],
    [
        "name" => "淳安县",
        "pid" => 330100,
        "code" => 330127,
        "mark" => "浙江省杭州市淳安县"
    ],
    [
        "name" => "建德市",
        "pid" => 330100,
        "code" => 330182,
        "mark" => "浙江省杭州市建德市"
    ],
    [
        "name" => "临安市",
        "pid" => 330100,
        "code" => 330185,
        "mark" => "浙江省杭州市临安市"
    ],
    [
        "name" => "宁波市",
        "pid" => 330000,
        "code" => 330200,
        "mark" => "浙江省宁波市"
    ],
    [
        "name" => "海曙区",
        "pid" => 330200,
        "code" => 330203,
        "mark" => "浙江省宁波市海曙区"
    ],
    [
        "name" => "江东区",
        "pid" => 330200,
        "code" => 330204,
        "mark" => "浙江省宁波市江东区"
    ],
    [
        "name" => "江北区",
        "pid" => 330200,
        "code" => 330205,
        "mark" => "浙江省宁波市江北区"
    ],
    [
        "name" => "北仑区",
        "pid" => 330200,
        "code" => 330206,
        "mark" => "浙江省宁波市北仑区"
    ],
    [
        "name" => "镇海区",
        "pid" => 330200,
        "code" => 330211,
        "mark" => "浙江省宁波市镇海区"
    ],
    [
        "name" => "鄞州区",
        "pid" => 330200,
        "code" => 330212,
        "mark" => "浙江省宁波市鄞州区"
    ],
    [
        "name" => "象山县",
        "pid" => 330200,
        "code" => 330225,
        "mark" => "浙江省宁波市象山县"
    ],
    [
        "name" => "宁海县",
        "pid" => 330200,
        "code" => 330226,
        "mark" => "浙江省宁波市宁海县"
    ],
    [
        "name" => "余姚市",
        "pid" => 330200,
        "code" => 330281,
        "mark" => "浙江省宁波市余姚市"
    ],
    [
        "name" => "慈溪市",
        "pid" => 330200,
        "code" => 330282,
        "mark" => "浙江省宁波市慈溪市"
    ],
    [
        "name" => "奉化市",
        "pid" => 330200,
        "code" => 330283,
        "mark" => "浙江省宁波市奉化市"
    ],
    [
        "name" => "温州市",
        "pid" => 330000,
        "code" => 330300,
        "mark" => "浙江省温州市"
    ],
    [
        "name" => "鹿城区",
        "pid" => 330300,
        "code" => 330302,
        "mark" => "浙江省温州市鹿城区"
    ],
    [
        "name" => "龙湾区",
        "pid" => 330300,
        "code" => 330303,
        "mark" => "浙江省温州市龙湾区"
    ],
    [
        "name" => "瓯海区",
        "pid" => 330300,
        "code" => 330304,
        "mark" => "浙江省温州市瓯海区"
    ],
    [
        "name" => "洞头区",
        "pid" => 330300,
        "code" => 330305,
        "mark" => "浙江省温州市洞头区"
    ],
    [
        "name" => "永嘉县",
        "pid" => 330300,
        "code" => 330324,
        "mark" => "浙江省温州市永嘉县"
    ],
    [
        "name" => "平阳县",
        "pid" => 330300,
        "code" => 330326,
        "mark" => "浙江省温州市平阳县"
    ],
    [
        "name" => "苍南县",
        "pid" => 330300,
        "code" => 330327,
        "mark" => "浙江省温州市苍南县"
    ],
    [
        "name" => "文成县",
        "pid" => 330300,
        "code" => 330328,
        "mark" => "浙江省温州市文成县"
    ],
    [
        "name" => "泰顺县",
        "pid" => 330300,
        "code" => 330329,
        "mark" => "浙江省温州市泰顺县"
    ],
    [
        "name" => "瑞安市",
        "pid" => 330300,
        "code" => 330381,
        "mark" => "浙江省温州市瑞安市"
    ],
    [
        "name" => "乐清市",
        "pid" => 330300,
        "code" => 330382,
        "mark" => "浙江省温州市乐清市"
    ],
    [
        "name" => "嘉兴市",
        "pid" => 330000,
        "code" => 330400,
        "mark" => "浙江省嘉兴市"
    ],
    [
        "name" => "南湖区",
        "pid" => 330400,
        "code" => 330402,
        "mark" => "浙江省嘉兴市南湖区"
    ],
    [
        "name" => "秀洲区",
        "pid" => 330400,
        "code" => 330411,
        "mark" => "浙江省嘉兴市秀洲区"
    ],
    [
        "name" => "嘉善县",
        "pid" => 330400,
        "code" => 330421,
        "mark" => "浙江省嘉兴市嘉善县"
    ],
    [
        "name" => "海盐县",
        "pid" => 330400,
        "code" => 330424,
        "mark" => "浙江省嘉兴市海盐县"
    ],
    [
        "name" => "海宁市",
        "pid" => 330400,
        "code" => 330481,
        "mark" => "浙江省嘉兴市海宁市"
    ],
    [
        "name" => "平湖市",
        "pid" => 330400,
        "code" => 330482,
        "mark" => "浙江省嘉兴市平湖市"
    ],
    [
        "name" => "桐乡市",
        "pid" => 330400,
        "code" => 330483,
        "mark" => "浙江省嘉兴市桐乡市"
    ],
    [
        "name" => "湖州市",
        "pid" => 330000,
        "code" => 330500,
        "mark" => "浙江省湖州市"
    ],
    [
        "name" => "吴兴区",
        "pid" => 330500,
        "code" => 330502,
        "mark" => "浙江省湖州市吴兴区"
    ],
    [
        "name" => "南浔区",
        "pid" => 330500,
        "code" => 330503,
        "mark" => "浙江省湖州市南浔区"
    ],
    [
        "name" => "德清县",
        "pid" => 330500,
        "code" => 330521,
        "mark" => "浙江省湖州市德清县"
    ],
    [
        "name" => "长兴县",
        "pid" => 330500,
        "code" => 330522,
        "mark" => "浙江省湖州市长兴县"
    ],
    [
        "name" => "安吉县",
        "pid" => 330500,
        "code" => 330523,
        "mark" => "浙江省湖州市安吉县"
    ],
    [
        "name" => "绍兴市",
        "pid" => 330000,
        "code" => 330600,
        "mark" => "浙江省绍兴市"
    ],
    [
        "name" => "越城区",
        "pid" => 330600,
        "code" => 330602,
        "mark" => "浙江省绍兴市越城区"
    ],
    [
        "name" => "柯桥区",
        "pid" => 330600,
        "code" => 330603,
        "mark" => "浙江省绍兴市柯桥区"
    ],
    [
        "name" => "上虞区",
        "pid" => 330600,
        "code" => 330604,
        "mark" => "浙江省绍兴市上虞区"
    ],
    [
        "name" => "新昌县",
        "pid" => 330600,
        "code" => 330624,
        "mark" => "浙江省绍兴市新昌县"
    ],
    [
        "name" => "诸暨市",
        "pid" => 330600,
        "code" => 330681,
        "mark" => "浙江省绍兴市诸暨市"
    ],
    [
        "name" => "嵊州市",
        "pid" => 330600,
        "code" => 330683,
        "mark" => "浙江省绍兴市嵊州市"
    ],
    [
        "name" => "金华市",
        "pid" => 330000,
        "code" => 330700,
        "mark" => "浙江省金华市"
    ],
    [
        "name" => "婺城区",
        "pid" => 330700,
        "code" => 330702,
        "mark" => "浙江省金华市婺城区"
    ],
    [
        "name" => "金东区",
        "pid" => 330700,
        "code" => 330703,
        "mark" => "浙江省金华市金东区"
    ],
    [
        "name" => "武义县",
        "pid" => 330700,
        "code" => 330723,
        "mark" => "浙江省金华市武义县"
    ],
    [
        "name" => "浦江县",
        "pid" => 330700,
        "code" => 330726,
        "mark" => "浙江省金华市浦江县"
    ],
    [
        "name" => "磐安县",
        "pid" => 330700,
        "code" => 330727,
        "mark" => "浙江省金华市磐安县"
    ],
    [
        "name" => "兰溪市",
        "pid" => 330700,
        "code" => 330781,
        "mark" => "浙江省金华市兰溪市"
    ],
    [
        "name" => "义乌市",
        "pid" => 330700,
        "code" => 330782,
        "mark" => "浙江省金华市义乌市"
    ],
    [
        "name" => "东阳市",
        "pid" => 330700,
        "code" => 330783,
        "mark" => "浙江省金华市东阳市"
    ],
    [
        "name" => "永康市",
        "pid" => 330700,
        "code" => 330784,
        "mark" => "浙江省金华市永康市"
    ],
    [
        "name" => "衢州市",
        "pid" => 330000,
        "code" => 330800,
        "mark" => "浙江省衢州市"
    ],
    [
        "name" => "柯城区",
        "pid" => 330800,
        "code" => 330802,
        "mark" => "浙江省衢州市柯城区"
    ],
    [
        "name" => "衢江区",
        "pid" => 330800,
        "code" => 330803,
        "mark" => "浙江省衢州市衢江区"
    ],
    [
        "name" => "常山县",
        "pid" => 330800,
        "code" => 330822,
        "mark" => "浙江省衢州市常山县"
    ],
    [
        "name" => "开化县",
        "pid" => 330800,
        "code" => 330824,
        "mark" => "浙江省衢州市开化县"
    ],
    [
        "name" => "龙游县",
        "pid" => 330800,
        "code" => 330825,
        "mark" => "浙江省衢州市龙游县"
    ],
    [
        "name" => "江山市",
        "pid" => 330800,
        "code" => 330881,
        "mark" => "浙江省衢州市江山市"
    ],
    [
        "name" => "舟山市",
        "pid" => 330000,
        "code" => 330900,
        "mark" => "浙江省舟山市"
    ],
    [
        "name" => "定海区",
        "pid" => 330900,
        "code" => 330902,
        "mark" => "浙江省舟山市定海区"
    ],
    [
        "name" => "普陀区",
        "pid" => 330900,
        "code" => 330903,
        "mark" => "浙江省舟山市普陀区"
    ],
    [
        "name" => "岱山县",
        "pid" => 330900,
        "code" => 330921,
        "mark" => "浙江省舟山市岱山县"
    ],
    [
        "name" => "嵊泗县",
        "pid" => 330900,
        "code" => 330922,
        "mark" => "浙江省舟山市嵊泗县"
    ],
    [
        "name" => "台州市",
        "pid" => 330000,
        "code" => 331000,
        "mark" => "浙江省台州市"
    ],
    [
        "name" => "椒江区",
        "pid" => 331000,
        "code" => 331002,
        "mark" => "浙江省台州市椒江区"
    ],
    [
        "name" => "黄岩区",
        "pid" => 331000,
        "code" => 331003,
        "mark" => "浙江省台州市黄岩区"
    ],
    [
        "name" => "路桥区",
        "pid" => 331000,
        "code" => 331004,
        "mark" => "浙江省台州市路桥区"
    ],
    [
        "name" => "玉环县",
        "pid" => 331000,
        "code" => 331021,
        "mark" => "浙江省台州市玉环县"
    ],
    [
        "name" => "三门县",
        "pid" => 331000,
        "code" => 331022,
        "mark" => "浙江省台州市三门县"
    ],
    [
        "name" => "天台县",
        "pid" => 331000,
        "code" => 331023,
        "mark" => "浙江省台州市天台县"
    ],
    [
        "name" => "仙居县",
        "pid" => 331000,
        "code" => 331024,
        "mark" => "浙江省台州市仙居县"
    ],
    [
        "name" => "温岭市",
        "pid" => 331000,
        "code" => 331081,
        "mark" => "浙江省台州市温岭市"
    ],
    [
        "name" => "临海市",
        "pid" => 331000,
        "code" => 331082,
        "mark" => "浙江省台州市临海市"
    ],
    [
        "name" => "丽水市",
        "pid" => 330000,
        "code" => 331100,
        "mark" => "浙江省丽水市"
    ],
    [
        "name" => "莲都区",
        "pid" => 331100,
        "code" => 331102,
        "mark" => "浙江省丽水市莲都区"
    ],
    [
        "name" => "青田县",
        "pid" => 331100,
        "code" => 331121,
        "mark" => "浙江省丽水市青田县"
    ],
    [
        "name" => "缙云县",
        "pid" => 331100,
        "code" => 331122,
        "mark" => "浙江省丽水市缙云县"
    ],
    [
        "name" => "遂昌县",
        "pid" => 331100,
        "code" => 331123,
        "mark" => "浙江省丽水市遂昌县"
    ],
    [
        "name" => "松阳县",
        "pid" => 331100,
        "code" => 331124,
        "mark" => "浙江省丽水市松阳县"
    ],
    [
        "name" => "云和县",
        "pid" => 331100,
        "code" => 331125,
        "mark" => "浙江省丽水市云和县"
    ],
    [
        "name" => "庆元县",
        "pid" => 331100,
        "code" => 331126,
        "mark" => "浙江省丽水市庆元县"
    ],
    [
        "name" => "景宁畲族自治县",
        "pid" => 331100,
        "code" => 331127,
        "mark" => "浙江省丽水市景宁畲族自治县"
    ],
    [
        "name" => "龙泉市",
        "pid" => 331100,
        "code" => 331181,
        "mark" => "浙江省丽水市龙泉市"
    ],
    [
        "name" => "安徽省",
        "pid" => 86,
        "code" => 340000,
        "mark" => "安徽省"
    ],
    [
        "name" => "合肥市",
        "pid" => 340000,
        "code" => 340100,
        "mark" => "安徽省合肥市"
    ],
    [
        "name" => "瑶海区",
        "pid" => 340100,
        "code" => 340102,
        "mark" => "安徽省合肥市瑶海区"
    ],
    [
        "name" => "庐阳区",
        "pid" => 340100,
        "code" => 340103,
        "mark" => "安徽省合肥市庐阳区"
    ],
    [
        "name" => "蜀山区",
        "pid" => 340100,
        "code" => 340104,
        "mark" => "安徽省合肥市蜀山区"
    ],
    [
        "name" => "包河区",
        "pid" => 340100,
        "code" => 340111,
        "mark" => "安徽省合肥市包河区"
    ],
    [
        "name" => "长丰县",
        "pid" => 340100,
        "code" => 340121,
        "mark" => "安徽省合肥市长丰县"
    ],
    [
        "name" => "肥东县",
        "pid" => 340100,
        "code" => 340122,
        "mark" => "安徽省合肥市肥东县"
    ],
    [
        "name" => "肥西县",
        "pid" => 340100,
        "code" => 340123,
        "mark" => "安徽省合肥市肥西县"
    ],
    [
        "name" => "庐江县",
        "pid" => 340100,
        "code" => 340124,
        "mark" => "安徽省合肥市庐江县"
    ],
    [
        "name" => "巢湖市",
        "pid" => 340100,
        "code" => 340181,
        "mark" => "安徽省合肥市巢湖市"
    ],
    [
        "name" => "芜湖市",
        "pid" => 340000,
        "code" => 340200,
        "mark" => "安徽省芜湖市"
    ],
    [
        "name" => "镜湖区",
        "pid" => 340200,
        "code" => 340202,
        "mark" => "安徽省芜湖市镜湖区"
    ],
    [
        "name" => "弋江区",
        "pid" => 340200,
        "code" => 340203,
        "mark" => "安徽省芜湖市弋江区"
    ],
    [
        "name" => "鸠江区",
        "pid" => 340200,
        "code" => 340207,
        "mark" => "安徽省芜湖市鸠江区"
    ],
    [
        "name" => "三山区",
        "pid" => 340200,
        "code" => 340208,
        "mark" => "安徽省芜湖市三山区"
    ],
    [
        "name" => "芜湖县",
        "pid" => 340200,
        "code" => 340221,
        "mark" => "安徽省芜湖市芜湖县"
    ],
    [
        "name" => "繁昌县",
        "pid" => 340200,
        "code" => 340222,
        "mark" => "安徽省芜湖市繁昌县"
    ],
    [
        "name" => "南陵县",
        "pid" => 340200,
        "code" => 340223,
        "mark" => "安徽省芜湖市南陵县"
    ],
    [
        "name" => "无为县",
        "pid" => 340200,
        "code" => 340225,
        "mark" => "安徽省芜湖市无为县"
    ],
    [
        "name" => "蚌埠市",
        "pid" => 340000,
        "code" => 340300,
        "mark" => "安徽省蚌埠市"
    ],
    [
        "name" => "龙子湖区",
        "pid" => 340300,
        "code" => 340302,
        "mark" => "安徽省蚌埠市龙子湖区"
    ],
    [
        "name" => "蚌山区",
        "pid" => 340300,
        "code" => 340303,
        "mark" => "安徽省蚌埠市蚌山区"
    ],
    [
        "name" => "禹会区",
        "pid" => 340300,
        "code" => 340304,
        "mark" => "安徽省蚌埠市禹会区"
    ],
    [
        "name" => "淮上区",
        "pid" => 340300,
        "code" => 340311,
        "mark" => "安徽省蚌埠市淮上区"
    ],
    [
        "name" => "怀远县",
        "pid" => 340300,
        "code" => 340321,
        "mark" => "安徽省蚌埠市怀远县"
    ],
    [
        "name" => "五河县",
        "pid" => 340300,
        "code" => 340322,
        "mark" => "安徽省蚌埠市五河县"
    ],
    [
        "name" => "固镇县",
        "pid" => 340300,
        "code" => 340323,
        "mark" => "安徽省蚌埠市固镇县"
    ],
    [
        "name" => "淮南市",
        "pid" => 340000,
        "code" => 340400,
        "mark" => "安徽省淮南市"
    ],
    [
        "name" => "大通区",
        "pid" => 340400,
        "code" => 340402,
        "mark" => "安徽省淮南市大通区"
    ],
    [
        "name" => "田家庵区",
        "pid" => 340400,
        "code" => 340403,
        "mark" => "安徽省淮南市田家庵区"
    ],
    [
        "name" => "谢家集区",
        "pid" => 340400,
        "code" => 340404,
        "mark" => "安徽省淮南市谢家集区"
    ],
    [
        "name" => "八公山区",
        "pid" => 340400,
        "code" => 340405,
        "mark" => "安徽省淮南市八公山区"
    ],
    [
        "name" => "潘集区",
        "pid" => 340400,
        "code" => 340406,
        "mark" => "安徽省淮南市潘集区"
    ],
    [
        "name" => "凤台县",
        "pid" => 340400,
        "code" => 340421,
        "mark" => "安徽省淮南市凤台县"
    ],
    [
        "name" => "寿县",
        "pid" => 340400,
        "code" => 340422,
        "mark" => "安徽省淮南市寿县"
    ],
    [
        "name" => "马鞍山市",
        "pid" => 340000,
        "code" => 340500,
        "mark" => "安徽省马鞍山市"
    ],
    [
        "name" => "花山区",
        "pid" => 340500,
        "code" => 340503,
        "mark" => "安徽省马鞍山市花山区"
    ],
    [
        "name" => "雨山区",
        "pid" => 340500,
        "code" => 340504,
        "mark" => "安徽省马鞍山市雨山区"
    ],
    [
        "name" => "博望区",
        "pid" => 340500,
        "code" => 340506,
        "mark" => "安徽省马鞍山市博望区"
    ],
    [
        "name" => "当涂县",
        "pid" => 340500,
        "code" => 340521,
        "mark" => "安徽省马鞍山市当涂县"
    ],
    [
        "name" => "含山县",
        "pid" => 340500,
        "code" => 340522,
        "mark" => "安徽省马鞍山市含山县"
    ],
    [
        "name" => "和县",
        "pid" => 340500,
        "code" => 340523,
        "mark" => "安徽省马鞍山市和县"
    ],
    [
        "name" => "淮北市",
        "pid" => 340000,
        "code" => 340600,
        "mark" => "安徽省淮北市"
    ],
    [
        "name" => "杜集区",
        "pid" => 340600,
        "code" => 340602,
        "mark" => "安徽省淮北市杜集区"
    ],
    [
        "name" => "相山区",
        "pid" => 340600,
        "code" => 340603,
        "mark" => "安徽省淮北市相山区"
    ],
    [
        "name" => "烈山区",
        "pid" => 340600,
        "code" => 340604,
        "mark" => "安徽省淮北市烈山区"
    ],
    [
        "name" => "濉溪县",
        "pid" => 340600,
        "code" => 340621,
        "mark" => "安徽省淮北市濉溪县"
    ],
    [
        "name" => "铜陵市",
        "pid" => 340000,
        "code" => 340700,
        "mark" => "安徽省铜陵市"
    ],
    [
        "name" => "铜官区",
        "pid" => 340700,
        "code" => 340705,
        "mark" => "安徽省铜陵市铜官区"
    ],
    [
        "name" => "义安区",
        "pid" => 340700,
        "code" => 340706,
        "mark" => "安徽省铜陵市义安区"
    ],
    [
        "name" => "郊区",
        "pid" => 340700,
        "code" => 340711,
        "mark" => "安徽省铜陵市郊区"
    ],
    [
        "name" => "枞阳县",
        "pid" => 340700,
        "code" => 340722,
        "mark" => "安徽省铜陵市枞阳县"
    ],
    [
        "name" => "安庆市",
        "pid" => 340000,
        "code" => 340800,
        "mark" => "安徽省安庆市"
    ],
    [
        "name" => "迎江区",
        "pid" => 340800,
        "code" => 340802,
        "mark" => "安徽省安庆市迎江区"
    ],
    [
        "name" => "大观区",
        "pid" => 340800,
        "code" => 340803,
        "mark" => "安徽省安庆市大观区"
    ],
    [
        "name" => "宜秀区",
        "pid" => 340800,
        "code" => 340811,
        "mark" => "安徽省安庆市宜秀区"
    ],
    [
        "name" => "怀宁县",
        "pid" => 340800,
        "code" => 340822,
        "mark" => "安徽省安庆市怀宁县"
    ],
    [
        "name" => "潜山县",
        "pid" => 340800,
        "code" => 340824,
        "mark" => "安徽省安庆市潜山县"
    ],
    [
        "name" => "太湖县",
        "pid" => 340800,
        "code" => 340825,
        "mark" => "安徽省安庆市太湖县"
    ],
    [
        "name" => "宿松县",
        "pid" => 340800,
        "code" => 340826,
        "mark" => "安徽省安庆市宿松县"
    ],
    [
        "name" => "望江县",
        "pid" => 340800,
        "code" => 340827,
        "mark" => "安徽省安庆市望江县"
    ],
    [
        "name" => "岳西县",
        "pid" => 340800,
        "code" => 340828,
        "mark" => "安徽省安庆市岳西县"
    ],
    [
        "name" => "桐城市",
        "pid" => 340800,
        "code" => 340881,
        "mark" => "安徽省安庆市桐城市"
    ],
    [
        "name" => "黄山市",
        "pid" => 340000,
        "code" => 341000,
        "mark" => "安徽省黄山市"
    ],
    [
        "name" => "屯溪区",
        "pid" => 341000,
        "code" => 341002,
        "mark" => "安徽省黄山市屯溪区"
    ],
    [
        "name" => "黄山区",
        "pid" => 341000,
        "code" => 341003,
        "mark" => "安徽省黄山市黄山区"
    ],
    [
        "name" => "徽州区",
        "pid" => 341000,
        "code" => 341004,
        "mark" => "安徽省黄山市徽州区"
    ],
    [
        "name" => "歙县",
        "pid" => 341000,
        "code" => 341021,
        "mark" => "安徽省黄山市歙县"
    ],
    [
        "name" => "休宁县",
        "pid" => 341000,
        "code" => 341022,
        "mark" => "安徽省黄山市休宁县"
    ],
    [
        "name" => "黟县",
        "pid" => 341000,
        "code" => 341023,
        "mark" => "安徽省黄山市黟县"
    ],
    [
        "name" => "祁门县",
        "pid" => 341000,
        "code" => 341024,
        "mark" => "安徽省黄山市祁门县"
    ],
    [
        "name" => "滁州市",
        "pid" => 340000,
        "code" => 341100,
        "mark" => "安徽省滁州市"
    ],
    [
        "name" => "琅琊区",
        "pid" => 341100,
        "code" => 341102,
        "mark" => "安徽省滁州市琅琊区"
    ],
    [
        "name" => "南谯区",
        "pid" => 341100,
        "code" => 341103,
        "mark" => "安徽省滁州市南谯区"
    ],
    [
        "name" => "来安县",
        "pid" => 341100,
        "code" => 341122,
        "mark" => "安徽省滁州市来安县"
    ],
    [
        "name" => "全椒县",
        "pid" => 341100,
        "code" => 341124,
        "mark" => "安徽省滁州市全椒县"
    ],
    [
        "name" => "定远县",
        "pid" => 341100,
        "code" => 341125,
        "mark" => "安徽省滁州市定远县"
    ],
    [
        "name" => "凤阳县",
        "pid" => 341100,
        "code" => 341126,
        "mark" => "安徽省滁州市凤阳县"
    ],
    [
        "name" => "天长市",
        "pid" => 341100,
        "code" => 341181,
        "mark" => "安徽省滁州市天长市"
    ],
    [
        "name" => "明光市",
        "pid" => 341100,
        "code" => 341182,
        "mark" => "安徽省滁州市明光市"
    ],
    [
        "name" => "阜阳市",
        "pid" => 340000,
        "code" => 341200,
        "mark" => "安徽省阜阳市"
    ],
    [
        "name" => "颍州区",
        "pid" => 341200,
        "code" => 341202,
        "mark" => "安徽省阜阳市颍州区"
    ],
    [
        "name" => "颍东区",
        "pid" => 341200,
        "code" => 341203,
        "mark" => "安徽省阜阳市颍东区"
    ],
    [
        "name" => "颍泉区",
        "pid" => 341200,
        "code" => 341204,
        "mark" => "安徽省阜阳市颍泉区"
    ],
    [
        "name" => "临泉县",
        "pid" => 341200,
        "code" => 341221,
        "mark" => "安徽省阜阳市临泉县"
    ],
    [
        "name" => "太和县",
        "pid" => 341200,
        "code" => 341222,
        "mark" => "安徽省阜阳市太和县"
    ],
    [
        "name" => "阜南县",
        "pid" => 341200,
        "code" => 341225,
        "mark" => "安徽省阜阳市阜南县"
    ],
    [
        "name" => "颍上县",
        "pid" => 341200,
        "code" => 341226,
        "mark" => "安徽省阜阳市颍上县"
    ],
    [
        "name" => "界首市",
        "pid" => 341200,
        "code" => 341282,
        "mark" => "安徽省阜阳市界首市"
    ],
    [
        "name" => "宿州市",
        "pid" => 340000,
        "code" => 341300,
        "mark" => "安徽省宿州市"
    ],
    [
        "name" => "埇桥区",
        "pid" => 341300,
        "code" => 341302,
        "mark" => "安徽省宿州市埇桥区"
    ],
    [
        "name" => "砀山县",
        "pid" => 341300,
        "code" => 341321,
        "mark" => "安徽省宿州市砀山县"
    ],
    [
        "name" => "萧县",
        "pid" => 341300,
        "code" => 341322,
        "mark" => "安徽省宿州市萧县"
    ],
    [
        "name" => "灵璧县",
        "pid" => 341300,
        "code" => 341323,
        "mark" => "安徽省宿州市灵璧县"
    ],
    [
        "name" => "泗县",
        "pid" => 341300,
        "code" => 341324,
        "mark" => "安徽省宿州市泗县"
    ],
    [
        "name" => "六安市",
        "pid" => 340000,
        "code" => 341500,
        "mark" => "安徽省六安市"
    ],
    [
        "name" => "金安区",
        "pid" => 341500,
        "code" => 341502,
        "mark" => "安徽省六安市金安区"
    ],
    [
        "name" => "裕安区",
        "pid" => 341500,
        "code" => 341503,
        "mark" => "安徽省六安市裕安区"
    ],
    [
        "name" => "叶集区",
        "pid" => 341500,
        "code" => 341504,
        "mark" => "安徽省六安市叶集区"
    ],
    [
        "name" => "霍邱县",
        "pid" => 341500,
        "code" => 341522,
        "mark" => "安徽省六安市霍邱县"
    ],
    [
        "name" => "舒城县",
        "pid" => 341500,
        "code" => 341523,
        "mark" => "安徽省六安市舒城县"
    ],
    [
        "name" => "金寨县",
        "pid" => 341500,
        "code" => 341524,
        "mark" => "安徽省六安市金寨县"
    ],
    [
        "name" => "霍山县",
        "pid" => 341500,
        "code" => 341525,
        "mark" => "安徽省六安市霍山县"
    ],
    [
        "name" => "亳州市",
        "pid" => 340000,
        "code" => 341600,
        "mark" => "安徽省亳州市"
    ],
    [
        "name" => "谯城区",
        "pid" => 341600,
        "code" => 341602,
        "mark" => "安徽省亳州市谯城区"
    ],
    [
        "name" => "涡阳县",
        "pid" => 341600,
        "code" => 341621,
        "mark" => "安徽省亳州市涡阳县"
    ],
    [
        "name" => "蒙城县",
        "pid" => 341600,
        "code" => 341622,
        "mark" => "安徽省亳州市蒙城县"
    ],
    [
        "name" => "利辛县",
        "pid" => 341600,
        "code" => 341623,
        "mark" => "安徽省亳州市利辛县"
    ],
    [
        "name" => "池州市",
        "pid" => 340000,
        "code" => 341700,
        "mark" => "安徽省池州市"
    ],
    [
        "name" => "贵池区",
        "pid" => 341700,
        "code" => 341702,
        "mark" => "安徽省池州市贵池区"
    ],
    [
        "name" => "东至县",
        "pid" => 341700,
        "code" => 341721,
        "mark" => "安徽省池州市东至县"
    ],
    [
        "name" => "石台县",
        "pid" => 341700,
        "code" => 341722,
        "mark" => "安徽省池州市石台县"
    ],
    [
        "name" => "青阳县",
        "pid" => 341700,
        "code" => 341723,
        "mark" => "安徽省池州市青阳县"
    ],
    [
        "name" => "宣城市",
        "pid" => 340000,
        "code" => 341800,
        "mark" => "安徽省宣城市"
    ],
    [
        "name" => "宣州区",
        "pid" => 341800,
        "code" => 341802,
        "mark" => "安徽省宣城市宣州区"
    ],
    [
        "name" => "郎溪县",
        "pid" => 341800,
        "code" => 341821,
        "mark" => "安徽省宣城市郎溪县"
    ],
    [
        "name" => "广德县",
        "pid" => 341800,
        "code" => 341822,
        "mark" => "安徽省宣城市广德县"
    ],
    [
        "name" => "泾县",
        "pid" => 341800,
        "code" => 341823,
        "mark" => "安徽省宣城市泾县"
    ],
    [
        "name" => "绩溪县",
        "pid" => 341800,
        "code" => 341824,
        "mark" => "安徽省宣城市绩溪县"
    ],
    [
        "name" => "旌德县",
        "pid" => 341800,
        "code" => 341825,
        "mark" => "安徽省宣城市旌德县"
    ],
    [
        "name" => "宁国市",
        "pid" => 341800,
        "code" => 341881,
        "mark" => "安徽省宣城市宁国市"
    ],
    [
        "name" => "福建省",
        "pid" => 86,
        "code" => 350000,
        "mark" => "福建省"
    ],
    [
        "name" => "福州市",
        "pid" => 350000,
        "code" => 350100,
        "mark" => "福建省福州市"
    ],
    [
        "name" => "鼓楼区",
        "pid" => 350100,
        "code" => 350102,
        "mark" => "福建省福州市鼓楼区"
    ],
    [
        "name" => "台江区",
        "pid" => 350100,
        "code" => 350103,
        "mark" => "福建省福州市台江区"
    ],
    [
        "name" => "仓山区",
        "pid" => 350100,
        "code" => 350104,
        "mark" => "福建省福州市仓山区"
    ],
    [
        "name" => "马尾区",
        "pid" => 350100,
        "code" => 350105,
        "mark" => "福建省福州市马尾区"
    ],
    [
        "name" => "晋安区",
        "pid" => 350100,
        "code" => 350111,
        "mark" => "福建省福州市晋安区"
    ],
    [
        "name" => "闽侯县",
        "pid" => 350100,
        "code" => 350121,
        "mark" => "福建省福州市闽侯县"
    ],
    [
        "name" => "连江县",
        "pid" => 350100,
        "code" => 350122,
        "mark" => "福建省福州市连江县"
    ],
    [
        "name" => "罗源县",
        "pid" => 350100,
        "code" => 350123,
        "mark" => "福建省福州市罗源县"
    ],
    [
        "name" => "闽清县",
        "pid" => 350100,
        "code" => 350124,
        "mark" => "福建省福州市闽清县"
    ],
    [
        "name" => "永泰县",
        "pid" => 350100,
        "code" => 350125,
        "mark" => "福建省福州市永泰县"
    ],
    [
        "name" => "平潭县",
        "pid" => 350100,
        "code" => 350128,
        "mark" => "福建省福州市平潭县"
    ],
    [
        "name" => "福清市",
        "pid" => 350100,
        "code" => 350181,
        "mark" => "福建省福州市福清市"
    ],
    [
        "name" => "长乐市",
        "pid" => 350100,
        "code" => 350182,
        "mark" => "福建省福州市长乐市"
    ],
    [
        "name" => "厦门市",
        "pid" => 350000,
        "code" => 350200,
        "mark" => "福建省厦门市"
    ],
    [
        "name" => "思明区",
        "pid" => 350200,
        "code" => 350203,
        "mark" => "福建省厦门市思明区"
    ],
    [
        "name" => "海沧区",
        "pid" => 350200,
        "code" => 350205,
        "mark" => "福建省厦门市海沧区"
    ],
    [
        "name" => "湖里区",
        "pid" => 350200,
        "code" => 350206,
        "mark" => "福建省厦门市湖里区"
    ],
    [
        "name" => "集美区",
        "pid" => 350200,
        "code" => 350211,
        "mark" => "福建省厦门市集美区"
    ],
    [
        "name" => "同安区",
        "pid" => 350200,
        "code" => 350212,
        "mark" => "福建省厦门市同安区"
    ],
    [
        "name" => "翔安区",
        "pid" => 350200,
        "code" => 350213,
        "mark" => "福建省厦门市翔安区"
    ],
    [
        "name" => "莆田市",
        "pid" => 350000,
        "code" => 350300,
        "mark" => "福建省莆田市"
    ],
    [
        "name" => "城厢区",
        "pid" => 350300,
        "code" => 350302,
        "mark" => "福建省莆田市城厢区"
    ],
    [
        "name" => "涵江区",
        "pid" => 350300,
        "code" => 350303,
        "mark" => "福建省莆田市涵江区"
    ],
    [
        "name" => "荔城区",
        "pid" => 350300,
        "code" => 350304,
        "mark" => "福建省莆田市荔城区"
    ],
    [
        "name" => "秀屿区",
        "pid" => 350300,
        "code" => 350305,
        "mark" => "福建省莆田市秀屿区"
    ],
    [
        "name" => "仙游县",
        "pid" => 350300,
        "code" => 350322,
        "mark" => "福建省莆田市仙游县"
    ],
    [
        "name" => "三明市",
        "pid" => 350000,
        "code" => 350400,
        "mark" => "福建省三明市"
    ],
    [
        "name" => "梅列区",
        "pid" => 350400,
        "code" => 350402,
        "mark" => "福建省三明市梅列区"
    ],
    [
        "name" => "三元区",
        "pid" => 350400,
        "code" => 350403,
        "mark" => "福建省三明市三元区"
    ],
    [
        "name" => "明溪县",
        "pid" => 350400,
        "code" => 350421,
        "mark" => "福建省三明市明溪县"
    ],
    [
        "name" => "清流县",
        "pid" => 350400,
        "code" => 350423,
        "mark" => "福建省三明市清流县"
    ],
    [
        "name" => "宁化县",
        "pid" => 350400,
        "code" => 350424,
        "mark" => "福建省三明市宁化县"
    ],
    [
        "name" => "大田县",
        "pid" => 350400,
        "code" => 350425,
        "mark" => "福建省三明市大田县"
    ],
    [
        "name" => "尤溪县",
        "pid" => 350400,
        "code" => 350426,
        "mark" => "福建省三明市尤溪县"
    ],
    [
        "name" => "沙县",
        "pid" => 350400,
        "code" => 350427,
        "mark" => "福建省三明市沙县"
    ],
    [
        "name" => "将乐县",
        "pid" => 350400,
        "code" => 350428,
        "mark" => "福建省三明市将乐县"
    ],
    [
        "name" => "泰宁县",
        "pid" => 350400,
        "code" => 350429,
        "mark" => "福建省三明市泰宁县"
    ],
    [
        "name" => "建宁县",
        "pid" => 350400,
        "code" => 350430,
        "mark" => "福建省三明市建宁县"
    ],
    [
        "name" => "永安市",
        "pid" => 350400,
        "code" => 350481,
        "mark" => "福建省三明市永安市"
    ],
    [
        "name" => "泉州市",
        "pid" => 350000,
        "code" => 350500,
        "mark" => "福建省泉州市"
    ],
    [
        "name" => "鲤城区",
        "pid" => 350500,
        "code" => 350502,
        "mark" => "福建省泉州市鲤城区"
    ],
    [
        "name" => "丰泽区",
        "pid" => 350500,
        "code" => 350503,
        "mark" => "福建省泉州市丰泽区"
    ],
    [
        "name" => "洛江区",
        "pid" => 350500,
        "code" => 350504,
        "mark" => "福建省泉州市洛江区"
    ],
    [
        "name" => "泉港区",
        "pid" => 350500,
        "code" => 350505,
        "mark" => "福建省泉州市泉港区"
    ],
    [
        "name" => "惠安县",
        "pid" => 350500,
        "code" => 350521,
        "mark" => "福建省泉州市惠安县"
    ],
    [
        "name" => "安溪县",
        "pid" => 350500,
        "code" => 350524,
        "mark" => "福建省泉州市安溪县"
    ],
    [
        "name" => "永春县",
        "pid" => 350500,
        "code" => 350525,
        "mark" => "福建省泉州市永春县"
    ],
    [
        "name" => "德化县",
        "pid" => 350500,
        "code" => 350526,
        "mark" => "福建省泉州市德化县"
    ],
    [
        "name" => "金门县",
        "pid" => 350500,
        "code" => 350527,
        "mark" => "福建省泉州市金门县"
    ],
    [
        "name" => "石狮市",
        "pid" => 350500,
        "code" => 350581,
        "mark" => "福建省泉州市石狮市"
    ],
    [
        "name" => "晋江市",
        "pid" => 350500,
        "code" => 350582,
        "mark" => "福建省泉州市晋江市"
    ],
    [
        "name" => "南安市",
        "pid" => 350500,
        "code" => 350583,
        "mark" => "福建省泉州市南安市"
    ],
    [
        "name" => "漳州市",
        "pid" => 350000,
        "code" => 350600,
        "mark" => "福建省漳州市"
    ],
    [
        "name" => "芗城区",
        "pid" => 350600,
        "code" => 350602,
        "mark" => "福建省漳州市芗城区"
    ],
    [
        "name" => "龙文区",
        "pid" => 350600,
        "code" => 350603,
        "mark" => "福建省漳州市龙文区"
    ],
    [
        "name" => "云霄县",
        "pid" => 350600,
        "code" => 350622,
        "mark" => "福建省漳州市云霄县"
    ],
    [
        "name" => "漳浦县",
        "pid" => 350600,
        "code" => 350623,
        "mark" => "福建省漳州市漳浦县"
    ],
    [
        "name" => "诏安县",
        "pid" => 350600,
        "code" => 350624,
        "mark" => "福建省漳州市诏安县"
    ],
    [
        "name" => "长泰县",
        "pid" => 350600,
        "code" => 350625,
        "mark" => "福建省漳州市长泰县"
    ],
    [
        "name" => "东山县",
        "pid" => 350600,
        "code" => 350626,
        "mark" => "福建省漳州市东山县"
    ],
    [
        "name" => "南靖县",
        "pid" => 350600,
        "code" => 350627,
        "mark" => "福建省漳州市南靖县"
    ],
    [
        "name" => "平和县",
        "pid" => 350600,
        "code" => 350628,
        "mark" => "福建省漳州市平和县"
    ],
    [
        "name" => "华安县",
        "pid" => 350600,
        "code" => 350629,
        "mark" => "福建省漳州市华安县"
    ],
    [
        "name" => "龙海市",
        "pid" => 350600,
        "code" => 350681,
        "mark" => "福建省漳州市龙海市"
    ],
    [
        "name" => "南平市",
        "pid" => 350000,
        "code" => 350700,
        "mark" => "福建省南平市"
    ],
    [
        "name" => "延平区",
        "pid" => 350700,
        "code" => 350702,
        "mark" => "福建省南平市延平区"
    ],
    [
        "name" => "建阳区",
        "pid" => 350700,
        "code" => 350703,
        "mark" => "福建省南平市建阳区"
    ],
    [
        "name" => "顺昌县",
        "pid" => 350700,
        "code" => 350721,
        "mark" => "福建省南平市顺昌县"
    ],
    [
        "name" => "浦城县",
        "pid" => 350700,
        "code" => 350722,
        "mark" => "福建省南平市浦城县"
    ],
    [
        "name" => "光泽县",
        "pid" => 350700,
        "code" => 350723,
        "mark" => "福建省南平市光泽县"
    ],
    [
        "name" => "松溪县",
        "pid" => 350700,
        "code" => 350724,
        "mark" => "福建省南平市松溪县"
    ],
    [
        "name" => "政和县",
        "pid" => 350700,
        "code" => 350725,
        "mark" => "福建省南平市政和县"
    ],
    [
        "name" => "邵武市",
        "pid" => 350700,
        "code" => 350781,
        "mark" => "福建省南平市邵武市"
    ],
    [
        "name" => "武夷山市",
        "pid" => 350700,
        "code" => 350782,
        "mark" => "福建省南平市武夷山市"
    ],
    [
        "name" => "建瓯市",
        "pid" => 350700,
        "code" => 350783,
        "mark" => "福建省南平市建瓯市"
    ],
    [
        "name" => "龙岩市",
        "pid" => 350000,
        "code" => 350800,
        "mark" => "福建省龙岩市"
    ],
    [
        "name" => "新罗区",
        "pid" => 350800,
        "code" => 350802,
        "mark" => "福建省龙岩市新罗区"
    ],
    [
        "name" => "永定区",
        "pid" => 350800,
        "code" => 350803,
        "mark" => "福建省龙岩市永定区"
    ],
    [
        "name" => "长汀县",
        "pid" => 350800,
        "code" => 350821,
        "mark" => "福建省龙岩市长汀县"
    ],
    [
        "name" => "上杭县",
        "pid" => 350800,
        "code" => 350823,
        "mark" => "福建省龙岩市上杭县"
    ],
    [
        "name" => "武平县",
        "pid" => 350800,
        "code" => 350824,
        "mark" => "福建省龙岩市武平县"
    ],
    [
        "name" => "连城县",
        "pid" => 350800,
        "code" => 350825,
        "mark" => "福建省龙岩市连城县"
    ],
    [
        "name" => "漳平市",
        "pid" => 350800,
        "code" => 350881,
        "mark" => "福建省龙岩市漳平市"
    ],
    [
        "name" => "宁德市",
        "pid" => 350000,
        "code" => 350900,
        "mark" => "福建省宁德市"
    ],
    [
        "name" => "蕉城区",
        "pid" => 350900,
        "code" => 350902,
        "mark" => "福建省宁德市蕉城区"
    ],
    [
        "name" => "霞浦县",
        "pid" => 350900,
        "code" => 350921,
        "mark" => "福建省宁德市霞浦县"
    ],
    [
        "name" => "古田县",
        "pid" => 350900,
        "code" => 350922,
        "mark" => "福建省宁德市古田县"
    ],
    [
        "name" => "屏南县",
        "pid" => 350900,
        "code" => 350923,
        "mark" => "福建省宁德市屏南县"
    ],
    [
        "name" => "寿宁县",
        "pid" => 350900,
        "code" => 350924,
        "mark" => "福建省宁德市寿宁县"
    ],
    [
        "name" => "周宁县",
        "pid" => 350900,
        "code" => 350925,
        "mark" => "福建省宁德市周宁县"
    ],
    [
        "name" => "柘荣县",
        "pid" => 350900,
        "code" => 350926,
        "mark" => "福建省宁德市柘荣县"
    ],
    [
        "name" => "福安市",
        "pid" => 350900,
        "code" => 350981,
        "mark" => "福建省宁德市福安市"
    ],
    [
        "name" => "福鼎市",
        "pid" => 350900,
        "code" => 350982,
        "mark" => "福建省宁德市福鼎市"
    ],
    [
        "name" => "江西省",
        "pid" => 86,
        "code" => 360000,
        "mark" => "江西省"
    ],
    [
        "name" => "南昌市",
        "pid" => 360000,
        "code" => 360100,
        "mark" => "江西省南昌市"
    ],
    [
        "name" => "东湖区",
        "pid" => 360100,
        "code" => 360102,
        "mark" => "江西省南昌市东湖区"
    ],
    [
        "name" => "西湖区",
        "pid" => 360100,
        "code" => 360103,
        "mark" => "江西省南昌市西湖区"
    ],
    [
        "name" => "青云谱区",
        "pid" => 360100,
        "code" => 360104,
        "mark" => "江西省南昌市青云谱区"
    ],
    [
        "name" => "湾里区",
        "pid" => 360100,
        "code" => 360105,
        "mark" => "江西省南昌市湾里区"
    ],
    [
        "name" => "青山湖区",
        "pid" => 360100,
        "code" => 360111,
        "mark" => "江西省南昌市青山湖区"
    ],
    [
        "name" => "新建区",
        "pid" => 360100,
        "code" => 360112,
        "mark" => "江西省南昌市新建区"
    ],
    [
        "name" => "南昌县",
        "pid" => 360100,
        "code" => 360121,
        "mark" => "江西省南昌市南昌县"
    ],
    [
        "name" => "安义县",
        "pid" => 360100,
        "code" => 360123,
        "mark" => "江西省南昌市安义县"
    ],
    [
        "name" => "进贤县",
        "pid" => 360100,
        "code" => 360124,
        "mark" => "江西省南昌市进贤县"
    ],
    [
        "name" => "景德镇市",
        "pid" => 360000,
        "code" => 360200,
        "mark" => "江西省景德镇市"
    ],
    [
        "name" => "昌江区",
        "pid" => 360200,
        "code" => 360202,
        "mark" => "江西省景德镇市昌江区"
    ],
    [
        "name" => "珠山区",
        "pid" => 360200,
        "code" => 360203,
        "mark" => "江西省景德镇市珠山区"
    ],
    [
        "name" => "浮梁县",
        "pid" => 360200,
        "code" => 360222,
        "mark" => "江西省景德镇市浮梁县"
    ],
    [
        "name" => "乐平市",
        "pid" => 360200,
        "code" => 360281,
        "mark" => "江西省景德镇市乐平市"
    ],
    [
        "name" => "萍乡市",
        "pid" => 360000,
        "code" => 360300,
        "mark" => "江西省萍乡市"
    ],
    [
        "name" => "安源区",
        "pid" => 360300,
        "code" => 360302,
        "mark" => "江西省萍乡市安源区"
    ],
    [
        "name" => "湘东区",
        "pid" => 360300,
        "code" => 360313,
        "mark" => "江西省萍乡市湘东区"
    ],
    [
        "name" => "莲花县",
        "pid" => 360300,
        "code" => 360321,
        "mark" => "江西省萍乡市莲花县"
    ],
    [
        "name" => "上栗县",
        "pid" => 360300,
        "code" => 360322,
        "mark" => "江西省萍乡市上栗县"
    ],
    [
        "name" => "芦溪县",
        "pid" => 360300,
        "code" => 360323,
        "mark" => "江西省萍乡市芦溪县"
    ],
    [
        "name" => "九江市",
        "pid" => 360000,
        "code" => 360400,
        "mark" => "江西省九江市"
    ],
    [
        "name" => "濂溪区",
        "pid" => 360400,
        "code" => 360402,
        "mark" => "江西省九江市濂溪区"
    ],
    [
        "name" => "浔阳区",
        "pid" => 360400,
        "code" => 360403,
        "mark" => "江西省九江市浔阳区"
    ],
    [
        "name" => "九江县",
        "pid" => 360400,
        "code" => 360421,
        "mark" => "江西省九江市九江县"
    ],
    [
        "name" => "武宁县",
        "pid" => 360400,
        "code" => 360423,
        "mark" => "江西省九江市武宁县"
    ],
    [
        "name" => "修水县",
        "pid" => 360400,
        "code" => 360424,
        "mark" => "江西省九江市修水县"
    ],
    [
        "name" => "永修县",
        "pid" => 360400,
        "code" => 360425,
        "mark" => "江西省九江市永修县"
    ],
    [
        "name" => "德安县",
        "pid" => 360400,
        "code" => 360426,
        "mark" => "江西省九江市德安县"
    ],
    [
        "name" => "都昌县",
        "pid" => 360400,
        "code" => 360428,
        "mark" => "江西省九江市都昌县"
    ],
    [
        "name" => "湖口县",
        "pid" => 360400,
        "code" => 360429,
        "mark" => "江西省九江市湖口县"
    ],
    [
        "name" => "彭泽县",
        "pid" => 360400,
        "code" => 360430,
        "mark" => "江西省九江市彭泽县"
    ],
    [
        "name" => "瑞昌市",
        "pid" => 360400,
        "code" => 360481,
        "mark" => "江西省九江市瑞昌市"
    ],
    [
        "name" => "共青城市",
        "pid" => 360400,
        "code" => 360482,
        "mark" => "江西省九江市共青城市"
    ],
    [
        "name" => "庐山市",
        "pid" => 360400,
        "code" => 360483,
        "mark" => "江西省九江市庐山市"
    ],
    [
        "name" => "新余市",
        "pid" => 360000,
        "code" => 360500,
        "mark" => "江西省新余市"
    ],
    [
        "name" => "渝水区",
        "pid" => 360500,
        "code" => 360502,
        "mark" => "江西省新余市渝水区"
    ],
    [
        "name" => "分宜县",
        "pid" => 360500,
        "code" => 360521,
        "mark" => "江西省新余市分宜县"
    ],
    [
        "name" => "鹰潭市",
        "pid" => 360000,
        "code" => 360600,
        "mark" => "江西省鹰潭市"
    ],
    [
        "name" => "月湖区",
        "pid" => 360600,
        "code" => 360602,
        "mark" => "江西省鹰潭市月湖区"
    ],
    [
        "name" => "余江县",
        "pid" => 360600,
        "code" => 360622,
        "mark" => "江西省鹰潭市余江县"
    ],
    [
        "name" => "贵溪市",
        "pid" => 360600,
        "code" => 360681,
        "mark" => "江西省鹰潭市贵溪市"
    ],
    [
        "name" => "赣州市",
        "pid" => 360000,
        "code" => 360700,
        "mark" => "江西省赣州市"
    ],
    [
        "name" => "章贡区",
        "pid" => 360700,
        "code" => 360702,
        "mark" => "江西省赣州市章贡区"
    ],
    [
        "name" => "南康区",
        "pid" => 360700,
        "code" => 360703,
        "mark" => "江西省赣州市南康区"
    ],
    [
        "name" => "赣县",
        "pid" => 360700,
        "code" => 360721,
        "mark" => "江西省赣州市赣县"
    ],
    [
        "name" => "信丰县",
        "pid" => 360700,
        "code" => 360722,
        "mark" => "江西省赣州市信丰县"
    ],
    [
        "name" => "大余县",
        "pid" => 360700,
        "code" => 360723,
        "mark" => "江西省赣州市大余县"
    ],
    [
        "name" => "上犹县",
        "pid" => 360700,
        "code" => 360724,
        "mark" => "江西省赣州市上犹县"
    ],
    [
        "name" => "崇义县",
        "pid" => 360700,
        "code" => 360725,
        "mark" => "江西省赣州市崇义县"
    ],
    [
        "name" => "安远县",
        "pid" => 360700,
        "code" => 360726,
        "mark" => "江西省赣州市安远县"
    ],
    [
        "name" => "龙南县",
        "pid" => 360700,
        "code" => 360727,
        "mark" => "江西省赣州市龙南县"
    ],
    [
        "name" => "定南县",
        "pid" => 360700,
        "code" => 360728,
        "mark" => "江西省赣州市定南县"
    ],
    [
        "name" => "全南县",
        "pid" => 360700,
        "code" => 360729,
        "mark" => "江西省赣州市全南县"
    ],
    [
        "name" => "宁都县",
        "pid" => 360700,
        "code" => 360730,
        "mark" => "江西省赣州市宁都县"
    ],
    [
        "name" => "于都县",
        "pid" => 360700,
        "code" => 360731,
        "mark" => "江西省赣州市于都县"
    ],
    [
        "name" => "兴国县",
        "pid" => 360700,
        "code" => 360732,
        "mark" => "江西省赣州市兴国县"
    ],
    [
        "name" => "会昌县",
        "pid" => 360700,
        "code" => 360733,
        "mark" => "江西省赣州市会昌县"
    ],
    [
        "name" => "寻乌县",
        "pid" => 360700,
        "code" => 360734,
        "mark" => "江西省赣州市寻乌县"
    ],
    [
        "name" => "石城县",
        "pid" => 360700,
        "code" => 360735,
        "mark" => "江西省赣州市石城县"
    ],
    [
        "name" => "瑞金市",
        "pid" => 360700,
        "code" => 360781,
        "mark" => "江西省赣州市瑞金市"
    ],
    [
        "name" => "吉安市",
        "pid" => 360000,
        "code" => 360800,
        "mark" => "江西省吉安市"
    ],
    [
        "name" => "吉州区",
        "pid" => 360800,
        "code" => 360802,
        "mark" => "江西省吉安市吉州区"
    ],
    [
        "name" => "青原区",
        "pid" => 360800,
        "code" => 360803,
        "mark" => "江西省吉安市青原区"
    ],
    [
        "name" => "吉安县",
        "pid" => 360800,
        "code" => 360821,
        "mark" => "江西省吉安市吉安县"
    ],
    [
        "name" => "吉水县",
        "pid" => 360800,
        "code" => 360822,
        "mark" => "江西省吉安市吉水县"
    ],
    [
        "name" => "峡江县",
        "pid" => 360800,
        "code" => 360823,
        "mark" => "江西省吉安市峡江县"
    ],
    [
        "name" => "新干县",
        "pid" => 360800,
        "code" => 360824,
        "mark" => "江西省吉安市新干县"
    ],
    [
        "name" => "永丰县",
        "pid" => 360800,
        "code" => 360825,
        "mark" => "江西省吉安市永丰县"
    ],
    [
        "name" => "泰和县",
        "pid" => 360800,
        "code" => 360826,
        "mark" => "江西省吉安市泰和县"
    ],
    [
        "name" => "遂川县",
        "pid" => 360800,
        "code" => 360827,
        "mark" => "江西省吉安市遂川县"
    ],
    [
        "name" => "万安县",
        "pid" => 360800,
        "code" => 360828,
        "mark" => "江西省吉安市万安县"
    ],
    [
        "name" => "安福县",
        "pid" => 360800,
        "code" => 360829,
        "mark" => "江西省吉安市安福县"
    ],
    [
        "name" => "永新县",
        "pid" => 360800,
        "code" => 360830,
        "mark" => "江西省吉安市永新县"
    ],
    [
        "name" => "井冈山市",
        "pid" => 360800,
        "code" => 360881,
        "mark" => "江西省吉安市井冈山市"
    ],
    [
        "name" => "宜春市",
        "pid" => 360000,
        "code" => 360900,
        "mark" => "江西省宜春市"
    ],
    [
        "name" => "袁州区",
        "pid" => 360900,
        "code" => 360902,
        "mark" => "江西省宜春市袁州区"
    ],
    [
        "name" => "奉新县",
        "pid" => 360900,
        "code" => 360921,
        "mark" => "江西省宜春市奉新县"
    ],
    [
        "name" => "万载县",
        "pid" => 360900,
        "code" => 360922,
        "mark" => "江西省宜春市万载县"
    ],
    [
        "name" => "上高县",
        "pid" => 360900,
        "code" => 360923,
        "mark" => "江西省宜春市上高县"
    ],
    [
        "name" => "宜丰县",
        "pid" => 360900,
        "code" => 360924,
        "mark" => "江西省宜春市宜丰县"
    ],
    [
        "name" => "靖安县",
        "pid" => 360900,
        "code" => 360925,
        "mark" => "江西省宜春市靖安县"
    ],
    [
        "name" => "铜鼓县",
        "pid" => 360900,
        "code" => 360926,
        "mark" => "江西省宜春市铜鼓县"
    ],
    [
        "name" => "丰城市",
        "pid" => 360900,
        "code" => 360981,
        "mark" => "江西省宜春市丰城市"
    ],
    [
        "name" => "樟树市",
        "pid" => 360900,
        "code" => 360982,
        "mark" => "江西省宜春市樟树市"
    ],
    [
        "name" => "高安市",
        "pid" => 360900,
        "code" => 360983,
        "mark" => "江西省宜春市高安市"
    ],
    [
        "name" => "抚州市",
        "pid" => 360000,
        "code" => 361000,
        "mark" => "江西省抚州市"
    ],
    [
        "name" => "临川区",
        "pid" => 361000,
        "code" => 361002,
        "mark" => "江西省抚州市临川区"
    ],
    [
        "name" => "南城县",
        "pid" => 361000,
        "code" => 361021,
        "mark" => "江西省抚州市南城县"
    ],
    [
        "name" => "黎川县",
        "pid" => 361000,
        "code" => 361022,
        "mark" => "江西省抚州市黎川县"
    ],
    [
        "name" => "南丰县",
        "pid" => 361000,
        "code" => 361023,
        "mark" => "江西省抚州市南丰县"
    ],
    [
        "name" => "崇仁县",
        "pid" => 361000,
        "code" => 361024,
        "mark" => "江西省抚州市崇仁县"
    ],
    [
        "name" => "乐安县",
        "pid" => 361000,
        "code" => 361025,
        "mark" => "江西省抚州市乐安县"
    ],
    [
        "name" => "宜黄县",
        "pid" => 361000,
        "code" => 361026,
        "mark" => "江西省抚州市宜黄县"
    ],
    [
        "name" => "金溪县",
        "pid" => 361000,
        "code" => 361027,
        "mark" => "江西省抚州市金溪县"
    ],
    [
        "name" => "资溪县",
        "pid" => 361000,
        "code" => 361028,
        "mark" => "江西省抚州市资溪县"
    ],
    [
        "name" => "东乡县",
        "pid" => 361000,
        "code" => 361029,
        "mark" => "江西省抚州市东乡县"
    ],
    [
        "name" => "广昌县",
        "pid" => 361000,
        "code" => 361030,
        "mark" => "江西省抚州市广昌县"
    ],
    [
        "name" => "上饶市",
        "pid" => 360000,
        "code" => 361100,
        "mark" => "江西省上饶市"
    ],
    [
        "name" => "信州区",
        "pid" => 361100,
        "code" => 361102,
        "mark" => "江西省上饶市信州区"
    ],
    [
        "name" => "广丰区",
        "pid" => 361100,
        "code" => 361103,
        "mark" => "江西省上饶市广丰区"
    ],
    [
        "name" => "上饶县",
        "pid" => 361100,
        "code" => 361121,
        "mark" => "江西省上饶市上饶县"
    ],
    [
        "name" => "玉山县",
        "pid" => 361100,
        "code" => 361123,
        "mark" => "江西省上饶市玉山县"
    ],
    [
        "name" => "铅山县",
        "pid" => 361100,
        "code" => 361124,
        "mark" => "江西省上饶市铅山县"
    ],
    [
        "name" => "横峰县",
        "pid" => 361100,
        "code" => 361125,
        "mark" => "江西省上饶市横峰县"
    ],
    [
        "name" => "弋阳县",
        "pid" => 361100,
        "code" => 361126,
        "mark" => "江西省上饶市弋阳县"
    ],
    [
        "name" => "余干县",
        "pid" => 361100,
        "code" => 361127,
        "mark" => "江西省上饶市余干县"
    ],
    [
        "name" => "鄱阳县",
        "pid" => 361100,
        "code" => 361128,
        "mark" => "江西省上饶市鄱阳县"
    ],
    [
        "name" => "万年县",
        "pid" => 361100,
        "code" => 361129,
        "mark" => "江西省上饶市万年县"
    ],
    [
        "name" => "婺源县",
        "pid" => 361100,
        "code" => 361130,
        "mark" => "江西省上饶市婺源县"
    ],
    [
        "name" => "德兴市",
        "pid" => 361100,
        "code" => 361181,
        "mark" => "江西省上饶市德兴市"
    ],
    [
        "name" => "山东省",
        "pid" => 86,
        "code" => 370000,
        "mark" => "山东省"
    ],
    [
        "name" => "济南市",
        "pid" => 370000,
        "code" => 370100,
        "mark" => "山东省济南市"
    ],
    [
        "name" => "历下区",
        "pid" => 370100,
        "code" => 370102,
        "mark" => "山东省济南市历下区"
    ],
    [
        "name" => "市中区",
        "pid" => 370100,
        "code" => 370103,
        "mark" => "山东省济南市市中区"
    ],
    [
        "name" => "槐荫区",
        "pid" => 370100,
        "code" => 370104,
        "mark" => "山东省济南市槐荫区"
    ],
    [
        "name" => "天桥区",
        "pid" => 370100,
        "code" => 370105,
        "mark" => "山东省济南市天桥区"
    ],
    [
        "name" => "历城区",
        "pid" => 370100,
        "code" => 370112,
        "mark" => "山东省济南市历城区"
    ],
    [
        "name" => "长清区",
        "pid" => 370100,
        "code" => 370113,
        "mark" => "山东省济南市长清区"
    ],
    [
        "name" => "平阴县",
        "pid" => 370100,
        "code" => 370124,
        "mark" => "山东省济南市平阴县"
    ],
    [
        "name" => "济阳县",
        "pid" => 370100,
        "code" => 370125,
        "mark" => "山东省济南市济阳县"
    ],
    [
        "name" => "商河县",
        "pid" => 370100,
        "code" => 370126,
        "mark" => "山东省济南市商河县"
    ],
    [
        "name" => "章丘市",
        "pid" => 370100,
        "code" => 370181,
        "mark" => "山东省济南市章丘市"
    ],
    [
        "name" => "青岛市",
        "pid" => 370000,
        "code" => 370200,
        "mark" => "山东省青岛市"
    ],
    [
        "name" => "市南区",
        "pid" => 370200,
        "code" => 370202,
        "mark" => "山东省青岛市市南区"
    ],
    [
        "name" => "市北区",
        "pid" => 370200,
        "code" => 370203,
        "mark" => "山东省青岛市市北区"
    ],
    [
        "name" => "黄岛区",
        "pid" => 370200,
        "code" => 370211,
        "mark" => "山东省青岛市黄岛区"
    ],
    [
        "name" => "崂山区",
        "pid" => 370200,
        "code" => 370212,
        "mark" => "山东省青岛市崂山区"
    ],
    [
        "name" => "李沧区",
        "pid" => 370200,
        "code" => 370213,
        "mark" => "山东省青岛市李沧区"
    ],
    [
        "name" => "城阳区",
        "pid" => 370200,
        "code" => 370214,
        "mark" => "山东省青岛市城阳区"
    ],
    [
        "name" => "胶州市",
        "pid" => 370200,
        "code" => 370281,
        "mark" => "山东省青岛市胶州市"
    ],
    [
        "name" => "即墨市",
        "pid" => 370200,
        "code" => 370282,
        "mark" => "山东省青岛市即墨市"
    ],
    [
        "name" => "平度市",
        "pid" => 370200,
        "code" => 370283,
        "mark" => "山东省青岛市平度市"
    ],
    [
        "name" => "莱西市",
        "pid" => 370200,
        "code" => 370285,
        "mark" => "山东省青岛市莱西市"
    ],
    [
        "name" => "淄博市",
        "pid" => 370000,
        "code" => 370300,
        "mark" => "山东省淄博市"
    ],
    [
        "name" => "淄川区",
        "pid" => 370300,
        "code" => 370302,
        "mark" => "山东省淄博市淄川区"
    ],
    [
        "name" => "张店区",
        "pid" => 370300,
        "code" => 370303,
        "mark" => "山东省淄博市张店区"
    ],
    [
        "name" => "博山区",
        "pid" => 370300,
        "code" => 370304,
        "mark" => "山东省淄博市博山区"
    ],
    [
        "name" => "临淄区",
        "pid" => 370300,
        "code" => 370305,
        "mark" => "山东省淄博市临淄区"
    ],
    [
        "name" => "周村区",
        "pid" => 370300,
        "code" => 370306,
        "mark" => "山东省淄博市周村区"
    ],
    [
        "name" => "桓台县",
        "pid" => 370300,
        "code" => 370321,
        "mark" => "山东省淄博市桓台县"
    ],
    [
        "name" => "高青县",
        "pid" => 370300,
        "code" => 370322,
        "mark" => "山东省淄博市高青县"
    ],
    [
        "name" => "沂源县",
        "pid" => 370300,
        "code" => 370323,
        "mark" => "山东省淄博市沂源县"
    ],
    [
        "name" => "枣庄市",
        "pid" => 370000,
        "code" => 370400,
        "mark" => "山东省枣庄市"
    ],
    [
        "name" => "市中区",
        "pid" => 370400,
        "code" => 370402,
        "mark" => "山东省枣庄市市中区"
    ],
    [
        "name" => "薛城区",
        "pid" => 370400,
        "code" => 370403,
        "mark" => "山东省枣庄市薛城区"
    ],
    [
        "name" => "峄城区",
        "pid" => 370400,
        "code" => 370404,
        "mark" => "山东省枣庄市峄城区"
    ],
    [
        "name" => "台儿庄区",
        "pid" => 370400,
        "code" => 370405,
        "mark" => "山东省枣庄市台儿庄区"
    ],
    [
        "name" => "山亭区",
        "pid" => 370400,
        "code" => 370406,
        "mark" => "山东省枣庄市山亭区"
    ],
    [
        "name" => "滕州市",
        "pid" => 370400,
        "code" => 370481,
        "mark" => "山东省枣庄市滕州市"
    ],
    [
        "name" => "东营市",
        "pid" => 370000,
        "code" => 370500,
        "mark" => "山东省东营市"
    ],
    [
        "name" => "东营区",
        "pid" => 370500,
        "code" => 370502,
        "mark" => "山东省东营市东营区"
    ],
    [
        "name" => "河口区",
        "pid" => 370500,
        "code" => 370503,
        "mark" => "山东省东营市河口区"
    ],
    [
        "name" => "垦利区",
        "pid" => 370500,
        "code" => 370505,
        "mark" => "山东省东营市垦利区"
    ],
    [
        "name" => "利津县",
        "pid" => 370500,
        "code" => 370522,
        "mark" => "山东省东营市利津县"
    ],
    [
        "name" => "广饶县",
        "pid" => 370500,
        "code" => 370523,
        "mark" => "山东省东营市广饶县"
    ],
    [
        "name" => "烟台市",
        "pid" => 370000,
        "code" => 370600,
        "mark" => "山东省烟台市"
    ],
    [
        "name" => "芝罘区",
        "pid" => 370600,
        "code" => 370602,
        "mark" => "山东省烟台市芝罘区"
    ],
    [
        "name" => "福山区",
        "pid" => 370600,
        "code" => 370611,
        "mark" => "山东省烟台市福山区"
    ],
    [
        "name" => "牟平区",
        "pid" => 370600,
        "code" => 370612,
        "mark" => "山东省烟台市牟平区"
    ],
    [
        "name" => "莱山区",
        "pid" => 370600,
        "code" => 370613,
        "mark" => "山东省烟台市莱山区"
    ],
    [
        "name" => "长岛县",
        "pid" => 370600,
        "code" => 370634,
        "mark" => "山东省烟台市长岛县"
    ],
    [
        "name" => "龙口市",
        "pid" => 370600,
        "code" => 370681,
        "mark" => "山东省烟台市龙口市"
    ],
    [
        "name" => "莱阳市",
        "pid" => 370600,
        "code" => 370682,
        "mark" => "山东省烟台市莱阳市"
    ],
    [
        "name" => "莱州市",
        "pid" => 370600,
        "code" => 370683,
        "mark" => "山东省烟台市莱州市"
    ],
    [
        "name" => "蓬莱市",
        "pid" => 370600,
        "code" => 370684,
        "mark" => "山东省烟台市蓬莱市"
    ],
    [
        "name" => "招远市",
        "pid" => 370600,
        "code" => 370685,
        "mark" => "山东省烟台市招远市"
    ],
    [
        "name" => "栖霞市",
        "pid" => 370600,
        "code" => 370686,
        "mark" => "山东省烟台市栖霞市"
    ],
    [
        "name" => "海阳市",
        "pid" => 370600,
        "code" => 370687,
        "mark" => "山东省烟台市海阳市"
    ],
    [
        "name" => "潍坊市",
        "pid" => 370000,
        "code" => 370700,
        "mark" => "山东省潍坊市"
    ],
    [
        "name" => "潍城区",
        "pid" => 370700,
        "code" => 370702,
        "mark" => "山东省潍坊市潍城区"
    ],
    [
        "name" => "寒亭区",
        "pid" => 370700,
        "code" => 370703,
        "mark" => "山东省潍坊市寒亭区"
    ],
    [
        "name" => "坊子区",
        "pid" => 370700,
        "code" => 370704,
        "mark" => "山东省潍坊市坊子区"
    ],
    [
        "name" => "奎文区",
        "pid" => 370700,
        "code" => 370705,
        "mark" => "山东省潍坊市奎文区"
    ],
    [
        "name" => "临朐县",
        "pid" => 370700,
        "code" => 370724,
        "mark" => "山东省潍坊市临朐县"
    ],
    [
        "name" => "昌乐县",
        "pid" => 370700,
        "code" => 370725,
        "mark" => "山东省潍坊市昌乐县"
    ],
    [
        "name" => "青州市",
        "pid" => 370700,
        "code" => 370781,
        "mark" => "山东省潍坊市青州市"
    ],
    [
        "name" => "诸城市",
        "pid" => 370700,
        "code" => 370782,
        "mark" => "山东省潍坊市诸城市"
    ],
    [
        "name" => "寿光市",
        "pid" => 370700,
        "code" => 370783,
        "mark" => "山东省潍坊市寿光市"
    ],
    [
        "name" => "安丘市",
        "pid" => 370700,
        "code" => 370784,
        "mark" => "山东省潍坊市安丘市"
    ],
    [
        "name" => "高密市",
        "pid" => 370700,
        "code" => 370785,
        "mark" => "山东省潍坊市高密市"
    ],
    [
        "name" => "昌邑市",
        "pid" => 370700,
        "code" => 370786,
        "mark" => "山东省潍坊市昌邑市"
    ],
    [
        "name" => "济宁市",
        "pid" => 370000,
        "code" => 370800,
        "mark" => "山东省济宁市"
    ],
    [
        "name" => "任城区",
        "pid" => 370800,
        "code" => 370811,
        "mark" => "山东省济宁市任城区"
    ],
    [
        "name" => "兖州区",
        "pid" => 370800,
        "code" => 370812,
        "mark" => "山东省济宁市兖州区"
    ],
    [
        "name" => "微山县",
        "pid" => 370800,
        "code" => 370826,
        "mark" => "山东省济宁市微山县"
    ],
    [
        "name" => "鱼台县",
        "pid" => 370800,
        "code" => 370827,
        "mark" => "山东省济宁市鱼台县"
    ],
    [
        "name" => "金乡县",
        "pid" => 370800,
        "code" => 370828,
        "mark" => "山东省济宁市金乡县"
    ],
    [
        "name" => "嘉祥县",
        "pid" => 370800,
        "code" => 370829,
        "mark" => "山东省济宁市嘉祥县"
    ],
    [
        "name" => "汶上县",
        "pid" => 370800,
        "code" => 370830,
        "mark" => "山东省济宁市汶上县"
    ],
    [
        "name" => "泗水县",
        "pid" => 370800,
        "code" => 370831,
        "mark" => "山东省济宁市泗水县"
    ],
    [
        "name" => "梁山县",
        "pid" => 370800,
        "code" => 370832,
        "mark" => "山东省济宁市梁山县"
    ],
    [
        "name" => "曲阜市",
        "pid" => 370800,
        "code" => 370881,
        "mark" => "山东省济宁市曲阜市"
    ],
    [
        "name" => "邹城市",
        "pid" => 370800,
        "code" => 370883,
        "mark" => "山东省济宁市邹城市"
    ],
    [
        "name" => "泰安市",
        "pid" => 370000,
        "code" => 370900,
        "mark" => "山东省泰安市"
    ],
    [
        "name" => "泰山区",
        "pid" => 370900,
        "code" => 370902,
        "mark" => "山东省泰安市泰山区"
    ],
    [
        "name" => "岱岳区",
        "pid" => 370900,
        "code" => 370911,
        "mark" => "山东省泰安市岱岳区"
    ],
    [
        "name" => "宁阳县",
        "pid" => 370900,
        "code" => 370921,
        "mark" => "山东省泰安市宁阳县"
    ],
    [
        "name" => "东平县",
        "pid" => 370900,
        "code" => 370923,
        "mark" => "山东省泰安市东平县"
    ],
    [
        "name" => "新泰市",
        "pid" => 370900,
        "code" => 370982,
        "mark" => "山东省泰安市新泰市"
    ],
    [
        "name" => "肥城市",
        "pid" => 370900,
        "code" => 370983,
        "mark" => "山东省泰安市肥城市"
    ],
    [
        "name" => "威海市",
        "pid" => 370000,
        "code" => 371000,
        "mark" => "山东省威海市"
    ],
    [
        "name" => "环翠区",
        "pid" => 371000,
        "code" => 371002,
        "mark" => "山东省威海市环翠区"
    ],
    [
        "name" => "文登区",
        "pid" => 371000,
        "code" => 371003,
        "mark" => "山东省威海市文登区"
    ],
    [
        "name" => "荣成市",
        "pid" => 371000,
        "code" => 371082,
        "mark" => "山东省威海市荣成市"
    ],
    [
        "name" => "乳山市",
        "pid" => 371000,
        "code" => 371083,
        "mark" => "山东省威海市乳山市"
    ],
    [
        "name" => "日照市",
        "pid" => 370000,
        "code" => 371100,
        "mark" => "山东省日照市"
    ],
    [
        "name" => "东港区",
        "pid" => 371100,
        "code" => 371102,
        "mark" => "山东省日照市东港区"
    ],
    [
        "name" => "岚山区",
        "pid" => 371100,
        "code" => 371103,
        "mark" => "山东省日照市岚山区"
    ],
    [
        "name" => "五莲县",
        "pid" => 371100,
        "code" => 371121,
        "mark" => "山东省日照市五莲县"
    ],
    [
        "name" => "莒县",
        "pid" => 371100,
        "code" => 371122,
        "mark" => "山东省日照市莒县"
    ],
    [
        "name" => "莱芜市",
        "pid" => 370000,
        "code" => 371200,
        "mark" => "山东省莱芜市"
    ],
    [
        "name" => "莱城区",
        "pid" => 371200,
        "code" => 371202,
        "mark" => "山东省莱芜市莱城区"
    ],
    [
        "name" => "钢城区",
        "pid" => 371200,
        "code" => 371203,
        "mark" => "山东省莱芜市钢城区"
    ],
    [
        "name" => "临沂市",
        "pid" => 370000,
        "code" => 371300,
        "mark" => "山东省临沂市"
    ],
    [
        "name" => "兰山区",
        "pid" => 371300,
        "code" => 371302,
        "mark" => "山东省临沂市兰山区"
    ],
    [
        "name" => "罗庄区",
        "pid" => 371300,
        "code" => 371311,
        "mark" => "山东省临沂市罗庄区"
    ],
    [
        "name" => "河东区",
        "pid" => 371300,
        "code" => 371312,
        "mark" => "山东省临沂市河东区"
    ],
    [
        "name" => "沂南县",
        "pid" => 371300,
        "code" => 371321,
        "mark" => "山东省临沂市沂南县"
    ],
    [
        "name" => "郯城县",
        "pid" => 371300,
        "code" => 371322,
        "mark" => "山东省临沂市郯城县"
    ],
    [
        "name" => "沂水县",
        "pid" => 371300,
        "code" => 371323,
        "mark" => "山东省临沂市沂水县"
    ],
    [
        "name" => "兰陵县",
        "pid" => 371300,
        "code" => 371324,
        "mark" => "山东省临沂市兰陵县"
    ],
    [
        "name" => "费县",
        "pid" => 371300,
        "code" => 371325,
        "mark" => "山东省临沂市费县"
    ],
    [
        "name" => "平邑县",
        "pid" => 371300,
        "code" => 371326,
        "mark" => "山东省临沂市平邑县"
    ],
    [
        "name" => "莒南县",
        "pid" => 371300,
        "code" => 371327,
        "mark" => "山东省临沂市莒南县"
    ],
    [
        "name" => "蒙阴县",
        "pid" => 371300,
        "code" => 371328,
        "mark" => "山东省临沂市蒙阴县"
    ],
    [
        "name" => "临沭县",
        "pid" => 371300,
        "code" => 371329,
        "mark" => "山东省临沂市临沭县"
    ],
    [
        "name" => "德州市",
        "pid" => 370000,
        "code" => 371400,
        "mark" => "山东省德州市"
    ],
    [
        "name" => "德城区",
        "pid" => 371400,
        "code" => 371402,
        "mark" => "山东省德州市德城区"
    ],
    [
        "name" => "陵城区",
        "pid" => 371400,
        "code" => 371403,
        "mark" => "山东省德州市陵城区"
    ],
    [
        "name" => "宁津县",
        "pid" => 371400,
        "code" => 371422,
        "mark" => "山东省德州市宁津县"
    ],
    [
        "name" => "庆云县",
        "pid" => 371400,
        "code" => 371423,
        "mark" => "山东省德州市庆云县"
    ],
    [
        "name" => "临邑县",
        "pid" => 371400,
        "code" => 371424,
        "mark" => "山东省德州市临邑县"
    ],
    [
        "name" => "齐河县",
        "pid" => 371400,
        "code" => 371425,
        "mark" => "山东省德州市齐河县"
    ],
    [
        "name" => "平原县",
        "pid" => 371400,
        "code" => 371426,
        "mark" => "山东省德州市平原县"
    ],
    [
        "name" => "夏津县",
        "pid" => 371400,
        "code" => 371427,
        "mark" => "山东省德州市夏津县"
    ],
    [
        "name" => "武城县",
        "pid" => 371400,
        "code" => 371428,
        "mark" => "山东省德州市武城县"
    ],
    [
        "name" => "乐陵市",
        "pid" => 371400,
        "code" => 371481,
        "mark" => "山东省德州市乐陵市"
    ],
    [
        "name" => "禹城市",
        "pid" => 371400,
        "code" => 371482,
        "mark" => "山东省德州市禹城市"
    ],
    [
        "name" => "聊城市",
        "pid" => 370000,
        "code" => 371500,
        "mark" => "山东省聊城市"
    ],
    [
        "name" => "东昌府区",
        "pid" => 371500,
        "code" => 371502,
        "mark" => "山东省聊城市东昌府区"
    ],
    [
        "name" => "阳谷县",
        "pid" => 371500,
        "code" => 371521,
        "mark" => "山东省聊城市阳谷县"
    ],
    [
        "name" => "莘县",
        "pid" => 371500,
        "code" => 371522,
        "mark" => "山东省聊城市莘县"
    ],
    [
        "name" => "茌平县",
        "pid" => 371500,
        "code" => 371523,
        "mark" => "山东省聊城市茌平县"
    ],
    [
        "name" => "东阿县",
        "pid" => 371500,
        "code" => 371524,
        "mark" => "山东省聊城市东阿县"
    ],
    [
        "name" => "冠县",
        "pid" => 371500,
        "code" => 371525,
        "mark" => "山东省聊城市冠县"
    ],
    [
        "name" => "高唐县",
        "pid" => 371500,
        "code" => 371526,
        "mark" => "山东省聊城市高唐县"
    ],
    [
        "name" => "临清市",
        "pid" => 371500,
        "code" => 371581,
        "mark" => "山东省聊城市临清市"
    ],
    [
        "name" => "滨州市",
        "pid" => 370000,
        "code" => 371600,
        "mark" => "山东省滨州市"
    ],
    [
        "name" => "滨城区",
        "pid" => 371600,
        "code" => 371602,
        "mark" => "山东省滨州市滨城区"
    ],
    [
        "name" => "沾化区",
        "pid" => 371600,
        "code" => 371603,
        "mark" => "山东省滨州市沾化区"
    ],
    [
        "name" => "惠民县",
        "pid" => 371600,
        "code" => 371621,
        "mark" => "山东省滨州市惠民县"
    ],
    [
        "name" => "阳信县",
        "pid" => 371600,
        "code" => 371622,
        "mark" => "山东省滨州市阳信县"
    ],
    [
        "name" => "无棣县",
        "pid" => 371600,
        "code" => 371623,
        "mark" => "山东省滨州市无棣县"
    ],
    [
        "name" => "博兴县",
        "pid" => 371600,
        "code" => 371625,
        "mark" => "山东省滨州市博兴县"
    ],
    [
        "name" => "邹平县",
        "pid" => 371600,
        "code" => 371626,
        "mark" => "山东省滨州市邹平县"
    ],
    [
        "name" => "菏泽市",
        "pid" => 370000,
        "code" => 371700,
        "mark" => "山东省菏泽市"
    ],
    [
        "name" => "牡丹区",
        "pid" => 371700,
        "code" => 371702,
        "mark" => "山东省菏泽市牡丹区"
    ],
    [
        "name" => "定陶区",
        "pid" => 371700,
        "code" => 371703,
        "mark" => "山东省菏泽市定陶区"
    ],
    [
        "name" => "曹县",
        "pid" => 371700,
        "code" => 371721,
        "mark" => "山东省菏泽市曹县"
    ],
    [
        "name" => "单县",
        "pid" => 371700,
        "code" => 371722,
        "mark" => "山东省菏泽市单县"
    ],
    [
        "name" => "成武县",
        "pid" => 371700,
        "code" => 371723,
        "mark" => "山东省菏泽市成武县"
    ],
    [
        "name" => "巨野县",
        "pid" => 371700,
        "code" => 371724,
        "mark" => "山东省菏泽市巨野县"
    ],
    [
        "name" => "郓城县",
        "pid" => 371700,
        "code" => 371725,
        "mark" => "山东省菏泽市郓城县"
    ],
    [
        "name" => "鄄城县",
        "pid" => 371700,
        "code" => 371726,
        "mark" => "山东省菏泽市鄄城县"
    ],
    [
        "name" => "东明县",
        "pid" => 371700,
        "code" => 371728,
        "mark" => "山东省菏泽市东明县"
    ],
    [
        "name" => "河南省",
        "pid" => 86,
        "code" => 410000,
        "mark" => "河南省"
    ],
    [
        "name" => "郑州市",
        "pid" => 410000,
        "code" => 410100,
        "mark" => "河南省郑州市"
    ],
    [
        "name" => "中原区",
        "pid" => 410100,
        "code" => 410102,
        "mark" => "河南省郑州市中原区"
    ],
    [
        "name" => "二七区",
        "pid" => 410100,
        "code" => 410103,
        "mark" => "河南省郑州市二七区"
    ],
    [
        "name" => "管城回族区",
        "pid" => 410100,
        "code" => 410104,
        "mark" => "河南省郑州市管城回族区"
    ],
    [
        "name" => "金水区",
        "pid" => 410100,
        "code" => 410105,
        "mark" => "河南省郑州市金水区"
    ],
    [
        "name" => "上街区",
        "pid" => 410100,
        "code" => 410106,
        "mark" => "河南省郑州市上街区"
    ],
    [
        "name" => "惠济区",
        "pid" => 410100,
        "code" => 410108,
        "mark" => "河南省郑州市惠济区"
    ],
    [
        "name" => "中牟县",
        "pid" => 410100,
        "code" => 410122,
        "mark" => "河南省郑州市中牟县"
    ],
    [
        "name" => "巩义市",
        "pid" => 410100,
        "code" => 410181,
        "mark" => "河南省郑州市巩义市"
    ],
    [
        "name" => "荥阳市",
        "pid" => 410100,
        "code" => 410182,
        "mark" => "河南省郑州市荥阳市"
    ],
    [
        "name" => "新密市",
        "pid" => 410100,
        "code" => 410183,
        "mark" => "河南省郑州市新密市"
    ],
    [
        "name" => "新郑市",
        "pid" => 410100,
        "code" => 410184,
        "mark" => "河南省郑州市新郑市"
    ],
    [
        "name" => "登封市",
        "pid" => 410100,
        "code" => 410185,
        "mark" => "河南省郑州市登封市"
    ],
    [
        "name" => "开封市",
        "pid" => 410000,
        "code" => 410200,
        "mark" => "河南省开封市"
    ],
    [
        "name" => "龙亭区",
        "pid" => 410200,
        "code" => 410202,
        "mark" => "河南省开封市龙亭区"
    ],
    [
        "name" => "顺河回族区",
        "pid" => 410200,
        "code" => 410203,
        "mark" => "河南省开封市顺河回族区"
    ],
    [
        "name" => "鼓楼区",
        "pid" => 410200,
        "code" => 410204,
        "mark" => "河南省开封市鼓楼区"
    ],
    [
        "name" => "禹王台区",
        "pid" => 410200,
        "code" => 410205,
        "mark" => "河南省开封市禹王台区"
    ],
    [
        "name" => "金明区",
        "pid" => 410200,
        "code" => 410211,
        "mark" => "河南省开封市金明区"
    ],
    [
        "name" => "祥符区",
        "pid" => 410200,
        "code" => 410212,
        "mark" => "河南省开封市祥符区"
    ],
    [
        "name" => "杞县",
        "pid" => 410200,
        "code" => 410221,
        "mark" => "河南省开封市杞县"
    ],
    [
        "name" => "通许县",
        "pid" => 410200,
        "code" => 410222,
        "mark" => "河南省开封市通许县"
    ],
    [
        "name" => "尉氏县",
        "pid" => 410200,
        "code" => 410223,
        "mark" => "河南省开封市尉氏县"
    ],
    [
        "name" => "兰考县",
        "pid" => 410200,
        "code" => 410225,
        "mark" => "河南省开封市兰考县"
    ],
    [
        "name" => "洛阳市",
        "pid" => 410000,
        "code" => 410300,
        "mark" => "河南省洛阳市"
    ],
    [
        "name" => "老城区",
        "pid" => 410300,
        "code" => 410302,
        "mark" => "河南省洛阳市老城区"
    ],
    [
        "name" => "西工区",
        "pid" => 410300,
        "code" => 410303,
        "mark" => "河南省洛阳市西工区"
    ],
    [
        "name" => "瀍河回族区",
        "pid" => 410300,
        "code" => 410304,
        "mark" => "河南省洛阳市瀍河回族区"
    ],
    [
        "name" => "涧西区",
        "pid" => 410300,
        "code" => 410305,
        "mark" => "河南省洛阳市涧西区"
    ],
    [
        "name" => "吉利区",
        "pid" => 410300,
        "code" => 410306,
        "mark" => "河南省洛阳市吉利区"
    ],
    [
        "name" => "洛龙区",
        "pid" => 410300,
        "code" => 410311,
        "mark" => "河南省洛阳市洛龙区"
    ],
    [
        "name" => "孟津县",
        "pid" => 410300,
        "code" => 410322,
        "mark" => "河南省洛阳市孟津县"
    ],
    [
        "name" => "新安县",
        "pid" => 410300,
        "code" => 410323,
        "mark" => "河南省洛阳市新安县"
    ],
    [
        "name" => "栾川县",
        "pid" => 410300,
        "code" => 410324,
        "mark" => "河南省洛阳市栾川县"
    ],
    [
        "name" => "嵩县",
        "pid" => 410300,
        "code" => 410325,
        "mark" => "河南省洛阳市嵩县"
    ],
    [
        "name" => "汝阳县",
        "pid" => 410300,
        "code" => 410326,
        "mark" => "河南省洛阳市汝阳县"
    ],
    [
        "name" => "宜阳县",
        "pid" => 410300,
        "code" => 410327,
        "mark" => "河南省洛阳市宜阳县"
    ],
    [
        "name" => "洛宁县",
        "pid" => 410300,
        "code" => 410328,
        "mark" => "河南省洛阳市洛宁县"
    ],
    [
        "name" => "伊川县",
        "pid" => 410300,
        "code" => 410329,
        "mark" => "河南省洛阳市伊川县"
    ],
    [
        "name" => "偃师市",
        "pid" => 410300,
        "code" => 410381,
        "mark" => "河南省洛阳市偃师市"
    ],
    [
        "name" => "平顶山市",
        "pid" => 410000,
        "code" => 410400,
        "mark" => "河南省平顶山市"
    ],
    [
        "name" => "新华区",
        "pid" => 410400,
        "code" => 410402,
        "mark" => "河南省平顶山市新华区"
    ],
    [
        "name" => "卫东区",
        "pid" => 410400,
        "code" => 410403,
        "mark" => "河南省平顶山市卫东区"
    ],
    [
        "name" => "石龙区",
        "pid" => 410400,
        "code" => 410404,
        "mark" => "河南省平顶山市石龙区"
    ],
    [
        "name" => "湛河区",
        "pid" => 410400,
        "code" => 410411,
        "mark" => "河南省平顶山市湛河区"
    ],
    [
        "name" => "宝丰县",
        "pid" => 410400,
        "code" => 410421,
        "mark" => "河南省平顶山市宝丰县"
    ],
    [
        "name" => "叶县",
        "pid" => 410400,
        "code" => 410422,
        "mark" => "河南省平顶山市叶县"
    ],
    [
        "name" => "鲁山县",
        "pid" => 410400,
        "code" => 410423,
        "mark" => "河南省平顶山市鲁山县"
    ],
    [
        "name" => "郏县",
        "pid" => 410400,
        "code" => 410425,
        "mark" => "河南省平顶山市郏县"
    ],
    [
        "name" => "舞钢市",
        "pid" => 410400,
        "code" => 410481,
        "mark" => "河南省平顶山市舞钢市"
    ],
    [
        "name" => "汝州市",
        "pid" => 410400,
        "code" => 410482,
        "mark" => "河南省平顶山市汝州市"
    ],
    [
        "name" => "安阳市",
        "pid" => 410000,
        "code" => 410500,
        "mark" => "河南省安阳市"
    ],
    [
        "name" => "文峰区",
        "pid" => 410500,
        "code" => 410502,
        "mark" => "河南省安阳市文峰区"
    ],
    [
        "name" => "北关区",
        "pid" => 410500,
        "code" => 410503,
        "mark" => "河南省安阳市北关区"
    ],
    [
        "name" => "殷都区",
        "pid" => 410500,
        "code" => 410505,
        "mark" => "河南省安阳市殷都区"
    ],
    [
        "name" => "龙安区",
        "pid" => 410500,
        "code" => 410506,
        "mark" => "河南省安阳市龙安区"
    ],
    [
        "name" => "安阳县",
        "pid" => 410500,
        "code" => 410522,
        "mark" => "河南省安阳市安阳县"
    ],
    [
        "name" => "汤阴县",
        "pid" => 410500,
        "code" => 410523,
        "mark" => "河南省安阳市汤阴县"
    ],
    [
        "name" => "滑县",
        "pid" => 410500,
        "code" => 410526,
        "mark" => "河南省安阳市滑县"
    ],
    [
        "name" => "内黄县",
        "pid" => 410500,
        "code" => 410527,
        "mark" => "河南省安阳市内黄县"
    ],
    [
        "name" => "林州市",
        "pid" => 410500,
        "code" => 410581,
        "mark" => "河南省安阳市林州市"
    ],
    [
        "name" => "鹤壁市",
        "pid" => 410000,
        "code" => 410600,
        "mark" => "河南省鹤壁市"
    ],
    [
        "name" => "鹤山区",
        "pid" => 410600,
        "code" => 410602,
        "mark" => "河南省鹤壁市鹤山区"
    ],
    [
        "name" => "山城区",
        "pid" => 410600,
        "code" => 410603,
        "mark" => "河南省鹤壁市山城区"
    ],
    [
        "name" => "淇滨区",
        "pid" => 410600,
        "code" => 410611,
        "mark" => "河南省鹤壁市淇滨区"
    ],
    [
        "name" => "浚县",
        "pid" => 410600,
        "code" => 410621,
        "mark" => "河南省鹤壁市浚县"
    ],
    [
        "name" => "淇县",
        "pid" => 410600,
        "code" => 410622,
        "mark" => "河南省鹤壁市淇县"
    ],
    [
        "name" => "新乡市",
        "pid" => 410000,
        "code" => 410700,
        "mark" => "河南省新乡市"
    ],
    [
        "name" => "红旗区",
        "pid" => 410700,
        "code" => 410702,
        "mark" => "河南省新乡市红旗区"
    ],
    [
        "name" => "卫滨区",
        "pid" => 410700,
        "code" => 410703,
        "mark" => "河南省新乡市卫滨区"
    ],
    [
        "name" => "凤泉区",
        "pid" => 410700,
        "code" => 410704,
        "mark" => "河南省新乡市凤泉区"
    ],
    [
        "name" => "牧野区",
        "pid" => 410700,
        "code" => 410711,
        "mark" => "河南省新乡市牧野区"
    ],
    [
        "name" => "新乡县",
        "pid" => 410700,
        "code" => 410721,
        "mark" => "河南省新乡市新乡县"
    ],
    [
        "name" => "获嘉县",
        "pid" => 410700,
        "code" => 410724,
        "mark" => "河南省新乡市获嘉县"
    ],
    [
        "name" => "原阳县",
        "pid" => 410700,
        "code" => 410725,
        "mark" => "河南省新乡市原阳县"
    ],
    [
        "name" => "延津县",
        "pid" => 410700,
        "code" => 410726,
        "mark" => "河南省新乡市延津县"
    ],
    [
        "name" => "封丘县",
        "pid" => 410700,
        "code" => 410727,
        "mark" => "河南省新乡市封丘县"
    ],
    [
        "name" => "长垣县",
        "pid" => 410700,
        "code" => 410728,
        "mark" => "河南省新乡市长垣县"
    ],
    [
        "name" => "卫辉市",
        "pid" => 410700,
        "code" => 410781,
        "mark" => "河南省新乡市卫辉市"
    ],
    [
        "name" => "辉县市",
        "pid" => 410700,
        "code" => 410782,
        "mark" => "河南省新乡市辉县市"
    ],
    [
        "name" => "焦作市",
        "pid" => 410000,
        "code" => 410800,
        "mark" => "河南省焦作市"
    ],
    [
        "name" => "解放区",
        "pid" => 410800,
        "code" => 410802,
        "mark" => "河南省焦作市解放区"
    ],
    [
        "name" => "中站区",
        "pid" => 410800,
        "code" => 410803,
        "mark" => "河南省焦作市中站区"
    ],
    [
        "name" => "马村区",
        "pid" => 410800,
        "code" => 410804,
        "mark" => "河南省焦作市马村区"
    ],
    [
        "name" => "山阳区",
        "pid" => 410800,
        "code" => 410811,
        "mark" => "河南省焦作市山阳区"
    ],
    [
        "name" => "修武县",
        "pid" => 410800,
        "code" => 410821,
        "mark" => "河南省焦作市修武县"
    ],
    [
        "name" => "博爱县",
        "pid" => 410800,
        "code" => 410822,
        "mark" => "河南省焦作市博爱县"
    ],
    [
        "name" => "武陟县",
        "pid" => 410800,
        "code" => 410823,
        "mark" => "河南省焦作市武陟县"
    ],
    [
        "name" => "温县",
        "pid" => 410800,
        "code" => 410825,
        "mark" => "河南省焦作市温县"
    ],
    [
        "name" => "沁阳市",
        "pid" => 410800,
        "code" => 410882,
        "mark" => "河南省焦作市沁阳市"
    ],
    [
        "name" => "孟州市",
        "pid" => 410800,
        "code" => 410883,
        "mark" => "河南省焦作市孟州市"
    ],
    [
        "name" => "濮阳市",
        "pid" => 410000,
        "code" => 410900,
        "mark" => "河南省濮阳市"
    ],
    [
        "name" => "华龙区",
        "pid" => 410900,
        "code" => 410902,
        "mark" => "河南省濮阳市华龙区"
    ],
    [
        "name" => "清丰县",
        "pid" => 410900,
        "code" => 410922,
        "mark" => "河南省濮阳市清丰县"
    ],
    [
        "name" => "南乐县",
        "pid" => 410900,
        "code" => 410923,
        "mark" => "河南省濮阳市南乐县"
    ],
    [
        "name" => "范县",
        "pid" => 410900,
        "code" => 410926,
        "mark" => "河南省濮阳市范县"
    ],
    [
        "name" => "台前县",
        "pid" => 410900,
        "code" => 410927,
        "mark" => "河南省濮阳市台前县"
    ],
    [
        "name" => "濮阳县",
        "pid" => 410900,
        "code" => 410928,
        "mark" => "河南省濮阳市濮阳县"
    ],
    [
        "name" => "许昌市",
        "pid" => 410000,
        "code" => 411000,
        "mark" => "河南省许昌市"
    ],
    [
        "name" => "魏都区",
        "pid" => 411000,
        "code" => 411002,
        "mark" => "河南省许昌市魏都区"
    ],
    [
        "name" => "许昌县",
        "pid" => 411000,
        "code" => 411023,
        "mark" => "河南省许昌市许昌县"
    ],
    [
        "name" => "鄢陵县",
        "pid" => 411000,
        "code" => 411024,
        "mark" => "河南省许昌市鄢陵县"
    ],
    [
        "name" => "襄城县",
        "pid" => 411000,
        "code" => 411025,
        "mark" => "河南省许昌市襄城县"
    ],
    [
        "name" => "禹州市",
        "pid" => 411000,
        "code" => 411081,
        "mark" => "河南省许昌市禹州市"
    ],
    [
        "name" => "长葛市",
        "pid" => 411000,
        "code" => 411082,
        "mark" => "河南省许昌市长葛市"
    ],
    [
        "name" => "漯河市",
        "pid" => 410000,
        "code" => 411100,
        "mark" => "河南省漯河市"
    ],
    [
        "name" => "源汇区",
        "pid" => 411100,
        "code" => 411102,
        "mark" => "河南省漯河市源汇区"
    ],
    [
        "name" => "郾城区",
        "pid" => 411100,
        "code" => 411103,
        "mark" => "河南省漯河市郾城区"
    ],
    [
        "name" => "召陵区",
        "pid" => 411100,
        "code" => 411104,
        "mark" => "河南省漯河市召陵区"
    ],
    [
        "name" => "舞阳县",
        "pid" => 411100,
        "code" => 411121,
        "mark" => "河南省漯河市舞阳县"
    ],
    [
        "name" => "临颍县",
        "pid" => 411100,
        "code" => 411122,
        "mark" => "河南省漯河市临颍县"
    ],
    [
        "name" => "三门峡市",
        "pid" => 410000,
        "code" => 411200,
        "mark" => "河南省三门峡市"
    ],
    [
        "name" => "湖滨区",
        "pid" => 411200,
        "code" => 411202,
        "mark" => "河南省三门峡市湖滨区"
    ],
    [
        "name" => "陕州区",
        "pid" => 411200,
        "code" => 411203,
        "mark" => "河南省三门峡市陕州区"
    ],
    [
        "name" => "渑池县",
        "pid" => 411200,
        "code" => 411221,
        "mark" => "河南省三门峡市渑池县"
    ],
    [
        "name" => "卢氏县",
        "pid" => 411200,
        "code" => 411224,
        "mark" => "河南省三门峡市卢氏县"
    ],
    [
        "name" => "义马市",
        "pid" => 411200,
        "code" => 411281,
        "mark" => "河南省三门峡市义马市"
    ],
    [
        "name" => "灵宝市",
        "pid" => 411200,
        "code" => 411282,
        "mark" => "河南省三门峡市灵宝市"
    ],
    [
        "name" => "南阳市",
        "pid" => 410000,
        "code" => 411300,
        "mark" => "河南省南阳市"
    ],
    [
        "name" => "宛城区",
        "pid" => 411300,
        "code" => 411302,
        "mark" => "河南省南阳市宛城区"
    ],
    [
        "name" => "卧龙区",
        "pid" => 411300,
        "code" => 411303,
        "mark" => "河南省南阳市卧龙区"
    ],
    [
        "name" => "南召县",
        "pid" => 411300,
        "code" => 411321,
        "mark" => "河南省南阳市南召县"
    ],
    [
        "name" => "方城县",
        "pid" => 411300,
        "code" => 411322,
        "mark" => "河南省南阳市方城县"
    ],
    [
        "name" => "西峡县",
        "pid" => 411300,
        "code" => 411323,
        "mark" => "河南省南阳市西峡县"
    ],
    [
        "name" => "镇平县",
        "pid" => 411300,
        "code" => 411324,
        "mark" => "河南省南阳市镇平县"
    ],
    [
        "name" => "内乡县",
        "pid" => 411300,
        "code" => 411325,
        "mark" => "河南省南阳市内乡县"
    ],
    [
        "name" => "淅川县",
        "pid" => 411300,
        "code" => 411326,
        "mark" => "河南省南阳市淅川县"
    ],
    [
        "name" => "社旗县",
        "pid" => 411300,
        "code" => 411327,
        "mark" => "河南省南阳市社旗县"
    ],
    [
        "name" => "唐河县",
        "pid" => 411300,
        "code" => 411328,
        "mark" => "河南省南阳市唐河县"
    ],
    [
        "name" => "新野县",
        "pid" => 411300,
        "code" => 411329,
        "mark" => "河南省南阳市新野县"
    ],
    [
        "name" => "桐柏县",
        "pid" => 411300,
        "code" => 411330,
        "mark" => "河南省南阳市桐柏县"
    ],
    [
        "name" => "邓州市",
        "pid" => 411300,
        "code" => 411381,
        "mark" => "河南省南阳市邓州市"
    ],
    [
        "name" => "商丘市",
        "pid" => 410000,
        "code" => 411400,
        "mark" => "河南省商丘市"
    ],
    [
        "name" => "梁园区",
        "pid" => 411400,
        "code" => 411402,
        "mark" => "河南省商丘市梁园区"
    ],
    [
        "name" => "睢阳区",
        "pid" => 411400,
        "code" => 411403,
        "mark" => "河南省商丘市睢阳区"
    ],
    [
        "name" => "民权县",
        "pid" => 411400,
        "code" => 411421,
        "mark" => "河南省商丘市民权县"
    ],
    [
        "name" => "睢县",
        "pid" => 411400,
        "code" => 411422,
        "mark" => "河南省商丘市睢县"
    ],
    [
        "name" => "宁陵县",
        "pid" => 411400,
        "code" => 411423,
        "mark" => "河南省商丘市宁陵县"
    ],
    [
        "name" => "柘城县",
        "pid" => 411400,
        "code" => 411424,
        "mark" => "河南省商丘市柘城县"
    ],
    [
        "name" => "虞城县",
        "pid" => 411400,
        "code" => 411425,
        "mark" => "河南省商丘市虞城县"
    ],
    [
        "name" => "夏邑县",
        "pid" => 411400,
        "code" => 411426,
        "mark" => "河南省商丘市夏邑县"
    ],
    [
        "name" => "永城市",
        "pid" => 411400,
        "code" => 411481,
        "mark" => "河南省商丘市永城市"
    ],
    [
        "name" => "信阳市",
        "pid" => 410000,
        "code" => 411500,
        "mark" => "河南省信阳市"
    ],
    [
        "name" => "浉河区",
        "pid" => 411500,
        "code" => 411502,
        "mark" => "河南省信阳市浉河区"
    ],
    [
        "name" => "平桥区",
        "pid" => 411500,
        "code" => 411503,
        "mark" => "河南省信阳市平桥区"
    ],
    [
        "name" => "罗山县",
        "pid" => 411500,
        "code" => 411521,
        "mark" => "河南省信阳市罗山县"
    ],
    [
        "name" => "光山县",
        "pid" => 411500,
        "code" => 411522,
        "mark" => "河南省信阳市光山县"
    ],
    [
        "name" => "新县",
        "pid" => 411500,
        "code" => 411523,
        "mark" => "河南省信阳市新县"
    ],
    [
        "name" => "商城县",
        "pid" => 411500,
        "code" => 411524,
        "mark" => "河南省信阳市商城县"
    ],
    [
        "name" => "固始县",
        "pid" => 411500,
        "code" => 411525,
        "mark" => "河南省信阳市固始县"
    ],
    [
        "name" => "潢川县",
        "pid" => 411500,
        "code" => 411526,
        "mark" => "河南省信阳市潢川县"
    ],
    [
        "name" => "淮滨县",
        "pid" => 411500,
        "code" => 411527,
        "mark" => "河南省信阳市淮滨县"
    ],
    [
        "name" => "息县",
        "pid" => 411500,
        "code" => 411528,
        "mark" => "河南省信阳市息县"
    ],
    [
        "name" => "周口市",
        "pid" => 410000,
        "code" => 411600,
        "mark" => "河南省周口市"
    ],
    [
        "name" => "川汇区",
        "pid" => 411600,
        "code" => 411602,
        "mark" => "河南省周口市川汇区"
    ],
    [
        "name" => "扶沟县",
        "pid" => 411600,
        "code" => 411621,
        "mark" => "河南省周口市扶沟县"
    ],
    [
        "name" => "西华县",
        "pid" => 411600,
        "code" => 411622,
        "mark" => "河南省周口市西华县"
    ],
    [
        "name" => "商水县",
        "pid" => 411600,
        "code" => 411623,
        "mark" => "河南省周口市商水县"
    ],
    [
        "name" => "沈丘县",
        "pid" => 411600,
        "code" => 411624,
        "mark" => "河南省周口市沈丘县"
    ],
    [
        "name" => "郸城县",
        "pid" => 411600,
        "code" => 411625,
        "mark" => "河南省周口市郸城县"
    ],
    [
        "name" => "淮阳县",
        "pid" => 411600,
        "code" => 411626,
        "mark" => "河南省周口市淮阳县"
    ],
    [
        "name" => "太康县",
        "pid" => 411600,
        "code" => 411627,
        "mark" => "河南省周口市太康县"
    ],
    [
        "name" => "鹿邑县",
        "pid" => 411600,
        "code" => 411628,
        "mark" => "河南省周口市鹿邑县"
    ],
    [
        "name" => "项城市",
        "pid" => 411600,
        "code" => 411681,
        "mark" => "河南省周口市项城市"
    ],
    [
        "name" => "驻马店市",
        "pid" => 410000,
        "code" => 411700,
        "mark" => "河南省驻马店市"
    ],
    [
        "name" => "驿城区",
        "pid" => 411700,
        "code" => 411702,
        "mark" => "河南省驻马店市驿城区"
    ],
    [
        "name" => "西平县",
        "pid" => 411700,
        "code" => 411721,
        "mark" => "河南省驻马店市西平县"
    ],
    [
        "name" => "上蔡县",
        "pid" => 411700,
        "code" => 411722,
        "mark" => "河南省驻马店市上蔡县"
    ],
    [
        "name" => "平舆县",
        "pid" => 411700,
        "code" => 411723,
        "mark" => "河南省驻马店市平舆县"
    ],
    [
        "name" => "正阳县",
        "pid" => 411700,
        "code" => 411724,
        "mark" => "河南省驻马店市正阳县"
    ],
    [
        "name" => "确山县",
        "pid" => 411700,
        "code" => 411725,
        "mark" => "河南省驻马店市确山县"
    ],
    [
        "name" => "泌阳县",
        "pid" => 411700,
        "code" => 411726,
        "mark" => "河南省驻马店市泌阳县"
    ],
    [
        "name" => "汝南县",
        "pid" => 411700,
        "code" => 411727,
        "mark" => "河南省驻马店市汝南县"
    ],
    [
        "name" => "遂平县",
        "pid" => 411700,
        "code" => 411728,
        "mark" => "河南省驻马店市遂平县"
    ],
    [
        "name" => "新蔡县",
        "pid" => 411700,
        "code" => 411729,
        "mark" => "河南省驻马店市新蔡县"
    ],
    [
        "name" => "济源市",
        "pid" => 410000,
        "code" => 419001,
        "mark" => "河南省济源市"
    ],
    [
        "name" => "湖北省",
        "pid" => 86,
        "code" => 420000,
        "mark" => "湖北省"
    ],
    [
        "name" => "武汉市",
        "pid" => 420000,
        "code" => 420100,
        "mark" => "湖北省武汉市"
    ],
    [
        "name" => "江岸区",
        "pid" => 420100,
        "code" => 420102,
        "mark" => "湖北省武汉市江岸区"
    ],
    [
        "name" => "江汉区",
        "pid" => 420100,
        "code" => 420103,
        "mark" => "湖北省武汉市江汉区"
    ],
    [
        "name" => "硚口区",
        "pid" => 420100,
        "code" => 420104,
        "mark" => "湖北省武汉市硚口区"
    ],
    [
        "name" => "汉阳区",
        "pid" => 420100,
        "code" => 420105,
        "mark" => "湖北省武汉市汉阳区"
    ],
    [
        "name" => "武昌区",
        "pid" => 420100,
        "code" => 420106,
        "mark" => "湖北省武汉市武昌区"
    ],
    [
        "name" => "青山区",
        "pid" => 420100,
        "code" => 420107,
        "mark" => "湖北省武汉市青山区"
    ],
    [
        "name" => "洪山区",
        "pid" => 420100,
        "code" => 420111,
        "mark" => "湖北省武汉市洪山区"
    ],
    [
        "name" => "东西湖区",
        "pid" => 420100,
        "code" => 420112,
        "mark" => "湖北省武汉市东西湖区"
    ],
    [
        "name" => "汉南区",
        "pid" => 420100,
        "code" => 420113,
        "mark" => "湖北省武汉市汉南区"
    ],
    [
        "name" => "蔡甸区",
        "pid" => 420100,
        "code" => 420114,
        "mark" => "湖北省武汉市蔡甸区"
    ],
    [
        "name" => "江夏区",
        "pid" => 420100,
        "code" => 420115,
        "mark" => "湖北省武汉市江夏区"
    ],
    [
        "name" => "黄陂区",
        "pid" => 420100,
        "code" => 420116,
        "mark" => "湖北省武汉市黄陂区"
    ],
    [
        "name" => "新洲区",
        "pid" => 420100,
        "code" => 420117,
        "mark" => "湖北省武汉市新洲区"
    ],
    [
        "name" => "黄石市",
        "pid" => 420000,
        "code" => 420200,
        "mark" => "湖北省黄石市"
    ],
    [
        "name" => "黄石港区",
        "pid" => 420200,
        "code" => 420202,
        "mark" => "湖北省黄石市黄石港区"
    ],
    [
        "name" => "西塞山区",
        "pid" => 420200,
        "code" => 420203,
        "mark" => "湖北省黄石市西塞山区"
    ],
    [
        "name" => "下陆区",
        "pid" => 420200,
        "code" => 420204,
        "mark" => "湖北省黄石市下陆区"
    ],
    [
        "name" => "铁山区",
        "pid" => 420200,
        "code" => 420205,
        "mark" => "湖北省黄石市铁山区"
    ],
    [
        "name" => "阳新县",
        "pid" => 420200,
        "code" => 420222,
        "mark" => "湖北省黄石市阳新县"
    ],
    [
        "name" => "大冶市",
        "pid" => 420200,
        "code" => 420281,
        "mark" => "湖北省黄石市大冶市"
    ],
    [
        "name" => "十堰市",
        "pid" => 420000,
        "code" => 420300,
        "mark" => "湖北省十堰市"
    ],
    [
        "name" => "茅箭区",
        "pid" => 420300,
        "code" => 420302,
        "mark" => "湖北省十堰市茅箭区"
    ],
    [
        "name" => "张湾区",
        "pid" => 420300,
        "code" => 420303,
        "mark" => "湖北省十堰市张湾区"
    ],
    [
        "name" => "郧阳区",
        "pid" => 420300,
        "code" => 420304,
        "mark" => "湖北省十堰市郧阳区"
    ],
    [
        "name" => "郧西县",
        "pid" => 420300,
        "code" => 420322,
        "mark" => "湖北省十堰市郧西县"
    ],
    [
        "name" => "竹山县",
        "pid" => 420300,
        "code" => 420323,
        "mark" => "湖北省十堰市竹山县"
    ],
    [
        "name" => "竹溪县",
        "pid" => 420300,
        "code" => 420324,
        "mark" => "湖北省十堰市竹溪县"
    ],
    [
        "name" => "房县",
        "pid" => 420300,
        "code" => 420325,
        "mark" => "湖北省十堰市房县"
    ],
    [
        "name" => "丹江口市",
        "pid" => 420300,
        "code" => 420381,
        "mark" => "湖北省十堰市丹江口市"
    ],
    [
        "name" => "宜昌市",
        "pid" => 420000,
        "code" => 420500,
        "mark" => "湖北省宜昌市"
    ],
    [
        "name" => "西陵区",
        "pid" => 420500,
        "code" => 420502,
        "mark" => "湖北省宜昌市西陵区"
    ],
    [
        "name" => "伍家岗区",
        "pid" => 420500,
        "code" => 420503,
        "mark" => "湖北省宜昌市伍家岗区"
    ],
    [
        "name" => "点军区",
        "pid" => 420500,
        "code" => 420504,
        "mark" => "湖北省宜昌市点军区"
    ],
    [
        "name" => "猇亭区",
        "pid" => 420500,
        "code" => 420505,
        "mark" => "湖北省宜昌市猇亭区"
    ],
    [
        "name" => "夷陵区",
        "pid" => 420500,
        "code" => 420506,
        "mark" => "湖北省宜昌市夷陵区"
    ],
    [
        "name" => "远安县",
        "pid" => 420500,
        "code" => 420525,
        "mark" => "湖北省宜昌市远安县"
    ],
    [
        "name" => "兴山县",
        "pid" => 420500,
        "code" => 420526,
        "mark" => "湖北省宜昌市兴山县"
    ],
    [
        "name" => "秭归县",
        "pid" => 420500,
        "code" => 420527,
        "mark" => "湖北省宜昌市秭归县"
    ],
    [
        "name" => "长阳土家族自治县",
        "pid" => 420500,
        "code" => 420528,
        "mark" => "湖北省宜昌市长阳土家族自治县"
    ],
    [
        "name" => "五峰土家族自治县",
        "pid" => 420500,
        "code" => 420529,
        "mark" => "湖北省宜昌市五峰土家族自治县"
    ],
    [
        "name" => "宜都市",
        "pid" => 420500,
        "code" => 420581,
        "mark" => "湖北省宜昌市宜都市"
    ],
    [
        "name" => "当阳市",
        "pid" => 420500,
        "code" => 420582,
        "mark" => "湖北省宜昌市当阳市"
    ],
    [
        "name" => "枝江市",
        "pid" => 420500,
        "code" => 420583,
        "mark" => "湖北省宜昌市枝江市"
    ],
    [
        "name" => "襄阳市",
        "pid" => 420000,
        "code" => 420600,
        "mark" => "湖北省襄阳市"
    ],
    [
        "name" => "襄城区",
        "pid" => 420600,
        "code" => 420602,
        "mark" => "湖北省襄阳市襄城区"
    ],
    [
        "name" => "樊城区",
        "pid" => 420600,
        "code" => 420606,
        "mark" => "湖北省襄阳市樊城区"
    ],
    [
        "name" => "襄州区",
        "pid" => 420600,
        "code" => 420607,
        "mark" => "湖北省襄阳市襄州区"
    ],
    [
        "name" => "南漳县",
        "pid" => 420600,
        "code" => 420624,
        "mark" => "湖北省襄阳市南漳县"
    ],
    [
        "name" => "谷城县",
        "pid" => 420600,
        "code" => 420625,
        "mark" => "湖北省襄阳市谷城县"
    ],
    [
        "name" => "保康县",
        "pid" => 420600,
        "code" => 420626,
        "mark" => "湖北省襄阳市保康县"
    ],
    [
        "name" => "老河口市",
        "pid" => 420600,
        "code" => 420682,
        "mark" => "湖北省襄阳市老河口市"
    ],
    [
        "name" => "枣阳市",
        "pid" => 420600,
        "code" => 420683,
        "mark" => "湖北省襄阳市枣阳市"
    ],
    [
        "name" => "宜城市",
        "pid" => 420600,
        "code" => 420684,
        "mark" => "湖北省襄阳市宜城市"
    ],
    [
        "name" => "鄂州市",
        "pid" => 420000,
        "code" => 420700,
        "mark" => "湖北省鄂州市"
    ],
    [
        "name" => "梁子湖区",
        "pid" => 420700,
        "code" => 420702,
        "mark" => "湖北省鄂州市梁子湖区"
    ],
    [
        "name" => "华容区",
        "pid" => 420700,
        "code" => 420703,
        "mark" => "湖北省鄂州市华容区"
    ],
    [
        "name" => "鄂城区",
        "pid" => 420700,
        "code" => 420704,
        "mark" => "湖北省鄂州市鄂城区"
    ],
    [
        "name" => "荆门市",
        "pid" => 420000,
        "code" => 420800,
        "mark" => "湖北省荆门市"
    ],
    [
        "name" => "东宝区",
        "pid" => 420800,
        "code" => 420802,
        "mark" => "湖北省荆门市东宝区"
    ],
    [
        "name" => "掇刀区",
        "pid" => 420800,
        "code" => 420804,
        "mark" => "湖北省荆门市掇刀区"
    ],
    [
        "name" => "京山县",
        "pid" => 420800,
        "code" => 420821,
        "mark" => "湖北省荆门市京山县"
    ],
    [
        "name" => "沙洋县",
        "pid" => 420800,
        "code" => 420822,
        "mark" => "湖北省荆门市沙洋县"
    ],
    [
        "name" => "钟祥市",
        "pid" => 420800,
        "code" => 420881,
        "mark" => "湖北省荆门市钟祥市"
    ],
    [
        "name" => "孝感市",
        "pid" => 420000,
        "code" => 420900,
        "mark" => "湖北省孝感市"
    ],
    [
        "name" => "孝南区",
        "pid" => 420900,
        "code" => 420902,
        "mark" => "湖北省孝感市孝南区"
    ],
    [
        "name" => "孝昌县",
        "pid" => 420900,
        "code" => 420921,
        "mark" => "湖北省孝感市孝昌县"
    ],
    [
        "name" => "大悟县",
        "pid" => 420900,
        "code" => 420922,
        "mark" => "湖北省孝感市大悟县"
    ],
    [
        "name" => "云梦县",
        "pid" => 420900,
        "code" => 420923,
        "mark" => "湖北省孝感市云梦县"
    ],
    [
        "name" => "应城市",
        "pid" => 420900,
        "code" => 420981,
        "mark" => "湖北省孝感市应城市"
    ],
    [
        "name" => "安陆市",
        "pid" => 420900,
        "code" => 420982,
        "mark" => "湖北省孝感市安陆市"
    ],
    [
        "name" => "汉川市",
        "pid" => 420900,
        "code" => 420984,
        "mark" => "湖北省孝感市汉川市"
    ],
    [
        "name" => "荆州市",
        "pid" => 420000,
        "code" => 421000,
        "mark" => "湖北省荆州市"
    ],
    [
        "name" => "沙市区",
        "pid" => 421000,
        "code" => 421002,
        "mark" => "湖北省荆州市沙市区"
    ],
    [
        "name" => "荆州区",
        "pid" => 421000,
        "code" => 421003,
        "mark" => "湖北省荆州市荆州区"
    ],
    [
        "name" => "公安县",
        "pid" => 421000,
        "code" => 421022,
        "mark" => "湖北省荆州市公安县"
    ],
    [
        "name" => "监利县",
        "pid" => 421000,
        "code" => 421023,
        "mark" => "湖北省荆州市监利县"
    ],
    [
        "name" => "江陵县",
        "pid" => 421000,
        "code" => 421024,
        "mark" => "湖北省荆州市江陵县"
    ],
    [
        "name" => "石首市",
        "pid" => 421000,
        "code" => 421081,
        "mark" => "湖北省荆州市石首市"
    ],
    [
        "name" => "洪湖市",
        "pid" => 421000,
        "code" => 421083,
        "mark" => "湖北省荆州市洪湖市"
    ],
    [
        "name" => "松滋市",
        "pid" => 421000,
        "code" => 421087,
        "mark" => "湖北省荆州市松滋市"
    ],
    [
        "name" => "黄冈市",
        "pid" => 420000,
        "code" => 421100,
        "mark" => "湖北省黄冈市"
    ],
    [
        "name" => "黄州区",
        "pid" => 421100,
        "code" => 421102,
        "mark" => "湖北省黄冈市黄州区"
    ],
    [
        "name" => "团风县",
        "pid" => 421100,
        "code" => 421121,
        "mark" => "湖北省黄冈市团风县"
    ],
    [
        "name" => "红安县",
        "pid" => 421100,
        "code" => 421122,
        "mark" => "湖北省黄冈市红安县"
    ],
    [
        "name" => "罗田县",
        "pid" => 421100,
        "code" => 421123,
        "mark" => "湖北省黄冈市罗田县"
    ],
    [
        "name" => "英山县",
        "pid" => 421100,
        "code" => 421124,
        "mark" => "湖北省黄冈市英山县"
    ],
    [
        "name" => "浠水县",
        "pid" => 421100,
        "code" => 421125,
        "mark" => "湖北省黄冈市浠水县"
    ],
    [
        "name" => "蕲春县",
        "pid" => 421100,
        "code" => 421126,
        "mark" => "湖北省黄冈市蕲春县"
    ],
    [
        "name" => "黄梅县",
        "pid" => 421100,
        "code" => 421127,
        "mark" => "湖北省黄冈市黄梅县"
    ],
    [
        "name" => "麻城市",
        "pid" => 421100,
        "code" => 421181,
        "mark" => "湖北省黄冈市麻城市"
    ],
    [
        "name" => "武穴市",
        "pid" => 421100,
        "code" => 421182,
        "mark" => "湖北省黄冈市武穴市"
    ],
    [
        "name" => "咸宁市",
        "pid" => 420000,
        "code" => 421200,
        "mark" => "湖北省咸宁市"
    ],
    [
        "name" => "咸安区",
        "pid" => 421200,
        "code" => 421202,
        "mark" => "湖北省咸宁市咸安区"
    ],
    [
        "name" => "嘉鱼县",
        "pid" => 421200,
        "code" => 421221,
        "mark" => "湖北省咸宁市嘉鱼县"
    ],
    [
        "name" => "通城县",
        "pid" => 421200,
        "code" => 421222,
        "mark" => "湖北省咸宁市通城县"
    ],
    [
        "name" => "崇阳县",
        "pid" => 421200,
        "code" => 421223,
        "mark" => "湖北省咸宁市崇阳县"
    ],
    [
        "name" => "通山县",
        "pid" => 421200,
        "code" => 421224,
        "mark" => "湖北省咸宁市通山县"
    ],
    [
        "name" => "赤壁市",
        "pid" => 421200,
        "code" => 421281,
        "mark" => "湖北省咸宁市赤壁市"
    ],
    [
        "name" => "随州市",
        "pid" => 420000,
        "code" => 421300,
        "mark" => "湖北省随州市"
    ],
    [
        "name" => "曾都区",
        "pid" => 421300,
        "code" => 421303,
        "mark" => "湖北省随州市曾都区"
    ],
    [
        "name" => "随县",
        "pid" => 421300,
        "code" => 421321,
        "mark" => "湖北省随州市随县"
    ],
    [
        "name" => "广水市",
        "pid" => 421300,
        "code" => 421381,
        "mark" => "湖北省随州市广水市"
    ],
    [
        "name" => "恩施土家族苗族自治州",
        "pid" => 420000,
        "code" => 422800,
        "mark" => "湖北省恩施土家族苗族自治州"
    ],
    [
        "name" => "恩施市",
        "pid" => 422800,
        "code" => 422801,
        "mark" => "湖北省恩施土家族苗族自治州恩施市"
    ],
    [
        "name" => "利川市",
        "pid" => 422800,
        "code" => 422802,
        "mark" => "湖北省恩施土家族苗族自治州利川市"
    ],
    [
        "name" => "建始县",
        "pid" => 422800,
        "code" => 422822,
        "mark" => "湖北省恩施土家族苗族自治州建始县"
    ],
    [
        "name" => "巴东县",
        "pid" => 422800,
        "code" => 422823,
        "mark" => "湖北省恩施土家族苗族自治州巴东县"
    ],
    [
        "name" => "宣恩县",
        "pid" => 422800,
        "code" => 422825,
        "mark" => "湖北省恩施土家族苗族自治州宣恩县"
    ],
    [
        "name" => "咸丰县",
        "pid" => 422800,
        "code" => 422826,
        "mark" => "湖北省恩施土家族苗族自治州咸丰县"
    ],
    [
        "name" => "来凤县",
        "pid" => 422800,
        "code" => 422827,
        "mark" => "湖北省恩施土家族苗族自治州来凤县"
    ],
    [
        "name" => "鹤峰县",
        "pid" => 422800,
        "code" => 422828,
        "mark" => "湖北省恩施土家族苗族自治州鹤峰县"
    ],
    [
        "name" => "仙桃市",
        "pid" => 420000,
        "code" => 429004,
        "mark" => "湖北省仙桃市"
    ],
    [
        "name" => "潜江市",
        "pid" => 420000,
        "code" => 429005,
        "mark" => "湖北省潜江市"
    ],
    [
        "name" => "天门市",
        "pid" => 420000,
        "code" => 429006,
        "mark" => "湖北省天门市"
    ],
    [
        "name" => "神农架林区",
        "pid" => 420000,
        "code" => 429021,
        "mark" => "湖北省神农架林区"
    ],
    [
        "name" => "湖南省",
        "pid" => 86,
        "code" => 430000,
        "mark" => "湖南省"
    ],
    [
        "name" => "长沙市",
        "pid" => 430000,
        "code" => 430100,
        "mark" => "湖南省长沙市"
    ],
    [
        "name" => "芙蓉区",
        "pid" => 430100,
        "code" => 430102,
        "mark" => "湖南省长沙市芙蓉区"
    ],
    [
        "name" => "天心区",
        "pid" => 430100,
        "code" => 430103,
        "mark" => "湖南省长沙市天心区"
    ],
    [
        "name" => "岳麓区",
        "pid" => 430100,
        "code" => 430104,
        "mark" => "湖南省长沙市岳麓区"
    ],
    [
        "name" => "开福区",
        "pid" => 430100,
        "code" => 430105,
        "mark" => "湖南省长沙市开福区"
    ],
    [
        "name" => "雨花区",
        "pid" => 430100,
        "code" => 430111,
        "mark" => "湖南省长沙市雨花区"
    ],
    [
        "name" => "望城区",
        "pid" => 430100,
        "code" => 430112,
        "mark" => "湖南省长沙市望城区"
    ],
    [
        "name" => "长沙县",
        "pid" => 430100,
        "code" => 430121,
        "mark" => "湖南省长沙市长沙县"
    ],
    [
        "name" => "宁乡县",
        "pid" => 430100,
        "code" => 430124,
        "mark" => "湖南省长沙市宁乡县"
    ],
    [
        "name" => "浏阳市",
        "pid" => 430100,
        "code" => 430181,
        "mark" => "湖南省长沙市浏阳市"
    ],
    [
        "name" => "株洲市",
        "pid" => 430000,
        "code" => 430200,
        "mark" => "湖南省株洲市"
    ],
    [
        "name" => "荷塘区",
        "pid" => 430200,
        "code" => 430202,
        "mark" => "湖南省株洲市荷塘区"
    ],
    [
        "name" => "芦淞区",
        "pid" => 430200,
        "code" => 430203,
        "mark" => "湖南省株洲市芦淞区"
    ],
    [
        "name" => "石峰区",
        "pid" => 430200,
        "code" => 430204,
        "mark" => "湖南省株洲市石峰区"
    ],
    [
        "name" => "天元区",
        "pid" => 430200,
        "code" => 430211,
        "mark" => "湖南省株洲市天元区"
    ],
    [
        "name" => "株洲县",
        "pid" => 430200,
        "code" => 430221,
        "mark" => "湖南省株洲市株洲县"
    ],
    [
        "name" => "攸县",
        "pid" => 430200,
        "code" => 430223,
        "mark" => "湖南省株洲市攸县"
    ],
    [
        "name" => "茶陵县",
        "pid" => 430200,
        "code" => 430224,
        "mark" => "湖南省株洲市茶陵县"
    ],
    [
        "name" => "炎陵县",
        "pid" => 430200,
        "code" => 430225,
        "mark" => "湖南省株洲市炎陵县"
    ],
    [
        "name" => "醴陵市",
        "pid" => 430200,
        "code" => 430281,
        "mark" => "湖南省株洲市醴陵市"
    ],
    [
        "name" => "湘潭市",
        "pid" => 430000,
        "code" => 430300,
        "mark" => "湖南省湘潭市"
    ],
    [
        "name" => "雨湖区",
        "pid" => 430300,
        "code" => 430302,
        "mark" => "湖南省湘潭市雨湖区"
    ],
    [
        "name" => "岳塘区",
        "pid" => 430300,
        "code" => 430304,
        "mark" => "湖南省湘潭市岳塘区"
    ],
    [
        "name" => "湘潭县",
        "pid" => 430300,
        "code" => 430321,
        "mark" => "湖南省湘潭市湘潭县"
    ],
    [
        "name" => "湘乡市",
        "pid" => 430300,
        "code" => 430381,
        "mark" => "湖南省湘潭市湘乡市"
    ],
    [
        "name" => "韶山市",
        "pid" => 430300,
        "code" => 430382,
        "mark" => "湖南省湘潭市韶山市"
    ],
    [
        "name" => "衡阳市",
        "pid" => 430000,
        "code" => 430400,
        "mark" => "湖南省衡阳市"
    ],
    [
        "name" => "珠晖区",
        "pid" => 430400,
        "code" => 430405,
        "mark" => "湖南省衡阳市珠晖区"
    ],
    [
        "name" => "雁峰区",
        "pid" => 430400,
        "code" => 430406,
        "mark" => "湖南省衡阳市雁峰区"
    ],
    [
        "name" => "石鼓区",
        "pid" => 430400,
        "code" => 430407,
        "mark" => "湖南省衡阳市石鼓区"
    ],
    [
        "name" => "蒸湘区",
        "pid" => 430400,
        "code" => 430408,
        "mark" => "湖南省衡阳市蒸湘区"
    ],
    [
        "name" => "南岳区",
        "pid" => 430400,
        "code" => 430412,
        "mark" => "湖南省衡阳市南岳区"
    ],
    [
        "name" => "衡阳县",
        "pid" => 430400,
        "code" => 430421,
        "mark" => "湖南省衡阳市衡阳县"
    ],
    [
        "name" => "衡南县",
        "pid" => 430400,
        "code" => 430422,
        "mark" => "湖南省衡阳市衡南县"
    ],
    [
        "name" => "衡山县",
        "pid" => 430400,
        "code" => 430423,
        "mark" => "湖南省衡阳市衡山县"
    ],
    [
        "name" => "衡东县",
        "pid" => 430400,
        "code" => 430424,
        "mark" => "湖南省衡阳市衡东县"
    ],
    [
        "name" => "祁东县",
        "pid" => 430400,
        "code" => 430426,
        "mark" => "湖南省衡阳市祁东县"
    ],
    [
        "name" => "耒阳市",
        "pid" => 430400,
        "code" => 430481,
        "mark" => "湖南省衡阳市耒阳市"
    ],
    [
        "name" => "常宁市",
        "pid" => 430400,
        "code" => 430482,
        "mark" => "湖南省衡阳市常宁市"
    ],
    [
        "name" => "邵阳市",
        "pid" => 430000,
        "code" => 430500,
        "mark" => "湖南省邵阳市"
    ],
    [
        "name" => "双清区",
        "pid" => 430500,
        "code" => 430502,
        "mark" => "湖南省邵阳市双清区"
    ],
    [
        "name" => "大祥区",
        "pid" => 430500,
        "code" => 430503,
        "mark" => "湖南省邵阳市大祥区"
    ],
    [
        "name" => "北塔区",
        "pid" => 430500,
        "code" => 430511,
        "mark" => "湖南省邵阳市北塔区"
    ],
    [
        "name" => "邵东县",
        "pid" => 430500,
        "code" => 430521,
        "mark" => "湖南省邵阳市邵东县"
    ],
    [
        "name" => "新邵县",
        "pid" => 430500,
        "code" => 430522,
        "mark" => "湖南省邵阳市新邵县"
    ],
    [
        "name" => "邵阳县",
        "pid" => 430500,
        "code" => 430523,
        "mark" => "湖南省邵阳市邵阳县"
    ],
    [
        "name" => "隆回县",
        "pid" => 430500,
        "code" => 430524,
        "mark" => "湖南省邵阳市隆回县"
    ],
    [
        "name" => "洞口县",
        "pid" => 430500,
        "code" => 430525,
        "mark" => "湖南省邵阳市洞口县"
    ],
    [
        "name" => "绥宁县",
        "pid" => 430500,
        "code" => 430527,
        "mark" => "湖南省邵阳市绥宁县"
    ],
    [
        "name" => "新宁县",
        "pid" => 430500,
        "code" => 430528,
        "mark" => "湖南省邵阳市新宁县"
    ],
    [
        "name" => "城步苗族自治县",
        "pid" => 430500,
        "code" => 430529,
        "mark" => "湖南省邵阳市城步苗族自治县"
    ],
    [
        "name" => "武冈市",
        "pid" => 430500,
        "code" => 430581,
        "mark" => "湖南省邵阳市武冈市"
    ],
    [
        "name" => "岳阳市",
        "pid" => 430000,
        "code" => 430600,
        "mark" => "湖南省岳阳市"
    ],
    [
        "name" => "岳阳楼区",
        "pid" => 430600,
        "code" => 430602,
        "mark" => "湖南省岳阳市岳阳楼区"
    ],
    [
        "name" => "云溪区",
        "pid" => 430600,
        "code" => 430603,
        "mark" => "湖南省岳阳市云溪区"
    ],
    [
        "name" => "君山区",
        "pid" => 430600,
        "code" => 430611,
        "mark" => "湖南省岳阳市君山区"
    ],
    [
        "name" => "岳阳县",
        "pid" => 430600,
        "code" => 430621,
        "mark" => "湖南省岳阳市岳阳县"
    ],
    [
        "name" => "华容县",
        "pid" => 430600,
        "code" => 430623,
        "mark" => "湖南省岳阳市华容县"
    ],
    [
        "name" => "湘阴县",
        "pid" => 430600,
        "code" => 430624,
        "mark" => "湖南省岳阳市湘阴县"
    ],
    [
        "name" => "平江县",
        "pid" => 430600,
        "code" => 430626,
        "mark" => "湖南省岳阳市平江县"
    ],
    [
        "name" => "汨罗市",
        "pid" => 430600,
        "code" => 430681,
        "mark" => "湖南省岳阳市汨罗市"
    ],
    [
        "name" => "临湘市",
        "pid" => 430600,
        "code" => 430682,
        "mark" => "湖南省岳阳市临湘市"
    ],
    [
        "name" => "常德市",
        "pid" => 430000,
        "code" => 430700,
        "mark" => "湖南省常德市"
    ],
    [
        "name" => "武陵区",
        "pid" => 430700,
        "code" => 430702,
        "mark" => "湖南省常德市武陵区"
    ],
    [
        "name" => "鼎城区",
        "pid" => 430700,
        "code" => 430703,
        "mark" => "湖南省常德市鼎城区"
    ],
    [
        "name" => "安乡县",
        "pid" => 430700,
        "code" => 430721,
        "mark" => "湖南省常德市安乡县"
    ],
    [
        "name" => "汉寿县",
        "pid" => 430700,
        "code" => 430722,
        "mark" => "湖南省常德市汉寿县"
    ],
    [
        "name" => "澧县",
        "pid" => 430700,
        "code" => 430723,
        "mark" => "湖南省常德市澧县"
    ],
    [
        "name" => "临澧县",
        "pid" => 430700,
        "code" => 430724,
        "mark" => "湖南省常德市临澧县"
    ],
    [
        "name" => "桃源县",
        "pid" => 430700,
        "code" => 430725,
        "mark" => "湖南省常德市桃源县"
    ],
    [
        "name" => "石门县",
        "pid" => 430700,
        "code" => 430726,
        "mark" => "湖南省常德市石门县"
    ],
    [
        "name" => "津市市",
        "pid" => 430700,
        "code" => 430781,
        "mark" => "湖南省常德市津市市"
    ],
    [
        "name" => "张家界市",
        "pid" => 430000,
        "code" => 430800,
        "mark" => "湖南省张家界市"
    ],
    [
        "name" => "永定区",
        "pid" => 430800,
        "code" => 430802,
        "mark" => "湖南省张家界市永定区"
    ],
    [
        "name" => "武陵源区",
        "pid" => 430800,
        "code" => 430811,
        "mark" => "湖南省张家界市武陵源区"
    ],
    [
        "name" => "慈利县",
        "pid" => 430800,
        "code" => 430821,
        "mark" => "湖南省张家界市慈利县"
    ],
    [
        "name" => "桑植县",
        "pid" => 430800,
        "code" => 430822,
        "mark" => "湖南省张家界市桑植县"
    ],
    [
        "name" => "益阳市",
        "pid" => 430000,
        "code" => 430900,
        "mark" => "湖南省益阳市"
    ],
    [
        "name" => "资阳区",
        "pid" => 430900,
        "code" => 430902,
        "mark" => "湖南省益阳市资阳区"
    ],
    [
        "name" => "赫山区",
        "pid" => 430900,
        "code" => 430903,
        "mark" => "湖南省益阳市赫山区"
    ],
    [
        "name" => "南县",
        "pid" => 430900,
        "code" => 430921,
        "mark" => "湖南省益阳市南县"
    ],
    [
        "name" => "桃江县",
        "pid" => 430900,
        "code" => 430922,
        "mark" => "湖南省益阳市桃江县"
    ],
    [
        "name" => "安化县",
        "pid" => 430900,
        "code" => 430923,
        "mark" => "湖南省益阳市安化县"
    ],
    [
        "name" => "沅江市",
        "pid" => 430900,
        "code" => 430981,
        "mark" => "湖南省益阳市沅江市"
    ],
    [
        "name" => "郴州市",
        "pid" => 430000,
        "code" => 431000,
        "mark" => "湖南省郴州市"
    ],
    [
        "name" => "北湖区",
        "pid" => 431000,
        "code" => 431002,
        "mark" => "湖南省郴州市北湖区"
    ],
    [
        "name" => "苏仙区",
        "pid" => 431000,
        "code" => 431003,
        "mark" => "湖南省郴州市苏仙区"
    ],
    [
        "name" => "桂阳县",
        "pid" => 431000,
        "code" => 431021,
        "mark" => "湖南省郴州市桂阳县"
    ],
    [
        "name" => "宜章县",
        "pid" => 431000,
        "code" => 431022,
        "mark" => "湖南省郴州市宜章县"
    ],
    [
        "name" => "永兴县",
        "pid" => 431000,
        "code" => 431023,
        "mark" => "湖南省郴州市永兴县"
    ],
    [
        "name" => "嘉禾县",
        "pid" => 431000,
        "code" => 431024,
        "mark" => "湖南省郴州市嘉禾县"
    ],
    [
        "name" => "临武县",
        "pid" => 431000,
        "code" => 431025,
        "mark" => "湖南省郴州市临武县"
    ],
    [
        "name" => "汝城县",
        "pid" => 431000,
        "code" => 431026,
        "mark" => "湖南省郴州市汝城县"
    ],
    [
        "name" => "桂东县",
        "pid" => 431000,
        "code" => 431027,
        "mark" => "湖南省郴州市桂东县"
    ],
    [
        "name" => "安仁县",
        "pid" => 431000,
        "code" => 431028,
        "mark" => "湖南省郴州市安仁县"
    ],
    [
        "name" => "资兴市",
        "pid" => 431000,
        "code" => 431081,
        "mark" => "湖南省郴州市资兴市"
    ],
    [
        "name" => "永州市",
        "pid" => 430000,
        "code" => 431100,
        "mark" => "湖南省永州市"
    ],
    [
        "name" => "零陵区",
        "pid" => 431100,
        "code" => 431102,
        "mark" => "湖南省永州市零陵区"
    ],
    [
        "name" => "冷水滩区",
        "pid" => 431100,
        "code" => 431103,
        "mark" => "湖南省永州市冷水滩区"
    ],
    [
        "name" => "祁阳县",
        "pid" => 431100,
        "code" => 431121,
        "mark" => "湖南省永州市祁阳县"
    ],
    [
        "name" => "东安县",
        "pid" => 431100,
        "code" => 431122,
        "mark" => "湖南省永州市东安县"
    ],
    [
        "name" => "双牌县",
        "pid" => 431100,
        "code" => 431123,
        "mark" => "湖南省永州市双牌县"
    ],
    [
        "name" => "道县",
        "pid" => 431100,
        "code" => 431124,
        "mark" => "湖南省永州市道县"
    ],
    [
        "name" => "江永县",
        "pid" => 431100,
        "code" => 431125,
        "mark" => "湖南省永州市江永县"
    ],
    [
        "name" => "宁远县",
        "pid" => 431100,
        "code" => 431126,
        "mark" => "湖南省永州市宁远县"
    ],
    [
        "name" => "蓝山县",
        "pid" => 431100,
        "code" => 431127,
        "mark" => "湖南省永州市蓝山县"
    ],
    [
        "name" => "新田县",
        "pid" => 431100,
        "code" => 431128,
        "mark" => "湖南省永州市新田县"
    ],
    [
        "name" => "江华瑶族自治县",
        "pid" => 431100,
        "code" => 431129,
        "mark" => "湖南省永州市江华瑶族自治县"
    ],
    [
        "name" => "怀化市",
        "pid" => 430000,
        "code" => 431200,
        "mark" => "湖南省怀化市"
    ],
    [
        "name" => "鹤城区",
        "pid" => 431200,
        "code" => 431202,
        "mark" => "湖南省怀化市鹤城区"
    ],
    [
        "name" => "中方县",
        "pid" => 431200,
        "code" => 431221,
        "mark" => "湖南省怀化市中方县"
    ],
    [
        "name" => "沅陵县",
        "pid" => 431200,
        "code" => 431222,
        "mark" => "湖南省怀化市沅陵县"
    ],
    [
        "name" => "辰溪县",
        "pid" => 431200,
        "code" => 431223,
        "mark" => "湖南省怀化市辰溪县"
    ],
    [
        "name" => "溆浦县",
        "pid" => 431200,
        "code" => 431224,
        "mark" => "湖南省怀化市溆浦县"
    ],
    [
        "name" => "会同县",
        "pid" => 431200,
        "code" => 431225,
        "mark" => "湖南省怀化市会同县"
    ],
    [
        "name" => "麻阳苗族自治县",
        "pid" => 431200,
        "code" => 431226,
        "mark" => "湖南省怀化市麻阳苗族自治县"
    ],
    [
        "name" => "新晃侗族自治县",
        "pid" => 431200,
        "code" => 431227,
        "mark" => "湖南省怀化市新晃侗族自治县"
    ],
    [
        "name" => "芷江侗族自治县",
        "pid" => 431200,
        "code" => 431228,
        "mark" => "湖南省怀化市芷江侗族自治县"
    ],
    [
        "name" => "靖州苗族侗族自治县",
        "pid" => 431200,
        "code" => 431229,
        "mark" => "湖南省怀化市靖州苗族侗族自治县"
    ],
    [
        "name" => "通道侗族自治县",
        "pid" => 431200,
        "code" => 431230,
        "mark" => "湖南省怀化市通道侗族自治县"
    ],
    [
        "name" => "洪江市",
        "pid" => 431200,
        "code" => 431281,
        "mark" => "湖南省怀化市洪江市"
    ],
    [
        "name" => "娄底市",
        "pid" => 430000,
        "code" => 431300,
        "mark" => "湖南省娄底市"
    ],
    [
        "name" => "娄星区",
        "pid" => 431300,
        "code" => 431302,
        "mark" => "湖南省娄底市娄星区"
    ],
    [
        "name" => "双峰县",
        "pid" => 431300,
        "code" => 431321,
        "mark" => "湖南省娄底市双峰县"
    ],
    [
        "name" => "新化县",
        "pid" => 431300,
        "code" => 431322,
        "mark" => "湖南省娄底市新化县"
    ],
    [
        "name" => "冷水江市",
        "pid" => 431300,
        "code" => 431381,
        "mark" => "湖南省娄底市冷水江市"
    ],
    [
        "name" => "涟源市",
        "pid" => 431300,
        "code" => 431382,
        "mark" => "湖南省娄底市涟源市"
    ],
    [
        "name" => "湘西土家族苗族自治州",
        "pid" => 430000,
        "code" => 433100,
        "mark" => "湖南省湘西土家族苗族自治州"
    ],
    [
        "name" => "吉首市",
        "pid" => 433100,
        "code" => 433101,
        "mark" => "湖南省湘西土家族苗族自治州吉首市"
    ],
    [
        "name" => "泸溪县",
        "pid" => 433100,
        "code" => 433122,
        "mark" => "湖南省湘西土家族苗族自治州泸溪县"
    ],
    [
        "name" => "凤凰县",
        "pid" => 433100,
        "code" => 433123,
        "mark" => "湖南省湘西土家族苗族自治州凤凰县"
    ],
    [
        "name" => "花垣县",
        "pid" => 433100,
        "code" => 433124,
        "mark" => "湖南省湘西土家族苗族自治州花垣县"
    ],
    [
        "name" => "保靖县",
        "pid" => 433100,
        "code" => 433125,
        "mark" => "湖南省湘西土家族苗族自治州保靖县"
    ],
    [
        "name" => "古丈县",
        "pid" => 433100,
        "code" => 433126,
        "mark" => "湖南省湘西土家族苗族自治州古丈县"
    ],
    [
        "name" => "永顺县",
        "pid" => 433100,
        "code" => 433127,
        "mark" => "湖南省湘西土家族苗族自治州永顺县"
    ],
    [
        "name" => "龙山县",
        "pid" => 433100,
        "code" => 433130,
        "mark" => "湖南省湘西土家族苗族自治州龙山县"
    ],
    [
        "name" => "广东省",
        "pid" => 86,
        "code" => 440000,
        "mark" => "广东省"
    ],
    [
        "name" => "广州市",
        "pid" => 440000,
        "code" => 440100,
        "mark" => "广东省广州市"
    ],
    [
        "name" => "荔湾区",
        "pid" => 440100,
        "code" => 440103,
        "mark" => "广东省广州市荔湾区"
    ],
    [
        "name" => "越秀区",
        "pid" => 440100,
        "code" => 440104,
        "mark" => "广东省广州市越秀区"
    ],
    [
        "name" => "海珠区",
        "pid" => 440100,
        "code" => 440105,
        "mark" => "广东省广州市海珠区"
    ],
    [
        "name" => "天河区",
        "pid" => 440100,
        "code" => 440106,
        "mark" => "广东省广州市天河区"
    ],
    [
        "name" => "白云区",
        "pid" => 440100,
        "code" => 440111,
        "mark" => "广东省广州市白云区"
    ],
    [
        "name" => "黄埔区",
        "pid" => 440100,
        "code" => 440112,
        "mark" => "广东省广州市黄埔区"
    ],
    [
        "name" => "番禺区",
        "pid" => 440100,
        "code" => 440113,
        "mark" => "广东省广州市番禺区"
    ],
    [
        "name" => "花都区",
        "pid" => 440100,
        "code" => 440114,
        "mark" => "广东省广州市花都区"
    ],
    [
        "name" => "南沙区",
        "pid" => 440100,
        "code" => 440115,
        "mark" => "广东省广州市南沙区"
    ],
    [
        "name" => "从化区",
        "pid" => 440100,
        "code" => 440117,
        "mark" => "广东省广州市从化区"
    ],
    [
        "name" => "增城区",
        "pid" => 440100,
        "code" => 440118,
        "mark" => "广东省广州市增城区"
    ],
    [
        "name" => "韶关市",
        "pid" => 440000,
        "code" => 440200,
        "mark" => "广东省韶关市"
    ],
    [
        "name" => "武江区",
        "pid" => 440200,
        "code" => 440203,
        "mark" => "广东省韶关市武江区"
    ],
    [
        "name" => "浈江区",
        "pid" => 440200,
        "code" => 440204,
        "mark" => "广东省韶关市浈江区"
    ],
    [
        "name" => "曲江区",
        "pid" => 440200,
        "code" => 440205,
        "mark" => "广东省韶关市曲江区"
    ],
    [
        "name" => "始兴县",
        "pid" => 440200,
        "code" => 440222,
        "mark" => "广东省韶关市始兴县"
    ],
    [
        "name" => "仁化县",
        "pid" => 440200,
        "code" => 440224,
        "mark" => "广东省韶关市仁化县"
    ],
    [
        "name" => "翁源县",
        "pid" => 440200,
        "code" => 440229,
        "mark" => "广东省韶关市翁源县"
    ],
    [
        "name" => "乳源瑶族自治县",
        "pid" => 440200,
        "code" => 440232,
        "mark" => "广东省韶关市乳源瑶族自治县"
    ],
    [
        "name" => "新丰县",
        "pid" => 440200,
        "code" => 440233,
        "mark" => "广东省韶关市新丰县"
    ],
    [
        "name" => "乐昌市",
        "pid" => 440200,
        "code" => 440281,
        "mark" => "广东省韶关市乐昌市"
    ],
    [
        "name" => "南雄市",
        "pid" => 440200,
        "code" => 440282,
        "mark" => "广东省韶关市南雄市"
    ],
    [
        "name" => "深圳市",
        "pid" => 440000,
        "code" => 440300,
        "mark" => "广东省深圳市"
    ],
    [
        "name" => "罗湖区",
        "pid" => 440300,
        "code" => 440303,
        "mark" => "广东省深圳市罗湖区"
    ],
    [
        "name" => "福田区",
        "pid" => 440300,
        "code" => 440304,
        "mark" => "广东省深圳市福田区"
    ],
    [
        "name" => "南山区",
        "pid" => 440300,
        "code" => 440305,
        "mark" => "广东省深圳市南山区"
    ],
    [
        "name" => "宝安区",
        "pid" => 440300,
        "code" => 440306,
        "mark" => "广东省深圳市宝安区"
    ],
    [
        "name" => "龙岗区",
        "pid" => 440300,
        "code" => 440307,
        "mark" => "广东省深圳市龙岗区"
    ],
    [
        "name" => "盐田区",
        "pid" => 440300,
        "code" => 440308,
        "mark" => "广东省深圳市盐田区"
    ],
    [
        "name" => "珠海市",
        "pid" => 440000,
        "code" => 440400,
        "mark" => "广东省珠海市"
    ],
    [
        "name" => "香洲区",
        "pid" => 440400,
        "code" => 440402,
        "mark" => "广东省珠海市香洲区"
    ],
    [
        "name" => "斗门区",
        "pid" => 440400,
        "code" => 440403,
        "mark" => "广东省珠海市斗门区"
    ],
    [
        "name" => "金湾区",
        "pid" => 440400,
        "code" => 440404,
        "mark" => "广东省珠海市金湾区"
    ],
    [
        "name" => "汕头市",
        "pid" => 440000,
        "code" => 440500,
        "mark" => "广东省汕头市"
    ],
    [
        "name" => "龙湖区",
        "pid" => 440500,
        "code" => 440507,
        "mark" => "广东省汕头市龙湖区"
    ],
    [
        "name" => "金平区",
        "pid" => 440500,
        "code" => 440511,
        "mark" => "广东省汕头市金平区"
    ],
    [
        "name" => "濠江区",
        "pid" => 440500,
        "code" => 440512,
        "mark" => "广东省汕头市濠江区"
    ],
    [
        "name" => "潮阳区",
        "pid" => 440500,
        "code" => 440513,
        "mark" => "广东省汕头市潮阳区"
    ],
    [
        "name" => "潮南区",
        "pid" => 440500,
        "code" => 440514,
        "mark" => "广东省汕头市潮南区"
    ],
    [
        "name" => "澄海区",
        "pid" => 440500,
        "code" => 440515,
        "mark" => "广东省汕头市澄海区"
    ],
    [
        "name" => "南澳县",
        "pid" => 440500,
        "code" => 440523,
        "mark" => "广东省汕头市南澳县"
    ],
    [
        "name" => "佛山市",
        "pid" => 440000,
        "code" => 440600,
        "mark" => "广东省佛山市"
    ],
    [
        "name" => "禅城区",
        "pid" => 440600,
        "code" => 440604,
        "mark" => "广东省佛山市禅城区"
    ],
    [
        "name" => "南海区",
        "pid" => 440600,
        "code" => 440605,
        "mark" => "广东省佛山市南海区"
    ],
    [
        "name" => "顺德区",
        "pid" => 440600,
        "code" => 440606,
        "mark" => "广东省佛山市顺德区"
    ],
    [
        "name" => "三水区",
        "pid" => 440600,
        "code" => 440607,
        "mark" => "广东省佛山市三水区"
    ],
    [
        "name" => "高明区",
        "pid" => 440600,
        "code" => 440608,
        "mark" => "广东省佛山市高明区"
    ],
    [
        "name" => "江门市",
        "pid" => 440000,
        "code" => 440700,
        "mark" => "广东省江门市"
    ],
    [
        "name" => "蓬江区",
        "pid" => 440700,
        "code" => 440703,
        "mark" => "广东省江门市蓬江区"
    ],
    [
        "name" => "江海区",
        "pid" => 440700,
        "code" => 440704,
        "mark" => "广东省江门市江海区"
    ],
    [
        "name" => "新会区",
        "pid" => 440700,
        "code" => 440705,
        "mark" => "广东省江门市新会区"
    ],
    [
        "name" => "台山市",
        "pid" => 440700,
        "code" => 440781,
        "mark" => "广东省江门市台山市"
    ],
    [
        "name" => "开平市",
        "pid" => 440700,
        "code" => 440783,
        "mark" => "广东省江门市开平市"
    ],
    [
        "name" => "鹤山市",
        "pid" => 440700,
        "code" => 440784,
        "mark" => "广东省江门市鹤山市"
    ],
    [
        "name" => "恩平市",
        "pid" => 440700,
        "code" => 440785,
        "mark" => "广东省江门市恩平市"
    ],
    [
        "name" => "湛江市",
        "pid" => 440000,
        "code" => 440800,
        "mark" => "广东省湛江市"
    ],
    [
        "name" => "赤坎区",
        "pid" => 440800,
        "code" => 440802,
        "mark" => "广东省湛江市赤坎区"
    ],
    [
        "name" => "霞山区",
        "pid" => 440800,
        "code" => 440803,
        "mark" => "广东省湛江市霞山区"
    ],
    [
        "name" => "坡头区",
        "pid" => 440800,
        "code" => 440804,
        "mark" => "广东省湛江市坡头区"
    ],
    [
        "name" => "麻章区",
        "pid" => 440800,
        "code" => 440811,
        "mark" => "广东省湛江市麻章区"
    ],
    [
        "name" => "遂溪县",
        "pid" => 440800,
        "code" => 440823,
        "mark" => "广东省湛江市遂溪县"
    ],
    [
        "name" => "徐闻县",
        "pid" => 440800,
        "code" => 440825,
        "mark" => "广东省湛江市徐闻县"
    ],
    [
        "name" => "廉江市",
        "pid" => 440800,
        "code" => 440881,
        "mark" => "广东省湛江市廉江市"
    ],
    [
        "name" => "雷州市",
        "pid" => 440800,
        "code" => 440882,
        "mark" => "广东省湛江市雷州市"
    ],
    [
        "name" => "吴川市",
        "pid" => 440800,
        "code" => 440883,
        "mark" => "广东省湛江市吴川市"
    ],
    [
        "name" => "茂名市",
        "pid" => 440000,
        "code" => 440900,
        "mark" => "广东省茂名市"
    ],
    [
        "name" => "茂南区",
        "pid" => 440900,
        "code" => 440902,
        "mark" => "广东省茂名市茂南区"
    ],
    [
        "name" => "电白区",
        "pid" => 440900,
        "code" => 440904,
        "mark" => "广东省茂名市电白区"
    ],
    [
        "name" => "高州市",
        "pid" => 440900,
        "code" => 440981,
        "mark" => "广东省茂名市高州市"
    ],
    [
        "name" => "化州市",
        "pid" => 440900,
        "code" => 440982,
        "mark" => "广东省茂名市化州市"
    ],
    [
        "name" => "信宜市",
        "pid" => 440900,
        "code" => 440983,
        "mark" => "广东省茂名市信宜市"
    ],
    [
        "name" => "肇庆市",
        "pid" => 440000,
        "code" => 441200,
        "mark" => "广东省肇庆市"
    ],
    [
        "name" => "端州区",
        "pid" => 441200,
        "code" => 441202,
        "mark" => "广东省肇庆市端州区"
    ],
    [
        "name" => "鼎湖区",
        "pid" => 441200,
        "code" => 441203,
        "mark" => "广东省肇庆市鼎湖区"
    ],
    [
        "name" => "高要区",
        "pid" => 441200,
        "code" => 441204,
        "mark" => "广东省肇庆市高要区"
    ],
    [
        "name" => "广宁县",
        "pid" => 441200,
        "code" => 441223,
        "mark" => "广东省肇庆市广宁县"
    ],
    [
        "name" => "怀集县",
        "pid" => 441200,
        "code" => 441224,
        "mark" => "广东省肇庆市怀集县"
    ],
    [
        "name" => "封开县",
        "pid" => 441200,
        "code" => 441225,
        "mark" => "广东省肇庆市封开县"
    ],
    [
        "name" => "德庆县",
        "pid" => 441200,
        "code" => 441226,
        "mark" => "广东省肇庆市德庆县"
    ],
    [
        "name" => "四会市",
        "pid" => 441200,
        "code" => 441284,
        "mark" => "广东省肇庆市四会市"
    ],
    [
        "name" => "惠州市",
        "pid" => 440000,
        "code" => 441300,
        "mark" => "广东省惠州市"
    ],
    [
        "name" => "惠城区",
        "pid" => 441300,
        "code" => 441302,
        "mark" => "广东省惠州市惠城区"
    ],
    [
        "name" => "惠阳区",
        "pid" => 441300,
        "code" => 441303,
        "mark" => "广东省惠州市惠阳区"
    ],
    [
        "name" => "博罗县",
        "pid" => 441300,
        "code" => 441322,
        "mark" => "广东省惠州市博罗县"
    ],
    [
        "name" => "惠东县",
        "pid" => 441300,
        "code" => 441323,
        "mark" => "广东省惠州市惠东县"
    ],
    [
        "name" => "龙门县",
        "pid" => 441300,
        "code" => 441324,
        "mark" => "广东省惠州市龙门县"
    ],
    [
        "name" => "梅州市",
        "pid" => 440000,
        "code" => 441400,
        "mark" => "广东省梅州市"
    ],
    [
        "name" => "梅江区",
        "pid" => 441400,
        "code" => 441402,
        "mark" => "广东省梅州市梅江区"
    ],
    [
        "name" => "梅县区",
        "pid" => 441400,
        "code" => 441403,
        "mark" => "广东省梅州市梅县区"
    ],
    [
        "name" => "大埔县",
        "pid" => 441400,
        "code" => 441422,
        "mark" => "广东省梅州市大埔县"
    ],
    [
        "name" => "丰顺县",
        "pid" => 441400,
        "code" => 441423,
        "mark" => "广东省梅州市丰顺县"
    ],
    [
        "name" => "五华县",
        "pid" => 441400,
        "code" => 441424,
        "mark" => "广东省梅州市五华县"
    ],
    [
        "name" => "平远县",
        "pid" => 441400,
        "code" => 441426,
        "mark" => "广东省梅州市平远县"
    ],
    [
        "name" => "蕉岭县",
        "pid" => 441400,
        "code" => 441427,
        "mark" => "广东省梅州市蕉岭县"
    ],
    [
        "name" => "兴宁市",
        "pid" => 441400,
        "code" => 441481,
        "mark" => "广东省梅州市兴宁市"
    ],
    [
        "name" => "汕尾市",
        "pid" => 440000,
        "code" => 441500,
        "mark" => "广东省汕尾市"
    ],
    [
        "name" => "城区",
        "pid" => 441500,
        "code" => 441502,
        "mark" => "广东省汕尾市城区"
    ],
    [
        "name" => "海丰县",
        "pid" => 441500,
        "code" => 441521,
        "mark" => "广东省汕尾市海丰县"
    ],
    [
        "name" => "陆河县",
        "pid" => 441500,
        "code" => 441523,
        "mark" => "广东省汕尾市陆河县"
    ],
    [
        "name" => "陆丰市",
        "pid" => 441500,
        "code" => 441581,
        "mark" => "广东省汕尾市陆丰市"
    ],
    [
        "name" => "河源市",
        "pid" => 440000,
        "code" => 441600,
        "mark" => "广东省河源市"
    ],
    [
        "name" => "源城区",
        "pid" => 441600,
        "code" => 441602,
        "mark" => "广东省河源市源城区"
    ],
    [
        "name" => "紫金县",
        "pid" => 441600,
        "code" => 441621,
        "mark" => "广东省河源市紫金县"
    ],
    [
        "name" => "龙川县",
        "pid" => 441600,
        "code" => 441622,
        "mark" => "广东省河源市龙川县"
    ],
    [
        "name" => "连平县",
        "pid" => 441600,
        "code" => 441623,
        "mark" => "广东省河源市连平县"
    ],
    [
        "name" => "和平县",
        "pid" => 441600,
        "code" => 441624,
        "mark" => "广东省河源市和平县"
    ],
    [
        "name" => "东源县",
        "pid" => 441600,
        "code" => 441625,
        "mark" => "广东省河源市东源县"
    ],
    [
        "name" => "阳江市",
        "pid" => 440000,
        "code" => 441700,
        "mark" => "广东省阳江市"
    ],
    [
        "name" => "江城区",
        "pid" => 441700,
        "code" => 441702,
        "mark" => "广东省阳江市江城区"
    ],
    [
        "name" => "阳东区",
        "pid" => 441700,
        "code" => 441704,
        "mark" => "广东省阳江市阳东区"
    ],
    [
        "name" => "阳西县",
        "pid" => 441700,
        "code" => 441721,
        "mark" => "广东省阳江市阳西县"
    ],
    [
        "name" => "阳春市",
        "pid" => 441700,
        "code" => 441781,
        "mark" => "广东省阳江市阳春市"
    ],
    [
        "name" => "清远市",
        "pid" => 440000,
        "code" => 441800,
        "mark" => "广东省清远市"
    ],
    [
        "name" => "清城区",
        "pid" => 441800,
        "code" => 441802,
        "mark" => "广东省清远市清城区"
    ],
    [
        "name" => "清新区",
        "pid" => 441800,
        "code" => 441803,
        "mark" => "广东省清远市清新区"
    ],
    [
        "name" => "佛冈县",
        "pid" => 441800,
        "code" => 441821,
        "mark" => "广东省清远市佛冈县"
    ],
    [
        "name" => "阳山县",
        "pid" => 441800,
        "code" => 441823,
        "mark" => "广东省清远市阳山县"
    ],
    [
        "name" => "连山壮族瑶族自治县",
        "pid" => 441800,
        "code" => 441825,
        "mark" => "广东省清远市连山壮族瑶族自治县"
    ],
    [
        "name" => "连南瑶族自治县",
        "pid" => 441800,
        "code" => 441826,
        "mark" => "广东省清远市连南瑶族自治县"
    ],
    [
        "name" => "英德市",
        "pid" => 441800,
        "code" => 441881,
        "mark" => "广东省清远市英德市"
    ],
    [
        "name" => "连州市",
        "pid" => 441800,
        "code" => 441882,
        "mark" => "广东省清远市连州市"
    ],
    [
        "name" => "东莞市",
        "pid" => 440000,
        "code" => 441900,
        "mark" => "广东省东莞市"
    ],
    [
        "name" => "中山市",
        "pid" => 440000,
        "code" => 442000,
        "mark" => "广东省中山市"
    ],
    [
        "name" => "潮州市",
        "pid" => 440000,
        "code" => 445100,
        "mark" => "广东省潮州市"
    ],
    [
        "name" => "湘桥区",
        "pid" => 445100,
        "code" => 445102,
        "mark" => "广东省潮州市湘桥区"
    ],
    [
        "name" => "潮安区",
        "pid" => 445100,
        "code" => 445103,
        "mark" => "广东省潮州市潮安区"
    ],
    [
        "name" => "饶平县",
        "pid" => 445100,
        "code" => 445122,
        "mark" => "广东省潮州市饶平县"
    ],
    [
        "name" => "揭阳市",
        "pid" => 440000,
        "code" => 445200,
        "mark" => "广东省揭阳市"
    ],
    [
        "name" => "榕城区",
        "pid" => 445200,
        "code" => 445202,
        "mark" => "广东省揭阳市榕城区"
    ],
    [
        "name" => "揭东区",
        "pid" => 445200,
        "code" => 445203,
        "mark" => "广东省揭阳市揭东区"
    ],
    [
        "name" => "揭西县",
        "pid" => 445200,
        "code" => 445222,
        "mark" => "广东省揭阳市揭西县"
    ],
    [
        "name" => "惠来县",
        "pid" => 445200,
        "code" => 445224,
        "mark" => "广东省揭阳市惠来县"
    ],
    [
        "name" => "普宁市",
        "pid" => 445200,
        "code" => 445281,
        "mark" => "广东省揭阳市普宁市"
    ],
    [
        "name" => "云浮市",
        "pid" => 440000,
        "code" => 445300,
        "mark" => "广东省云浮市"
    ],
    [
        "name" => "云城区",
        "pid" => 445300,
        "code" => 445302,
        "mark" => "广东省云浮市云城区"
    ],
    [
        "name" => "云安区",
        "pid" => 445300,
        "code" => 445303,
        "mark" => "广东省云浮市云安区"
    ],
    [
        "name" => "新兴县",
        "pid" => 445300,
        "code" => 445321,
        "mark" => "广东省云浮市新兴县"
    ],
    [
        "name" => "郁南县",
        "pid" => 445300,
        "code" => 445322,
        "mark" => "广东省云浮市郁南县"
    ],
    [
        "name" => "罗定市",
        "pid" => 445300,
        "code" => 445381,
        "mark" => "广东省云浮市罗定市"
    ],
    [
        "name" => "广西壮族自治区",
        "pid" => 86,
        "code" => 450000,
        "mark" => "广西壮族自治区"
    ],
    [
        "name" => "南宁市",
        "pid" => 450000,
        "code" => 450100,
        "mark" => "广西壮族自治区南宁市"
    ],
    [
        "name" => "兴宁区",
        "pid" => 450100,
        "code" => 450102,
        "mark" => "广西壮族自治区南宁市兴宁区"
    ],
    [
        "name" => "青秀区",
        "pid" => 450100,
        "code" => 450103,
        "mark" => "广西壮族自治区南宁市青秀区"
    ],
    [
        "name" => "江南区",
        "pid" => 450100,
        "code" => 450105,
        "mark" => "广西壮族自治区南宁市江南区"
    ],
    [
        "name" => "西乡塘区",
        "pid" => 450100,
        "code" => 450107,
        "mark" => "广西壮族自治区南宁市西乡塘区"
    ],
    [
        "name" => "良庆区",
        "pid" => 450100,
        "code" => 450108,
        "mark" => "广西壮族自治区南宁市良庆区"
    ],
    [
        "name" => "邕宁区",
        "pid" => 450100,
        "code" => 450109,
        "mark" => "广西壮族自治区南宁市邕宁区"
    ],
    [
        "name" => "武鸣区",
        "pid" => 450100,
        "code" => 450110,
        "mark" => "广西壮族自治区南宁市武鸣区"
    ],
    [
        "name" => "隆安县",
        "pid" => 450100,
        "code" => 450123,
        "mark" => "广西壮族自治区南宁市隆安县"
    ],
    [
        "name" => "马山县",
        "pid" => 450100,
        "code" => 450124,
        "mark" => "广西壮族自治区南宁市马山县"
    ],
    [
        "name" => "上林县",
        "pid" => 450100,
        "code" => 450125,
        "mark" => "广西壮族自治区南宁市上林县"
    ],
    [
        "name" => "宾阳县",
        "pid" => 450100,
        "code" => 450126,
        "mark" => "广西壮族自治区南宁市宾阳县"
    ],
    [
        "name" => "横县",
        "pid" => 450100,
        "code" => 450127,
        "mark" => "广西壮族自治区南宁市横县"
    ],
    [
        "name" => "柳州市",
        "pid" => 450000,
        "code" => 450200,
        "mark" => "广西壮族自治区柳州市"
    ],
    [
        "name" => "城中区",
        "pid" => 450200,
        "code" => 450202,
        "mark" => "广西壮族自治区柳州市城中区"
    ],
    [
        "name" => "鱼峰区",
        "pid" => 450200,
        "code" => 450203,
        "mark" => "广西壮族自治区柳州市鱼峰区"
    ],
    [
        "name" => "柳南区",
        "pid" => 450200,
        "code" => 450204,
        "mark" => "广西壮族自治区柳州市柳南区"
    ],
    [
        "name" => "柳北区",
        "pid" => 450200,
        "code" => 450205,
        "mark" => "广西壮族自治区柳州市柳北区"
    ],
    [
        "name" => "柳江区",
        "pid" => 450200,
        "code" => 450206,
        "mark" => "广西壮族自治区柳州市柳江区"
    ],
    [
        "name" => "柳城县",
        "pid" => 450200,
        "code" => 450222,
        "mark" => "广西壮族自治区柳州市柳城县"
    ],
    [
        "name" => "鹿寨县",
        "pid" => 450200,
        "code" => 450223,
        "mark" => "广西壮族自治区柳州市鹿寨县"
    ],
    [
        "name" => "融安县",
        "pid" => 450200,
        "code" => 450224,
        "mark" => "广西壮族自治区柳州市融安县"
    ],
    [
        "name" => "融水苗族自治县",
        "pid" => 450200,
        "code" => 450225,
        "mark" => "广西壮族自治区柳州市融水苗族自治县"
    ],
    [
        "name" => "三江侗族自治县",
        "pid" => 450200,
        "code" => 450226,
        "mark" => "广西壮族自治区柳州市三江侗族自治县"
    ],
    [
        "name" => "桂林市",
        "pid" => 450000,
        "code" => 450300,
        "mark" => "广西壮族自治区桂林市"
    ],
    [
        "name" => "秀峰区",
        "pid" => 450300,
        "code" => 450302,
        "mark" => "广西壮族自治区桂林市秀峰区"
    ],
    [
        "name" => "叠彩区",
        "pid" => 450300,
        "code" => 450303,
        "mark" => "广西壮族自治区桂林市叠彩区"
    ],
    [
        "name" => "象山区",
        "pid" => 450300,
        "code" => 450304,
        "mark" => "广西壮族自治区桂林市象山区"
    ],
    [
        "name" => "七星区",
        "pid" => 450300,
        "code" => 450305,
        "mark" => "广西壮族自治区桂林市七星区"
    ],
    [
        "name" => "雁山区",
        "pid" => 450300,
        "code" => 450311,
        "mark" => "广西壮族自治区桂林市雁山区"
    ],
    [
        "name" => "临桂区",
        "pid" => 450300,
        "code" => 450312,
        "mark" => "广西壮族自治区桂林市临桂区"
    ],
    [
        "name" => "阳朔县",
        "pid" => 450300,
        "code" => 450321,
        "mark" => "广西壮族自治区桂林市阳朔县"
    ],
    [
        "name" => "灵川县",
        "pid" => 450300,
        "code" => 450323,
        "mark" => "广西壮族自治区桂林市灵川县"
    ],
    [
        "name" => "全州县",
        "pid" => 450300,
        "code" => 450324,
        "mark" => "广西壮族自治区桂林市全州县"
    ],
    [
        "name" => "兴安县",
        "pid" => 450300,
        "code" => 450325,
        "mark" => "广西壮族自治区桂林市兴安县"
    ],
    [
        "name" => "永福县",
        "pid" => 450300,
        "code" => 450326,
        "mark" => "广西壮族自治区桂林市永福县"
    ],
    [
        "name" => "灌阳县",
        "pid" => 450300,
        "code" => 450327,
        "mark" => "广西壮族自治区桂林市灌阳县"
    ],
    [
        "name" => "龙胜各族自治县",
        "pid" => 450300,
        "code" => 450328,
        "mark" => "广西壮族自治区桂林市龙胜各族自治县"
    ],
    [
        "name" => "资源县",
        "pid" => 450300,
        "code" => 450329,
        "mark" => "广西壮族自治区桂林市资源县"
    ],
    [
        "name" => "平乐县",
        "pid" => 450300,
        "code" => 450330,
        "mark" => "广西壮族自治区桂林市平乐县"
    ],
    [
        "name" => "荔浦县",
        "pid" => 450300,
        "code" => 450331,
        "mark" => "广西壮族自治区桂林市荔浦县"
    ],
    [
        "name" => "恭城瑶族自治县",
        "pid" => 450300,
        "code" => 450332,
        "mark" => "广西壮族自治区桂林市恭城瑶族自治县"
    ],
    [
        "name" => "梧州市",
        "pid" => 450000,
        "code" => 450400,
        "mark" => "广西壮族自治区梧州市"
    ],
    [
        "name" => "万秀区",
        "pid" => 450400,
        "code" => 450403,
        "mark" => "广西壮族自治区梧州市万秀区"
    ],
    [
        "name" => "长洲区",
        "pid" => 450400,
        "code" => 450405,
        "mark" => "广西壮族自治区梧州市长洲区"
    ],
    [
        "name" => "龙圩区",
        "pid" => 450400,
        "code" => 450406,
        "mark" => "广西壮族自治区梧州市龙圩区"
    ],
    [
        "name" => "苍梧县",
        "pid" => 450400,
        "code" => 450421,
        "mark" => "广西壮族自治区梧州市苍梧县"
    ],
    [
        "name" => "藤县",
        "pid" => 450400,
        "code" => 450422,
        "mark" => "广西壮族自治区梧州市藤县"
    ],
    [
        "name" => "蒙山县",
        "pid" => 450400,
        "code" => 450423,
        "mark" => "广西壮族自治区梧州市蒙山县"
    ],
    [
        "name" => "岑溪市",
        "pid" => 450400,
        "code" => 450481,
        "mark" => "广西壮族自治区梧州市岑溪市"
    ],
    [
        "name" => "北海市",
        "pid" => 450000,
        "code" => 450500,
        "mark" => "广西壮族自治区北海市"
    ],
    [
        "name" => "海城区",
        "pid" => 450500,
        "code" => 450502,
        "mark" => "广西壮族自治区北海市海城区"
    ],
    [
        "name" => "银海区",
        "pid" => 450500,
        "code" => 450503,
        "mark" => "广西壮族自治区北海市银海区"
    ],
    [
        "name" => "铁山港区",
        "pid" => 450500,
        "code" => 450512,
        "mark" => "广西壮族自治区北海市铁山港区"
    ],
    [
        "name" => "合浦县",
        "pid" => 450500,
        "code" => 450521,
        "mark" => "广西壮族自治区北海市合浦县"
    ],
    [
        "name" => "防城港市",
        "pid" => 450000,
        "code" => 450600,
        "mark" => "广西壮族自治区防城港市"
    ],
    [
        "name" => "港口区",
        "pid" => 450600,
        "code" => 450602,
        "mark" => "广西壮族自治区防城港市港口区"
    ],
    [
        "name" => "防城区",
        "pid" => 450600,
        "code" => 450603,
        "mark" => "广西壮族自治区防城港市防城区"
    ],
    [
        "name" => "上思县",
        "pid" => 450600,
        "code" => 450621,
        "mark" => "广西壮族自治区防城港市上思县"
    ],
    [
        "name" => "东兴市",
        "pid" => 450600,
        "code" => 450681,
        "mark" => "广西壮族自治区防城港市东兴市"
    ],
    [
        "name" => "钦州市",
        "pid" => 450000,
        "code" => 450700,
        "mark" => "广西壮族自治区钦州市"
    ],
    [
        "name" => "钦南区",
        "pid" => 450700,
        "code" => 450702,
        "mark" => "广西壮族自治区钦州市钦南区"
    ],
    [
        "name" => "钦北区",
        "pid" => 450700,
        "code" => 450703,
        "mark" => "广西壮族自治区钦州市钦北区"
    ],
    [
        "name" => "灵山县",
        "pid" => 450700,
        "code" => 450721,
        "mark" => "广西壮族自治区钦州市灵山县"
    ],
    [
        "name" => "浦北县",
        "pid" => 450700,
        "code" => 450722,
        "mark" => "广西壮族自治区钦州市浦北县"
    ],
    [
        "name" => "贵港市",
        "pid" => 450000,
        "code" => 450800,
        "mark" => "广西壮族自治区贵港市"
    ],
    [
        "name" => "港北区",
        "pid" => 450800,
        "code" => 450802,
        "mark" => "广西壮族自治区贵港市港北区"
    ],
    [
        "name" => "港南区",
        "pid" => 450800,
        "code" => 450803,
        "mark" => "广西壮族自治区贵港市港南区"
    ],
    [
        "name" => "覃塘区",
        "pid" => 450800,
        "code" => 450804,
        "mark" => "广西壮族自治区贵港市覃塘区"
    ],
    [
        "name" => "平南县",
        "pid" => 450800,
        "code" => 450821,
        "mark" => "广西壮族自治区贵港市平南县"
    ],
    [
        "name" => "桂平市",
        "pid" => 450800,
        "code" => 450881,
        "mark" => "广西壮族自治区贵港市桂平市"
    ],
    [
        "name" => "玉林市",
        "pid" => 450000,
        "code" => 450900,
        "mark" => "广西壮族自治区玉林市"
    ],
    [
        "name" => "玉州区",
        "pid" => 450900,
        "code" => 450902,
        "mark" => "广西壮族自治区玉林市玉州区"
    ],
    [
        "name" => "福绵区",
        "pid" => 450900,
        "code" => 450903,
        "mark" => "广西壮族自治区玉林市福绵区"
    ],
    [
        "name" => "容县",
        "pid" => 450900,
        "code" => 450921,
        "mark" => "广西壮族自治区玉林市容县"
    ],
    [
        "name" => "陆川县",
        "pid" => 450900,
        "code" => 450922,
        "mark" => "广西壮族自治区玉林市陆川县"
    ],
    [
        "name" => "博白县",
        "pid" => 450900,
        "code" => 450923,
        "mark" => "广西壮族自治区玉林市博白县"
    ],
    [
        "name" => "兴业县",
        "pid" => 450900,
        "code" => 450924,
        "mark" => "广西壮族自治区玉林市兴业县"
    ],
    [
        "name" => "北流市",
        "pid" => 450900,
        "code" => 450981,
        "mark" => "广西壮族自治区玉林市北流市"
    ],
    [
        "name" => "百色市",
        "pid" => 450000,
        "code" => 451000,
        "mark" => "广西壮族自治区百色市"
    ],
    [
        "name" => "右江区",
        "pid" => 451000,
        "code" => 451002,
        "mark" => "广西壮族自治区百色市右江区"
    ],
    [
        "name" => "田阳县",
        "pid" => 451000,
        "code" => 451021,
        "mark" => "广西壮族自治区百色市田阳县"
    ],
    [
        "name" => "田东县",
        "pid" => 451000,
        "code" => 451022,
        "mark" => "广西壮族自治区百色市田东县"
    ],
    [
        "name" => "平果县",
        "pid" => 451000,
        "code" => 451023,
        "mark" => "广西壮族自治区百色市平果县"
    ],
    [
        "name" => "德保县",
        "pid" => 451000,
        "code" => 451024,
        "mark" => "广西壮族自治区百色市德保县"
    ],
    [
        "name" => "那坡县",
        "pid" => 451000,
        "code" => 451026,
        "mark" => "广西壮族自治区百色市那坡县"
    ],
    [
        "name" => "凌云县",
        "pid" => 451000,
        "code" => 451027,
        "mark" => "广西壮族自治区百色市凌云县"
    ],
    [
        "name" => "乐业县",
        "pid" => 451000,
        "code" => 451028,
        "mark" => "广西壮族自治区百色市乐业县"
    ],
    [
        "name" => "田林县",
        "pid" => 451000,
        "code" => 451029,
        "mark" => "广西壮族自治区百色市田林县"
    ],
    [
        "name" => "西林县",
        "pid" => 451000,
        "code" => 451030,
        "mark" => "广西壮族自治区百色市西林县"
    ],
    [
        "name" => "隆林各族自治县",
        "pid" => 451000,
        "code" => 451031,
        "mark" => "广西壮族自治区百色市隆林各族自治县"
    ],
    [
        "name" => "靖西市",
        "pid" => 451000,
        "code" => 451081,
        "mark" => "广西壮族自治区百色市靖西市"
    ],
    [
        "name" => "贺州市",
        "pid" => 450000,
        "code" => 451100,
        "mark" => "广西壮族自治区贺州市"
    ],
    [
        "name" => "八步区",
        "pid" => 451100,
        "code" => 451102,
        "mark" => "广西壮族自治区贺州市八步区"
    ],
    [
        "name" => "平桂区",
        "pid" => 451100,
        "code" => 451103,
        "mark" => "广西壮族自治区贺州市平桂区"
    ],
    [
        "name" => "昭平县",
        "pid" => 451100,
        "code" => 451121,
        "mark" => "广西壮族自治区贺州市昭平县"
    ],
    [
        "name" => "钟山县",
        "pid" => 451100,
        "code" => 451122,
        "mark" => "广西壮族自治区贺州市钟山县"
    ],
    [
        "name" => "富川瑶族自治县",
        "pid" => 451100,
        "code" => 451123,
        "mark" => "广西壮族自治区贺州市富川瑶族自治县"
    ],
    [
        "name" => "河池市",
        "pid" => 450000,
        "code" => 451200,
        "mark" => "广西壮族自治区河池市"
    ],
    [
        "name" => "金城江区",
        "pid" => 451200,
        "code" => 451202,
        "mark" => "广西壮族自治区河池市金城江区"
    ],
    [
        "name" => "南丹县",
        "pid" => 451200,
        "code" => 451221,
        "mark" => "广西壮族自治区河池市南丹县"
    ],
    [
        "name" => "天峨县",
        "pid" => 451200,
        "code" => 451222,
        "mark" => "广西壮族自治区河池市天峨县"
    ],
    [
        "name" => "凤山县",
        "pid" => 451200,
        "code" => 451223,
        "mark" => "广西壮族自治区河池市凤山县"
    ],
    [
        "name" => "东兰县",
        "pid" => 451200,
        "code" => 451224,
        "mark" => "广西壮族自治区河池市东兰县"
    ],
    [
        "name" => "罗城仫佬族自治县",
        "pid" => 451200,
        "code" => 451225,
        "mark" => "广西壮族自治区河池市罗城仫佬族自治县"
    ],
    [
        "name" => "环江毛南族自治县",
        "pid" => 451200,
        "code" => 451226,
        "mark" => "广西壮族自治区河池市环江毛南族自治县"
    ],
    [
        "name" => "巴马瑶族自治县",
        "pid" => 451200,
        "code" => 451227,
        "mark" => "广西壮族自治区河池市巴马瑶族自治县"
    ],
    [
        "name" => "都安瑶族自治县",
        "pid" => 451200,
        "code" => 451228,
        "mark" => "广西壮族自治区河池市都安瑶族自治县"
    ],
    [
        "name" => "大化瑶族自治县",
        "pid" => 451200,
        "code" => 451229,
        "mark" => "广西壮族自治区河池市大化瑶族自治县"
    ],
    [
        "name" => "宜州市",
        "pid" => 451200,
        "code" => 451281,
        "mark" => "广西壮族自治区河池市宜州市"
    ],
    [
        "name" => "来宾市",
        "pid" => 450000,
        "code" => 451300,
        "mark" => "广西壮族自治区来宾市"
    ],
    [
        "name" => "兴宾区",
        "pid" => 451300,
        "code" => 451302,
        "mark" => "广西壮族自治区来宾市兴宾区"
    ],
    [
        "name" => "忻城县",
        "pid" => 451300,
        "code" => 451321,
        "mark" => "广西壮族自治区来宾市忻城县"
    ],
    [
        "name" => "象州县",
        "pid" => 451300,
        "code" => 451322,
        "mark" => "广西壮族自治区来宾市象州县"
    ],
    [
        "name" => "武宣县",
        "pid" => 451300,
        "code" => 451323,
        "mark" => "广西壮族自治区来宾市武宣县"
    ],
    [
        "name" => "金秀瑶族自治县",
        "pid" => 451300,
        "code" => 451324,
        "mark" => "广西壮族自治区来宾市金秀瑶族自治县"
    ],
    [
        "name" => "合山市",
        "pid" => 451300,
        "code" => 451381,
        "mark" => "广西壮族自治区来宾市合山市"
    ],
    [
        "name" => "崇左市",
        "pid" => 450000,
        "code" => 451400,
        "mark" => "广西壮族自治区崇左市"
    ],
    [
        "name" => "江州区",
        "pid" => 451400,
        "code" => 451402,
        "mark" => "广西壮族自治区崇左市江州区"
    ],
    [
        "name" => "扶绥县",
        "pid" => 451400,
        "code" => 451421,
        "mark" => "广西壮族自治区崇左市扶绥县"
    ],
    [
        "name" => "宁明县",
        "pid" => 451400,
        "code" => 451422,
        "mark" => "广西壮族自治区崇左市宁明县"
    ],
    [
        "name" => "龙州县",
        "pid" => 451400,
        "code" => 451423,
        "mark" => "广西壮族自治区崇左市龙州县"
    ],
    [
        "name" => "大新县",
        "pid" => 451400,
        "code" => 451424,
        "mark" => "广西壮族自治区崇左市大新县"
    ],
    [
        "name" => "天等县",
        "pid" => 451400,
        "code" => 451425,
        "mark" => "广西壮族自治区崇左市天等县"
    ],
    [
        "name" => "凭祥市",
        "pid" => 451400,
        "code" => 451481,
        "mark" => "广西壮族自治区崇左市凭祥市"
    ],
    [
        "name" => "海南省",
        "pid" => 86,
        "code" => 460000,
        "mark" => "海南省"
    ],
    [
        "name" => "海口市",
        "pid" => 460000,
        "code" => 460100,
        "mark" => "海南省海口市"
    ],
    [
        "name" => "秀英区",
        "pid" => 460100,
        "code" => 460105,
        "mark" => "海南省海口市秀英区"
    ],
    [
        "name" => "龙华区",
        "pid" => 460100,
        "code" => 460106,
        "mark" => "海南省海口市龙华区"
    ],
    [
        "name" => "琼山区",
        "pid" => 460100,
        "code" => 460107,
        "mark" => "海南省海口市琼山区"
    ],
    [
        "name" => "美兰区",
        "pid" => 460100,
        "code" => 460108,
        "mark" => "海南省海口市美兰区"
    ],
    [
        "name" => "三亚市",
        "pid" => 460000,
        "code" => 460200,
        "mark" => "海南省三亚市"
    ],
    [
        "name" => "海棠区",
        "pid" => 460200,
        "code" => 460202,
        "mark" => "海南省三亚市海棠区"
    ],
    [
        "name" => "吉阳区",
        "pid" => 460200,
        "code" => 460203,
        "mark" => "海南省三亚市吉阳区"
    ],
    [
        "name" => "天涯区",
        "pid" => 460200,
        "code" => 460204,
        "mark" => "海南省三亚市天涯区"
    ],
    [
        "name" => "崖州区",
        "pid" => 460200,
        "code" => 460205,
        "mark" => "海南省三亚市崖州区"
    ],
    [
        "name" => "三沙市",
        "pid" => 460000,
        "code" => 460300,
        "mark" => "海南省三沙市"
    ],
    [
        "name" => "儋州市",
        "pid" => 460000,
        "code" => 460400,
        "mark" => "海南省儋州市"
    ],
    [
        "name" => "五指山市",
        "pid" => 460000,
        "code" => 469001,
        "mark" => "海南省五指山市"
    ],
    [
        "name" => "琼海市",
        "pid" => 460000,
        "code" => 469002,
        "mark" => "海南省琼海市"
    ],
    [
        "name" => "文昌市",
        "pid" => 460000,
        "code" => 469005,
        "mark" => "海南省文昌市"
    ],
    [
        "name" => "万宁市",
        "pid" => 460000,
        "code" => 469006,
        "mark" => "海南省万宁市"
    ],
    [
        "name" => "东方市",
        "pid" => 460000,
        "code" => 469007,
        "mark" => "海南省东方市"
    ],
    [
        "name" => "定安县",
        "pid" => 460000,
        "code" => 469021,
        "mark" => "海南省定安县"
    ],
    [
        "name" => "屯昌县",
        "pid" => 460000,
        "code" => 469022,
        "mark" => "海南省屯昌县"
    ],
    [
        "name" => "澄迈县",
        "pid" => 460000,
        "code" => 469023,
        "mark" => "海南省澄迈县"
    ],
    [
        "name" => "临高县",
        "pid" => 460000,
        "code" => 469024,
        "mark" => "海南省临高县"
    ],
    [
        "name" => "白沙黎族自治县",
        "pid" => 460000,
        "code" => 469025,
        "mark" => "海南省白沙黎族自治县"
    ],
    [
        "name" => "昌江黎族自治县",
        "pid" => 460000,
        "code" => 469026,
        "mark" => "海南省昌江黎族自治县"
    ],
    [
        "name" => "乐东黎族自治县",
        "pid" => 460000,
        "code" => 469027,
        "mark" => "海南省乐东黎族自治县"
    ],
    [
        "name" => "陵水黎族自治县",
        "pid" => 460000,
        "code" => 469028,
        "mark" => "海南省陵水黎族自治县"
    ],
    [
        "name" => "保亭黎族苗族自治县",
        "pid" => 460000,
        "code" => 469029,
        "mark" => "海南省保亭黎族苗族自治县"
    ],
    [
        "name" => "琼中黎族苗族自治县",
        "pid" => 460000,
        "code" => 469030,
        "mark" => "海南省琼中黎族苗族自治县"
    ],
    [
        "name" => "重庆市",
        "pid" => 86,
        "code" => 500000,
        "mark" => "重庆市"
    ],
    [
        "name" => "万州区",
        "pid" => 500000,
        "code" => 500101,
        "mark" => "重庆市万州区"
    ],
    [
        "name" => "涪陵区",
        "pid" => 500000,
        "code" => 500102,
        "mark" => "重庆市涪陵区"
    ],
    [
        "name" => "渝中区",
        "pid" => 500000,
        "code" => 500103,
        "mark" => "重庆市渝中区"
    ],
    [
        "name" => "大渡口区",
        "pid" => 500000,
        "code" => 500104,
        "mark" => "重庆市大渡口区"
    ],
    [
        "name" => "江北区",
        "pid" => 500000,
        "code" => 500105,
        "mark" => "重庆市江北区"
    ],
    [
        "name" => "沙坪坝区",
        "pid" => 500000,
        "code" => 500106,
        "mark" => "重庆市沙坪坝区"
    ],
    [
        "name" => "九龙坡区",
        "pid" => 500000,
        "code" => 500107,
        "mark" => "重庆市九龙坡区"
    ],
    [
        "name" => "南岸区",
        "pid" => 500000,
        "code" => 500108,
        "mark" => "重庆市南岸区"
    ],
    [
        "name" => "北碚区",
        "pid" => 500000,
        "code" => 500109,
        "mark" => "重庆市北碚区"
    ],
    [
        "name" => "綦江区",
        "pid" => 500000,
        "code" => 500110,
        "mark" => "重庆市綦江区"
    ],
    [
        "name" => "大足区",
        "pid" => 500000,
        "code" => 500111,
        "mark" => "重庆市大足区"
    ],
    [
        "name" => "渝北区",
        "pid" => 500000,
        "code" => 500112,
        "mark" => "重庆市渝北区"
    ],
    [
        "name" => "巴南区",
        "pid" => 500000,
        "code" => 500113,
        "mark" => "重庆市巴南区"
    ],
    [
        "name" => "黔江区",
        "pid" => 500000,
        "code" => 500114,
        "mark" => "重庆市黔江区"
    ],
    [
        "name" => "长寿区",
        "pid" => 500000,
        "code" => 500115,
        "mark" => "重庆市长寿区"
    ],
    [
        "name" => "江津区",
        "pid" => 500000,
        "code" => 500116,
        "mark" => "重庆市江津区"
    ],
    [
        "name" => "合川区",
        "pid" => 500000,
        "code" => 500117,
        "mark" => "重庆市合川区"
    ],
    [
        "name" => "永川区",
        "pid" => 500000,
        "code" => 500118,
        "mark" => "重庆市永川区"
    ],
    [
        "name" => "南川区",
        "pid" => 500000,
        "code" => 500119,
        "mark" => "重庆市南川区"
    ],
    [
        "name" => "璧山区",
        "pid" => 500000,
        "code" => 500120,
        "mark" => "重庆市璧山区"
    ],
    [
        "name" => "铜梁区",
        "pid" => 500000,
        "code" => 500151,
        "mark" => "重庆市铜梁区"
    ],
    [
        "name" => "潼南区",
        "pid" => 500000,
        "code" => 500152,
        "mark" => "重庆市潼南区"
    ],
    [
        "name" => "荣昌区",
        "pid" => 500000,
        "code" => 500153,
        "mark" => "重庆市荣昌区"
    ],
    [
        "name" => "开州区",
        "pid" => 500000,
        "code" => 500154,
        "mark" => "重庆市开州区"
    ],
    [
        "name" => "梁平县",
        "pid" => 500000,
        "code" => 500228,
        "mark" => "重庆市梁平县"
    ],
    [
        "name" => "城口县",
        "pid" => 500000,
        "code" => 500229,
        "mark" => "重庆市城口县"
    ],
    [
        "name" => "丰都县",
        "pid" => 500000,
        "code" => 500230,
        "mark" => "重庆市丰都县"
    ],
    [
        "name" => "垫江县",
        "pid" => 500000,
        "code" => 500231,
        "mark" => "重庆市垫江县"
    ],
    [
        "name" => "武隆县",
        "pid" => 500000,
        "code" => 500232,
        "mark" => "重庆市武隆县"
    ],
    [
        "name" => "忠县",
        "pid" => 500000,
        "code" => 500233,
        "mark" => "重庆市忠县"
    ],
    [
        "name" => "云阳县",
        "pid" => 500000,
        "code" => 500235,
        "mark" => "重庆市云阳县"
    ],
    [
        "name" => "奉节县",
        "pid" => 500000,
        "code" => 500236,
        "mark" => "重庆市奉节县"
    ],
    [
        "name" => "巫山县",
        "pid" => 500000,
        "code" => 500237,
        "mark" => "重庆市巫山县"
    ],
    [
        "name" => "巫溪县",
        "pid" => 500000,
        "code" => 500238,
        "mark" => "重庆市巫溪县"
    ],
    [
        "name" => "石柱土家族自治县",
        "pid" => 500000,
        "code" => 500240,
        "mark" => "重庆市石柱土家族自治县"
    ],
    [
        "name" => "秀山土家族苗族自治县",
        "pid" => 500000,
        "code" => 500241,
        "mark" => "重庆市秀山土家族苗族自治县"
    ],
    [
        "name" => "酉阳土家族苗族自治县",
        "pid" => 500000,
        "code" => 500242,
        "mark" => "重庆市酉阳土家族苗族自治县"
    ],
    [
        "name" => "彭水苗族土家族自治县",
        "pid" => 500000,
        "code" => 500243,
        "mark" => "重庆市彭水苗族土家族自治县"
    ],
    [
        "name" => "四川省",
        "pid" => 86,
        "code" => 510000,
        "mark" => "四川省"
    ],
    [
        "name" => "成都市",
        "pid" => 510000,
        "code" => 510100,
        "mark" => "四川省成都市"
    ],
    [
        "name" => "锦江区",
        "pid" => 510100,
        "code" => 510104,
        "mark" => "四川省成都市锦江区"
    ],
    [
        "name" => "青羊区",
        "pid" => 510100,
        "code" => 510105,
        "mark" => "四川省成都市青羊区"
    ],
    [
        "name" => "金牛区",
        "pid" => 510100,
        "code" => 510106,
        "mark" => "四川省成都市金牛区"
    ],
    [
        "name" => "武侯区",
        "pid" => 510100,
        "code" => 510107,
        "mark" => "四川省成都市武侯区"
    ],
    [
        "name" => "成华区",
        "pid" => 510100,
        "code" => 510108,
        "mark" => "四川省成都市成华区"
    ],
    [
        "name" => "龙泉驿区",
        "pid" => 510100,
        "code" => 510112,
        "mark" => "四川省成都市龙泉驿区"
    ],
    [
        "name" => "青白江区",
        "pid" => 510100,
        "code" => 510113,
        "mark" => "四川省成都市青白江区"
    ],
    [
        "name" => "新都区",
        "pid" => 510100,
        "code" => 510114,
        "mark" => "四川省成都市新都区"
    ],
    [
        "name" => "温江区",
        "pid" => 510100,
        "code" => 510115,
        "mark" => "四川省成都市温江区"
    ],
    [
        "name" => "双流区",
        "pid" => 510100,
        "code" => 510116,
        "mark" => "四川省成都市双流区"
    ],
    [
        "name" => "金堂县",
        "pid" => 510100,
        "code" => 510121,
        "mark" => "四川省成都市金堂县"
    ],
    [
        "name" => "郫县",
        "pid" => 510100,
        "code" => 510124,
        "mark" => "四川省成都市郫县"
    ],
    [
        "name" => "大邑县",
        "pid" => 510100,
        "code" => 510129,
        "mark" => "四川省成都市大邑县"
    ],
    [
        "name" => "蒲江县",
        "pid" => 510100,
        "code" => 510131,
        "mark" => "四川省成都市蒲江县"
    ],
    [
        "name" => "新津县",
        "pid" => 510100,
        "code" => 510132,
        "mark" => "四川省成都市新津县"
    ],
    [
        "name" => "都江堰市",
        "pid" => 510100,
        "code" => 510181,
        "mark" => "四川省成都市都江堰市"
    ],
    [
        "name" => "彭州市",
        "pid" => 510100,
        "code" => 510182,
        "mark" => "四川省成都市彭州市"
    ],
    [
        "name" => "邛崃市",
        "pid" => 510100,
        "code" => 510183,
        "mark" => "四川省成都市邛崃市"
    ],
    [
        "name" => "崇州市",
        "pid" => 510100,
        "code" => 510184,
        "mark" => "四川省成都市崇州市"
    ],
    [
        "name" => "简阳市",
        "pid" => 510100,
        "code" => 510185,
        "mark" => "四川省成都市简阳市"
    ],
    [
        "name" => "自贡市",
        "pid" => 510000,
        "code" => 510300,
        "mark" => "四川省自贡市"
    ],
    [
        "name" => "自流井区",
        "pid" => 510300,
        "code" => 510302,
        "mark" => "四川省自贡市自流井区"
    ],
    [
        "name" => "贡井区",
        "pid" => 510300,
        "code" => 510303,
        "mark" => "四川省自贡市贡井区"
    ],
    [
        "name" => "大安区",
        "pid" => 510300,
        "code" => 510304,
        "mark" => "四川省自贡市大安区"
    ],
    [
        "name" => "沿滩区",
        "pid" => 510300,
        "code" => 510311,
        "mark" => "四川省自贡市沿滩区"
    ],
    [
        "name" => "荣县",
        "pid" => 510300,
        "code" => 510321,
        "mark" => "四川省自贡市荣县"
    ],
    [
        "name" => "富顺县",
        "pid" => 510300,
        "code" => 510322,
        "mark" => "四川省自贡市富顺县"
    ],
    [
        "name" => "攀枝花市",
        "pid" => 510000,
        "code" => 510400,
        "mark" => "四川省攀枝花市"
    ],
    [
        "name" => "东区",
        "pid" => 510400,
        "code" => 510402,
        "mark" => "四川省攀枝花市东区"
    ],
    [
        "name" => "西区",
        "pid" => 510400,
        "code" => 510403,
        "mark" => "四川省攀枝花市西区"
    ],
    [
        "name" => "仁和区",
        "pid" => 510400,
        "code" => 510411,
        "mark" => "四川省攀枝花市仁和区"
    ],
    [
        "name" => "米易县",
        "pid" => 510400,
        "code" => 510421,
        "mark" => "四川省攀枝花市米易县"
    ],
    [
        "name" => "盐边县",
        "pid" => 510400,
        "code" => 510422,
        "mark" => "四川省攀枝花市盐边县"
    ],
    [
        "name" => "泸州市",
        "pid" => 510000,
        "code" => 510500,
        "mark" => "四川省泸州市"
    ],
    [
        "name" => "江阳区",
        "pid" => 510500,
        "code" => 510502,
        "mark" => "四川省泸州市江阳区"
    ],
    [
        "name" => "纳溪区",
        "pid" => 510500,
        "code" => 510503,
        "mark" => "四川省泸州市纳溪区"
    ],
    [
        "name" => "龙马潭区",
        "pid" => 510500,
        "code" => 510504,
        "mark" => "四川省泸州市龙马潭区"
    ],
    [
        "name" => "泸县",
        "pid" => 510500,
        "code" => 510521,
        "mark" => "四川省泸州市泸县"
    ],
    [
        "name" => "合江县",
        "pid" => 510500,
        "code" => 510522,
        "mark" => "四川省泸州市合江县"
    ],
    [
        "name" => "叙永县",
        "pid" => 510500,
        "code" => 510524,
        "mark" => "四川省泸州市叙永县"
    ],
    [
        "name" => "古蔺县",
        "pid" => 510500,
        "code" => 510525,
        "mark" => "四川省泸州市古蔺县"
    ],
    [
        "name" => "德阳市",
        "pid" => 510000,
        "code" => 510600,
        "mark" => "四川省德阳市"
    ],
    [
        "name" => "旌阳区",
        "pid" => 510600,
        "code" => 510603,
        "mark" => "四川省德阳市旌阳区"
    ],
    [
        "name" => "中江县",
        "pid" => 510600,
        "code" => 510623,
        "mark" => "四川省德阳市中江县"
    ],
    [
        "name" => "罗江县",
        "pid" => 510600,
        "code" => 510626,
        "mark" => "四川省德阳市罗江县"
    ],
    [
        "name" => "广汉市",
        "pid" => 510600,
        "code" => 510681,
        "mark" => "四川省德阳市广汉市"
    ],
    [
        "name" => "什邡市",
        "pid" => 510600,
        "code" => 510682,
        "mark" => "四川省德阳市什邡市"
    ],
    [
        "name" => "绵竹市",
        "pid" => 510600,
        "code" => 510683,
        "mark" => "四川省德阳市绵竹市"
    ],
    [
        "name" => "绵阳市",
        "pid" => 510000,
        "code" => 510700,
        "mark" => "四川省绵阳市"
    ],
    [
        "name" => "涪城区",
        "pid" => 510700,
        "code" => 510703,
        "mark" => "四川省绵阳市涪城区"
    ],
    [
        "name" => "游仙区",
        "pid" => 510700,
        "code" => 510704,
        "mark" => "四川省绵阳市游仙区"
    ],
    [
        "name" => "安州区",
        "pid" => 510700,
        "code" => 510705,
        "mark" => "四川省绵阳市安州区"
    ],
    [
        "name" => "三台县",
        "pid" => 510700,
        "code" => 510722,
        "mark" => "四川省绵阳市三台县"
    ],
    [
        "name" => "盐亭县",
        "pid" => 510700,
        "code" => 510723,
        "mark" => "四川省绵阳市盐亭县"
    ],
    [
        "name" => "梓潼县",
        "pid" => 510700,
        "code" => 510725,
        "mark" => "四川省绵阳市梓潼县"
    ],
    [
        "name" => "北川羌族自治县",
        "pid" => 510700,
        "code" => 510726,
        "mark" => "四川省绵阳市北川羌族自治县"
    ],
    [
        "name" => "平武县",
        "pid" => 510700,
        "code" => 510727,
        "mark" => "四川省绵阳市平武县"
    ],
    [
        "name" => "江油市",
        "pid" => 510700,
        "code" => 510781,
        "mark" => "四川省绵阳市江油市"
    ],
    [
        "name" => "广元市",
        "pid" => 510000,
        "code" => 510800,
        "mark" => "四川省广元市"
    ],
    [
        "name" => "利州区",
        "pid" => 510800,
        "code" => 510802,
        "mark" => "四川省广元市利州区"
    ],
    [
        "name" => "昭化区",
        "pid" => 510800,
        "code" => 510811,
        "mark" => "四川省广元市昭化区"
    ],
    [
        "name" => "朝天区",
        "pid" => 510800,
        "code" => 510812,
        "mark" => "四川省广元市朝天区"
    ],
    [
        "name" => "旺苍县",
        "pid" => 510800,
        "code" => 510821,
        "mark" => "四川省广元市旺苍县"
    ],
    [
        "name" => "青川县",
        "pid" => 510800,
        "code" => 510822,
        "mark" => "四川省广元市青川县"
    ],
    [
        "name" => "剑阁县",
        "pid" => 510800,
        "code" => 510823,
        "mark" => "四川省广元市剑阁县"
    ],
    [
        "name" => "苍溪县",
        "pid" => 510800,
        "code" => 510824,
        "mark" => "四川省广元市苍溪县"
    ],
    [
        "name" => "遂宁市",
        "pid" => 510000,
        "code" => 510900,
        "mark" => "四川省遂宁市"
    ],
    [
        "name" => "船山区",
        "pid" => 510900,
        "code" => 510903,
        "mark" => "四川省遂宁市船山区"
    ],
    [
        "name" => "安居区",
        "pid" => 510900,
        "code" => 510904,
        "mark" => "四川省遂宁市安居区"
    ],
    [
        "name" => "蓬溪县",
        "pid" => 510900,
        "code" => 510921,
        "mark" => "四川省遂宁市蓬溪县"
    ],
    [
        "name" => "射洪县",
        "pid" => 510900,
        "code" => 510922,
        "mark" => "四川省遂宁市射洪县"
    ],
    [
        "name" => "大英县",
        "pid" => 510900,
        "code" => 510923,
        "mark" => "四川省遂宁市大英县"
    ],
    [
        "name" => "内江市",
        "pid" => 510000,
        "code" => 511000,
        "mark" => "四川省内江市"
    ],
    [
        "name" => "市中区",
        "pid" => 511000,
        "code" => 511002,
        "mark" => "四川省内江市市中区"
    ],
    [
        "name" => "东兴区",
        "pid" => 511000,
        "code" => 511011,
        "mark" => "四川省内江市东兴区"
    ],
    [
        "name" => "威远县",
        "pid" => 511000,
        "code" => 511024,
        "mark" => "四川省内江市威远县"
    ],
    [
        "name" => "资中县",
        "pid" => 511000,
        "code" => 511025,
        "mark" => "四川省内江市资中县"
    ],
    [
        "name" => "隆昌县",
        "pid" => 511000,
        "code" => 511028,
        "mark" => "四川省内江市隆昌县"
    ],
    [
        "name" => "乐山市",
        "pid" => 510000,
        "code" => 511100,
        "mark" => "四川省乐山市"
    ],
    [
        "name" => "市中区",
        "pid" => 511100,
        "code" => 511102,
        "mark" => "四川省乐山市市中区"
    ],
    [
        "name" => "沙湾区",
        "pid" => 511100,
        "code" => 511111,
        "mark" => "四川省乐山市沙湾区"
    ],
    [
        "name" => "五通桥区",
        "pid" => 511100,
        "code" => 511112,
        "mark" => "四川省乐山市五通桥区"
    ],
    [
        "name" => "金口河区",
        "pid" => 511100,
        "code" => 511113,
        "mark" => "四川省乐山市金口河区"
    ],
    [
        "name" => "犍为县",
        "pid" => 511100,
        "code" => 511123,
        "mark" => "四川省乐山市犍为县"
    ],
    [
        "name" => "井研县",
        "pid" => 511100,
        "code" => 511124,
        "mark" => "四川省乐山市井研县"
    ],
    [
        "name" => "夹江县",
        "pid" => 511100,
        "code" => 511126,
        "mark" => "四川省乐山市夹江县"
    ],
    [
        "name" => "沐川县",
        "pid" => 511100,
        "code" => 511129,
        "mark" => "四川省乐山市沐川县"
    ],
    [
        "name" => "峨边彝族自治县",
        "pid" => 511100,
        "code" => 511132,
        "mark" => "四川省乐山市峨边彝族自治县"
    ],
    [
        "name" => "马边彝族自治县",
        "pid" => 511100,
        "code" => 511133,
        "mark" => "四川省乐山市马边彝族自治县"
    ],
    [
        "name" => "峨眉山市",
        "pid" => 511100,
        "code" => 511181,
        "mark" => "四川省乐山市峨眉山市"
    ],
    [
        "name" => "南充市",
        "pid" => 510000,
        "code" => 511300,
        "mark" => "四川省南充市"
    ],
    [
        "name" => "顺庆区",
        "pid" => 511300,
        "code" => 511302,
        "mark" => "四川省南充市顺庆区"
    ],
    [
        "name" => "高坪区",
        "pid" => 511300,
        "code" => 511303,
        "mark" => "四川省南充市高坪区"
    ],
    [
        "name" => "嘉陵区",
        "pid" => 511300,
        "code" => 511304,
        "mark" => "四川省南充市嘉陵区"
    ],
    [
        "name" => "南部县",
        "pid" => 511300,
        "code" => 511321,
        "mark" => "四川省南充市南部县"
    ],
    [
        "name" => "营山县",
        "pid" => 511300,
        "code" => 511322,
        "mark" => "四川省南充市营山县"
    ],
    [
        "name" => "蓬安县",
        "pid" => 511300,
        "code" => 511323,
        "mark" => "四川省南充市蓬安县"
    ],
    [
        "name" => "仪陇县",
        "pid" => 511300,
        "code" => 511324,
        "mark" => "四川省南充市仪陇县"
    ],
    [
        "name" => "西充县",
        "pid" => 511300,
        "code" => 511325,
        "mark" => "四川省南充市西充县"
    ],
    [
        "name" => "阆中市",
        "pid" => 511300,
        "code" => 511381,
        "mark" => "四川省南充市阆中市"
    ],
    [
        "name" => "眉山市",
        "pid" => 510000,
        "code" => 511400,
        "mark" => "四川省眉山市"
    ],
    [
        "name" => "东坡区",
        "pid" => 511400,
        "code" => 511402,
        "mark" => "四川省眉山市东坡区"
    ],
    [
        "name" => "彭山区",
        "pid" => 511400,
        "code" => 511403,
        "mark" => "四川省眉山市彭山区"
    ],
    [
        "name" => "仁寿县",
        "pid" => 511400,
        "code" => 511421,
        "mark" => "四川省眉山市仁寿县"
    ],
    [
        "name" => "洪雅县",
        "pid" => 511400,
        "code" => 511423,
        "mark" => "四川省眉山市洪雅县"
    ],
    [
        "name" => "丹棱县",
        "pid" => 511400,
        "code" => 511424,
        "mark" => "四川省眉山市丹棱县"
    ],
    [
        "name" => "青神县",
        "pid" => 511400,
        "code" => 511425,
        "mark" => "四川省眉山市青神县"
    ],
    [
        "name" => "宜宾市",
        "pid" => 510000,
        "code" => 511500,
        "mark" => "四川省宜宾市"
    ],
    [
        "name" => "翠屏区",
        "pid" => 511500,
        "code" => 511502,
        "mark" => "四川省宜宾市翠屏区"
    ],
    [
        "name" => "南溪区",
        "pid" => 511500,
        "code" => 511503,
        "mark" => "四川省宜宾市南溪区"
    ],
    [
        "name" => "宜宾县",
        "pid" => 511500,
        "code" => 511521,
        "mark" => "四川省宜宾市宜宾县"
    ],
    [
        "name" => "江安县",
        "pid" => 511500,
        "code" => 511523,
        "mark" => "四川省宜宾市江安县"
    ],
    [
        "name" => "长宁县",
        "pid" => 511500,
        "code" => 511524,
        "mark" => "四川省宜宾市长宁县"
    ],
    [
        "name" => "高县",
        "pid" => 511500,
        "code" => 511525,
        "mark" => "四川省宜宾市高县"
    ],
    [
        "name" => "珙县",
        "pid" => 511500,
        "code" => 511526,
        "mark" => "四川省宜宾市珙县"
    ],
    [
        "name" => "筠连县",
        "pid" => 511500,
        "code" => 511527,
        "mark" => "四川省宜宾市筠连县"
    ],
    [
        "name" => "兴文县",
        "pid" => 511500,
        "code" => 511528,
        "mark" => "四川省宜宾市兴文县"
    ],
    [
        "name" => "屏山县",
        "pid" => 511500,
        "code" => 511529,
        "mark" => "四川省宜宾市屏山县"
    ],
    [
        "name" => "广安市",
        "pid" => 510000,
        "code" => 511600,
        "mark" => "四川省广安市"
    ],
    [
        "name" => "广安区",
        "pid" => 511600,
        "code" => 511602,
        "mark" => "四川省广安市广安区"
    ],
    [
        "name" => "前锋区",
        "pid" => 511600,
        "code" => 511603,
        "mark" => "四川省广安市前锋区"
    ],
    [
        "name" => "岳池县",
        "pid" => 511600,
        "code" => 511621,
        "mark" => "四川省广安市岳池县"
    ],
    [
        "name" => "武胜县",
        "pid" => 511600,
        "code" => 511622,
        "mark" => "四川省广安市武胜县"
    ],
    [
        "name" => "邻水县",
        "pid" => 511600,
        "code" => 511623,
        "mark" => "四川省广安市邻水县"
    ],
    [
        "name" => "华蓥市",
        "pid" => 511600,
        "code" => 511681,
        "mark" => "四川省广安市华蓥市"
    ],
    [
        "name" => "达州市",
        "pid" => 510000,
        "code" => 511700,
        "mark" => "四川省达州市"
    ],
    [
        "name" => "通川区",
        "pid" => 511700,
        "code" => 511702,
        "mark" => "四川省达州市通川区"
    ],
    [
        "name" => "达川区",
        "pid" => 511700,
        "code" => 511703,
        "mark" => "四川省达州市达川区"
    ],
    [
        "name" => "宣汉县",
        "pid" => 511700,
        "code" => 511722,
        "mark" => "四川省达州市宣汉县"
    ],
    [
        "name" => "开江县",
        "pid" => 511700,
        "code" => 511723,
        "mark" => "四川省达州市开江县"
    ],
    [
        "name" => "大竹县",
        "pid" => 511700,
        "code" => 511724,
        "mark" => "四川省达州市大竹县"
    ],
    [
        "name" => "渠县",
        "pid" => 511700,
        "code" => 511725,
        "mark" => "四川省达州市渠县"
    ],
    [
        "name" => "万源市",
        "pid" => 511700,
        "code" => 511781,
        "mark" => "四川省达州市万源市"
    ],
    [
        "name" => "雅安市",
        "pid" => 510000,
        "code" => 511800,
        "mark" => "四川省雅安市"
    ],
    [
        "name" => "雨城区",
        "pid" => 511800,
        "code" => 511802,
        "mark" => "四川省雅安市雨城区"
    ],
    [
        "name" => "名山区",
        "pid" => 511800,
        "code" => 511803,
        "mark" => "四川省雅安市名山区"
    ],
    [
        "name" => "荥经县",
        "pid" => 511800,
        "code" => 511822,
        "mark" => "四川省雅安市荥经县"
    ],
    [
        "name" => "汉源县",
        "pid" => 511800,
        "code" => 511823,
        "mark" => "四川省雅安市汉源县"
    ],
    [
        "name" => "石棉县",
        "pid" => 511800,
        "code" => 511824,
        "mark" => "四川省雅安市石棉县"
    ],
    [
        "name" => "天全县",
        "pid" => 511800,
        "code" => 511825,
        "mark" => "四川省雅安市天全县"
    ],
    [
        "name" => "芦山县",
        "pid" => 511800,
        "code" => 511826,
        "mark" => "四川省雅安市芦山县"
    ],
    [
        "name" => "宝兴县",
        "pid" => 511800,
        "code" => 511827,
        "mark" => "四川省雅安市宝兴县"
    ],
    [
        "name" => "巴中市",
        "pid" => 510000,
        "code" => 511900,
        "mark" => "四川省巴中市"
    ],
    [
        "name" => "巴州区",
        "pid" => 511900,
        "code" => 511902,
        "mark" => "四川省巴中市巴州区"
    ],
    [
        "name" => "恩阳区",
        "pid" => 511900,
        "code" => 511903,
        "mark" => "四川省巴中市恩阳区"
    ],
    [
        "name" => "通江县",
        "pid" => 511900,
        "code" => 511921,
        "mark" => "四川省巴中市通江县"
    ],
    [
        "name" => "南江县",
        "pid" => 511900,
        "code" => 511922,
        "mark" => "四川省巴中市南江县"
    ],
    [
        "name" => "平昌县",
        "pid" => 511900,
        "code" => 511923,
        "mark" => "四川省巴中市平昌县"
    ],
    [
        "name" => "资阳市",
        "pid" => 510000,
        "code" => 512000,
        "mark" => "四川省资阳市"
    ],
    [
        "name" => "雁江区",
        "pid" => 512000,
        "code" => 512002,
        "mark" => "四川省资阳市雁江区"
    ],
    [
        "name" => "安岳县",
        "pid" => 512000,
        "code" => 512021,
        "mark" => "四川省资阳市安岳县"
    ],
    [
        "name" => "乐至县",
        "pid" => 512000,
        "code" => 512022,
        "mark" => "四川省资阳市乐至县"
    ],
    [
        "name" => "阿坝藏族羌族自治州",
        "pid" => 510000,
        "code" => 513200,
        "mark" => "四川省阿坝藏族羌族自治州"
    ],
    [
        "name" => "马尔康市",
        "pid" => 513200,
        "code" => 513201,
        "mark" => "四川省阿坝藏族羌族自治州马尔康市"
    ],
    [
        "name" => "汶川县",
        "pid" => 513200,
        "code" => 513221,
        "mark" => "四川省阿坝藏族羌族自治州汶川县"
    ],
    [
        "name" => "理县",
        "pid" => 513200,
        "code" => 513222,
        "mark" => "四川省阿坝藏族羌族自治州理县"
    ],
    [
        "name" => "茂县",
        "pid" => 513200,
        "code" => 513223,
        "mark" => "四川省阿坝藏族羌族自治州茂县"
    ],
    [
        "name" => "松潘县",
        "pid" => 513200,
        "code" => 513224,
        "mark" => "四川省阿坝藏族羌族自治州松潘县"
    ],
    [
        "name" => "九寨沟县",
        "pid" => 513200,
        "code" => 513225,
        "mark" => "四川省阿坝藏族羌族自治州九寨沟县"
    ],
    [
        "name" => "金川县",
        "pid" => 513200,
        "code" => 513226,
        "mark" => "四川省阿坝藏族羌族自治州金川县"
    ],
    [
        "name" => "小金县",
        "pid" => 513200,
        "code" => 513227,
        "mark" => "四川省阿坝藏族羌族自治州小金县"
    ],
    [
        "name" => "黑水县",
        "pid" => 513200,
        "code" => 513228,
        "mark" => "四川省阿坝藏族羌族自治州黑水县"
    ],
    [
        "name" => "壤塘县",
        "pid" => 513200,
        "code" => 513230,
        "mark" => "四川省阿坝藏族羌族自治州壤塘县"
    ],
    [
        "name" => "阿坝县",
        "pid" => 513200,
        "code" => 513231,
        "mark" => "四川省阿坝藏族羌族自治州阿坝县"
    ],
    [
        "name" => "若尔盖县",
        "pid" => 513200,
        "code" => 513232,
        "mark" => "四川省阿坝藏族羌族自治州若尔盖县"
    ],
    [
        "name" => "红原县",
        "pid" => 513200,
        "code" => 513233,
        "mark" => "四川省阿坝藏族羌族自治州红原县"
    ],
    [
        "name" => "甘孜藏族自治州",
        "pid" => 510000,
        "code" => 513300,
        "mark" => "四川省甘孜藏族自治州"
    ],
    [
        "name" => "康定市",
        "pid" => 513300,
        "code" => 513301,
        "mark" => "四川省甘孜藏族自治州康定市"
    ],
    [
        "name" => "泸定县",
        "pid" => 513300,
        "code" => 513322,
        "mark" => "四川省甘孜藏族自治州泸定县"
    ],
    [
        "name" => "丹巴县",
        "pid" => 513300,
        "code" => 513323,
        "mark" => "四川省甘孜藏族自治州丹巴县"
    ],
    [
        "name" => "九龙县",
        "pid" => 513300,
        "code" => 513324,
        "mark" => "四川省甘孜藏族自治州九龙县"
    ],
    [
        "name" => "雅江县",
        "pid" => 513300,
        "code" => 513325,
        "mark" => "四川省甘孜藏族自治州雅江县"
    ],
    [
        "name" => "道孚县",
        "pid" => 513300,
        "code" => 513326,
        "mark" => "四川省甘孜藏族自治州道孚县"
    ],
    [
        "name" => "炉霍县",
        "pid" => 513300,
        "code" => 513327,
        "mark" => "四川省甘孜藏族自治州炉霍县"
    ],
    [
        "name" => "甘孜县",
        "pid" => 513300,
        "code" => 513328,
        "mark" => "四川省甘孜藏族自治州甘孜县"
    ],
    [
        "name" => "新龙县",
        "pid" => 513300,
        "code" => 513329,
        "mark" => "四川省甘孜藏族自治州新龙县"
    ],
    [
        "name" => "德格县",
        "pid" => 513300,
        "code" => 513330,
        "mark" => "四川省甘孜藏族自治州德格县"
    ],
    [
        "name" => "白玉县",
        "pid" => 513300,
        "code" => 513331,
        "mark" => "四川省甘孜藏族自治州白玉县"
    ],
    [
        "name" => "石渠县",
        "pid" => 513300,
        "code" => 513332,
        "mark" => "四川省甘孜藏族自治州石渠县"
    ],
    [
        "name" => "色达县",
        "pid" => 513300,
        "code" => 513333,
        "mark" => "四川省甘孜藏族自治州色达县"
    ],
    [
        "name" => "理塘县",
        "pid" => 513300,
        "code" => 513334,
        "mark" => "四川省甘孜藏族自治州理塘县"
    ],
    [
        "name" => "巴塘县",
        "pid" => 513300,
        "code" => 513335,
        "mark" => "四川省甘孜藏族自治州巴塘县"
    ],
    [
        "name" => "乡城县",
        "pid" => 513300,
        "code" => 513336,
        "mark" => "四川省甘孜藏族自治州乡城县"
    ],
    [
        "name" => "稻城县",
        "pid" => 513300,
        "code" => 513337,
        "mark" => "四川省甘孜藏族自治州稻城县"
    ],
    [
        "name" => "得荣县",
        "pid" => 513300,
        "code" => 513338,
        "mark" => "四川省甘孜藏族自治州得荣县"
    ],
    [
        "name" => "凉山彝族自治州",
        "pid" => 510000,
        "code" => 513400,
        "mark" => "四川省凉山彝族自治州"
    ],
    [
        "name" => "西昌市",
        "pid" => 513400,
        "code" => 513401,
        "mark" => "四川省凉山彝族自治州西昌市"
    ],
    [
        "name" => "木里藏族自治县",
        "pid" => 513400,
        "code" => 513422,
        "mark" => "四川省凉山彝族自治州木里藏族自治县"
    ],
    [
        "name" => "盐源县",
        "pid" => 513400,
        "code" => 513423,
        "mark" => "四川省凉山彝族自治州盐源县"
    ],
    [
        "name" => "德昌县",
        "pid" => 513400,
        "code" => 513424,
        "mark" => "四川省凉山彝族自治州德昌县"
    ],
    [
        "name" => "会理县",
        "pid" => 513400,
        "code" => 513425,
        "mark" => "四川省凉山彝族自治州会理县"
    ],
    [
        "name" => "会东县",
        "pid" => 513400,
        "code" => 513426,
        "mark" => "四川省凉山彝族自治州会东县"
    ],
    [
        "name" => "宁南县",
        "pid" => 513400,
        "code" => 513427,
        "mark" => "四川省凉山彝族自治州宁南县"
    ],
    [
        "name" => "普格县",
        "pid" => 513400,
        "code" => 513428,
        "mark" => "四川省凉山彝族自治州普格县"
    ],
    [
        "name" => "布拖县",
        "pid" => 513400,
        "code" => 513429,
        "mark" => "四川省凉山彝族自治州布拖县"
    ],
    [
        "name" => "金阳县",
        "pid" => 513400,
        "code" => 513430,
        "mark" => "四川省凉山彝族自治州金阳县"
    ],
    [
        "name" => "昭觉县",
        "pid" => 513400,
        "code" => 513431,
        "mark" => "四川省凉山彝族自治州昭觉县"
    ],
    [
        "name" => "喜德县",
        "pid" => 513400,
        "code" => 513432,
        "mark" => "四川省凉山彝族自治州喜德县"
    ],
    [
        "name" => "冕宁县",
        "pid" => 513400,
        "code" => 513433,
        "mark" => "四川省凉山彝族自治州冕宁县"
    ],
    [
        "name" => "越西县",
        "pid" => 513400,
        "code" => 513434,
        "mark" => "四川省凉山彝族自治州越西县"
    ],
    [
        "name" => "甘洛县",
        "pid" => 513400,
        "code" => 513435,
        "mark" => "四川省凉山彝族自治州甘洛县"
    ],
    [
        "name" => "美姑县",
        "pid" => 513400,
        "code" => 513436,
        "mark" => "四川省凉山彝族自治州美姑县"
    ],
    [
        "name" => "雷波县",
        "pid" => 513400,
        "code" => 513437,
        "mark" => "四川省凉山彝族自治州雷波县"
    ],
    [
        "name" => "贵州省",
        "pid" => 86,
        "code" => 520000,
        "mark" => "贵州省"
    ],
    [
        "name" => "贵阳市",
        "pid" => 520000,
        "code" => 520100,
        "mark" => "贵州省贵阳市"
    ],
    [
        "name" => "南明区",
        "pid" => 520100,
        "code" => 520102,
        "mark" => "贵州省贵阳市南明区"
    ],
    [
        "name" => "云岩区",
        "pid" => 520100,
        "code" => 520103,
        "mark" => "贵州省贵阳市云岩区"
    ],
    [
        "name" => "花溪区",
        "pid" => 520100,
        "code" => 520111,
        "mark" => "贵州省贵阳市花溪区"
    ],
    [
        "name" => "乌当区",
        "pid" => 520100,
        "code" => 520112,
        "mark" => "贵州省贵阳市乌当区"
    ],
    [
        "name" => "白云区",
        "pid" => 520100,
        "code" => 520113,
        "mark" => "贵州省贵阳市白云区"
    ],
    [
        "name" => "观山湖区",
        "pid" => 520100,
        "code" => 520115,
        "mark" => "贵州省贵阳市观山湖区"
    ],
    [
        "name" => "开阳县",
        "pid" => 520100,
        "code" => 520121,
        "mark" => "贵州省贵阳市开阳县"
    ],
    [
        "name" => "息烽县",
        "pid" => 520100,
        "code" => 520122,
        "mark" => "贵州省贵阳市息烽县"
    ],
    [
        "name" => "修文县",
        "pid" => 520100,
        "code" => 520123,
        "mark" => "贵州省贵阳市修文县"
    ],
    [
        "name" => "清镇市",
        "pid" => 520100,
        "code" => 520181,
        "mark" => "贵州省贵阳市清镇市"
    ],
    [
        "name" => "六盘水市",
        "pid" => 520000,
        "code" => 520200,
        "mark" => "贵州省六盘水市"
    ],
    [
        "name" => "钟山区",
        "pid" => 520200,
        "code" => 520201,
        "mark" => "贵州省六盘水市钟山区"
    ],
    [
        "name" => "六枝特区",
        "pid" => 520200,
        "code" => 520203,
        "mark" => "贵州省六盘水市六枝特区"
    ],
    [
        "name" => "水城县",
        "pid" => 520200,
        "code" => 520221,
        "mark" => "贵州省六盘水市水城县"
    ],
    [
        "name" => "盘县",
        "pid" => 520200,
        "code" => 520222,
        "mark" => "贵州省六盘水市盘县"
    ],
    [
        "name" => "遵义市",
        "pid" => 520000,
        "code" => 520300,
        "mark" => "贵州省遵义市"
    ],
    [
        "name" => "红花岗区",
        "pid" => 520300,
        "code" => 520302,
        "mark" => "贵州省遵义市红花岗区"
    ],
    [
        "name" => "汇川区",
        "pid" => 520300,
        "code" => 520303,
        "mark" => "贵州省遵义市汇川区"
    ],
    [
        "name" => "播州区",
        "pid" => 520300,
        "code" => 520304,
        "mark" => "贵州省遵义市播州区"
    ],
    [
        "name" => "桐梓县",
        "pid" => 520300,
        "code" => 520322,
        "mark" => "贵州省遵义市桐梓县"
    ],
    [
        "name" => "绥阳县",
        "pid" => 520300,
        "code" => 520323,
        "mark" => "贵州省遵义市绥阳县"
    ],
    [
        "name" => "正安县",
        "pid" => 520300,
        "code" => 520324,
        "mark" => "贵州省遵义市正安县"
    ],
    [
        "name" => "道真仡佬族苗族自治县",
        "pid" => 520300,
        "code" => 520325,
        "mark" => "贵州省遵义市道真仡佬族苗族自治县"
    ],
    [
        "name" => "务川仡佬族苗族自治县",
        "pid" => 520300,
        "code" => 520326,
        "mark" => "贵州省遵义市务川仡佬族苗族自治县"
    ],
    [
        "name" => "凤冈县",
        "pid" => 520300,
        "code" => 520327,
        "mark" => "贵州省遵义市凤冈县"
    ],
    [
        "name" => "湄潭县",
        "pid" => 520300,
        "code" => 520328,
        "mark" => "贵州省遵义市湄潭县"
    ],
    [
        "name" => "余庆县",
        "pid" => 520300,
        "code" => 520329,
        "mark" => "贵州省遵义市余庆县"
    ],
    [
        "name" => "习水县",
        "pid" => 520300,
        "code" => 520330,
        "mark" => "贵州省遵义市习水县"
    ],
    [
        "name" => "赤水市",
        "pid" => 520300,
        "code" => 520381,
        "mark" => "贵州省遵义市赤水市"
    ],
    [
        "name" => "仁怀市",
        "pid" => 520300,
        "code" => 520382,
        "mark" => "贵州省遵义市仁怀市"
    ],
    [
        "name" => "安顺市",
        "pid" => 520000,
        "code" => 520400,
        "mark" => "贵州省安顺市"
    ],
    [
        "name" => "西秀区",
        "pid" => 520400,
        "code" => 520402,
        "mark" => "贵州省安顺市西秀区"
    ],
    [
        "name" => "平坝区",
        "pid" => 520400,
        "code" => 520403,
        "mark" => "贵州省安顺市平坝区"
    ],
    [
        "name" => "普定县",
        "pid" => 520400,
        "code" => 520422,
        "mark" => "贵州省安顺市普定县"
    ],
    [
        "name" => "镇宁布依族苗族自治县",
        "pid" => 520400,
        "code" => 520423,
        "mark" => "贵州省安顺市镇宁布依族苗族自治县"
    ],
    [
        "name" => "关岭布依族苗族自治县",
        "pid" => 520400,
        "code" => 520424,
        "mark" => "贵州省安顺市关岭布依族苗族自治县"
    ],
    [
        "name" => "紫云苗族布依族自治县",
        "pid" => 520400,
        "code" => 520425,
        "mark" => "贵州省安顺市紫云苗族布依族自治县"
    ],
    [
        "name" => "毕节市",
        "pid" => 520000,
        "code" => 520500,
        "mark" => "贵州省毕节市"
    ],
    [
        "name" => "七星关区",
        "pid" => 520500,
        "code" => 520502,
        "mark" => "贵州省毕节市七星关区"
    ],
    [
        "name" => "大方县",
        "pid" => 520500,
        "code" => 520521,
        "mark" => "贵州省毕节市大方县"
    ],
    [
        "name" => "黔西县",
        "pid" => 520500,
        "code" => 520522,
        "mark" => "贵州省毕节市黔西县"
    ],
    [
        "name" => "金沙县",
        "pid" => 520500,
        "code" => 520523,
        "mark" => "贵州省毕节市金沙县"
    ],
    [
        "name" => "织金县",
        "pid" => 520500,
        "code" => 520524,
        "mark" => "贵州省毕节市织金县"
    ],
    [
        "name" => "纳雍县",
        "pid" => 520500,
        "code" => 520525,
        "mark" => "贵州省毕节市纳雍县"
    ],
    [
        "name" => "威宁彝族回族苗族自治县",
        "pid" => 520500,
        "code" => 520526,
        "mark" => "贵州省毕节市威宁彝族回族苗族自治县"
    ],
    [
        "name" => "赫章县",
        "pid" => 520500,
        "code" => 520527,
        "mark" => "贵州省毕节市赫章县"
    ],
    [
        "name" => "铜仁市",
        "pid" => 520000,
        "code" => 520600,
        "mark" => "贵州省铜仁市"
    ],
    [
        "name" => "碧江区",
        "pid" => 520600,
        "code" => 520602,
        "mark" => "贵州省铜仁市碧江区"
    ],
    [
        "name" => "万山区",
        "pid" => 520600,
        "code" => 520603,
        "mark" => "贵州省铜仁市万山区"
    ],
    [
        "name" => "江口县",
        "pid" => 520600,
        "code" => 520621,
        "mark" => "贵州省铜仁市江口县"
    ],
    [
        "name" => "玉屏侗族自治县",
        "pid" => 520600,
        "code" => 520622,
        "mark" => "贵州省铜仁市玉屏侗族自治县"
    ],
    [
        "name" => "石阡县",
        "pid" => 520600,
        "code" => 520623,
        "mark" => "贵州省铜仁市石阡县"
    ],
    [
        "name" => "思南县",
        "pid" => 520600,
        "code" => 520624,
        "mark" => "贵州省铜仁市思南县"
    ],
    [
        "name" => "印江土家族苗族自治县",
        "pid" => 520600,
        "code" => 520625,
        "mark" => "贵州省铜仁市印江土家族苗族自治县"
    ],
    [
        "name" => "德江县",
        "pid" => 520600,
        "code" => 520626,
        "mark" => "贵州省铜仁市德江县"
    ],
    [
        "name" => "沿河土家族自治县",
        "pid" => 520600,
        "code" => 520627,
        "mark" => "贵州省铜仁市沿河土家族自治县"
    ],
    [
        "name" => "松桃苗族自治县",
        "pid" => 520600,
        "code" => 520628,
        "mark" => "贵州省铜仁市松桃苗族自治县"
    ],
    [
        "name" => "黔西南布依族苗族自治州",
        "pid" => 520000,
        "code" => 522300,
        "mark" => "贵州省黔西南布依族苗族自治州"
    ],
    [
        "name" => "兴义市",
        "pid" => 522300,
        "code" => 522301,
        "mark" => "贵州省黔西南布依族苗族自治州兴义市"
    ],
    [
        "name" => "兴仁县",
        "pid" => 522300,
        "code" => 522322,
        "mark" => "贵州省黔西南布依族苗族自治州兴仁县"
    ],
    [
        "name" => "普安县",
        "pid" => 522300,
        "code" => 522323,
        "mark" => "贵州省黔西南布依族苗族自治州普安县"
    ],
    [
        "name" => "晴隆县",
        "pid" => 522300,
        "code" => 522324,
        "mark" => "贵州省黔西南布依族苗族自治州晴隆县"
    ],
    [
        "name" => "贞丰县",
        "pid" => 522300,
        "code" => 522325,
        "mark" => "贵州省黔西南布依族苗族自治州贞丰县"
    ],
    [
        "name" => "望谟县",
        "pid" => 522300,
        "code" => 522326,
        "mark" => "贵州省黔西南布依族苗族自治州望谟县"
    ],
    [
        "name" => "册亨县",
        "pid" => 522300,
        "code" => 522327,
        "mark" => "贵州省黔西南布依族苗族自治州册亨县"
    ],
    [
        "name" => "安龙县",
        "pid" => 522300,
        "code" => 522328,
        "mark" => "贵州省黔西南布依族苗族自治州安龙县"
    ],
    [
        "name" => "黔东南苗族侗族自治州",
        "pid" => 520000,
        "code" => 522600,
        "mark" => "贵州省黔东南苗族侗族自治州"
    ],
    [
        "name" => "凯里市",
        "pid" => 522600,
        "code" => 522601,
        "mark" => "贵州省黔东南苗族侗族自治州凯里市"
    ],
    [
        "name" => "黄平县",
        "pid" => 522600,
        "code" => 522622,
        "mark" => "贵州省黔东南苗族侗族自治州黄平县"
    ],
    [
        "name" => "施秉县",
        "pid" => 522600,
        "code" => 522623,
        "mark" => "贵州省黔东南苗族侗族自治州施秉县"
    ],
    [
        "name" => "三穗县",
        "pid" => 522600,
        "code" => 522624,
        "mark" => "贵州省黔东南苗族侗族自治州三穗县"
    ],
    [
        "name" => "镇远县",
        "pid" => 522600,
        "code" => 522625,
        "mark" => "贵州省黔东南苗族侗族自治州镇远县"
    ],
    [
        "name" => "岑巩县",
        "pid" => 522600,
        "code" => 522626,
        "mark" => "贵州省黔东南苗族侗族自治州岑巩县"
    ],
    [
        "name" => "天柱县",
        "pid" => 522600,
        "code" => 522627,
        "mark" => "贵州省黔东南苗族侗族自治州天柱县"
    ],
    [
        "name" => "锦屏县",
        "pid" => 522600,
        "code" => 522628,
        "mark" => "贵州省黔东南苗族侗族自治州锦屏县"
    ],
    [
        "name" => "剑河县",
        "pid" => 522600,
        "code" => 522629,
        "mark" => "贵州省黔东南苗族侗族自治州剑河县"
    ],
    [
        "name" => "台江县",
        "pid" => 522600,
        "code" => 522630,
        "mark" => "贵州省黔东南苗族侗族自治州台江县"
    ],
    [
        "name" => "黎平县",
        "pid" => 522600,
        "code" => 522631,
        "mark" => "贵州省黔东南苗族侗族自治州黎平县"
    ],
    [
        "name" => "榕江县",
        "pid" => 522600,
        "code" => 522632,
        "mark" => "贵州省黔东南苗族侗族自治州榕江县"
    ],
    [
        "name" => "从江县",
        "pid" => 522600,
        "code" => 522633,
        "mark" => "贵州省黔东南苗族侗族自治州从江县"
    ],
    [
        "name" => "雷山县",
        "pid" => 522600,
        "code" => 522634,
        "mark" => "贵州省黔东南苗族侗族自治州雷山县"
    ],
    [
        "name" => "麻江县",
        "pid" => 522600,
        "code" => 522635,
        "mark" => "贵州省黔东南苗族侗族自治州麻江县"
    ],
    [
        "name" => "丹寨县",
        "pid" => 522600,
        "code" => 522636,
        "mark" => "贵州省黔东南苗族侗族自治州丹寨县"
    ],
    [
        "name" => "黔南布依族苗族自治州",
        "pid" => 520000,
        "code" => 522700,
        "mark" => "贵州省黔南布依族苗族自治州"
    ],
    [
        "name" => "都匀市",
        "pid" => 522700,
        "code" => 522701,
        "mark" => "贵州省黔南布依族苗族自治州都匀市"
    ],
    [
        "name" => "福泉市",
        "pid" => 522700,
        "code" => 522702,
        "mark" => "贵州省黔南布依族苗族自治州福泉市"
    ],
    [
        "name" => "荔波县",
        "pid" => 522700,
        "code" => 522722,
        "mark" => "贵州省黔南布依族苗族自治州荔波县"
    ],
    [
        "name" => "贵定县",
        "pid" => 522700,
        "code" => 522723,
        "mark" => "贵州省黔南布依族苗族自治州贵定县"
    ],
    [
        "name" => "瓮安县",
        "pid" => 522700,
        "code" => 522725,
        "mark" => "贵州省黔南布依族苗族自治州瓮安县"
    ],
    [
        "name" => "独山县",
        "pid" => 522700,
        "code" => 522726,
        "mark" => "贵州省黔南布依族苗族自治州独山县"
    ],
    [
        "name" => "平塘县",
        "pid" => 522700,
        "code" => 522727,
        "mark" => "贵州省黔南布依族苗族自治州平塘县"
    ],
    [
        "name" => "罗甸县",
        "pid" => 522700,
        "code" => 522728,
        "mark" => "贵州省黔南布依族苗族自治州罗甸县"
    ],
    [
        "name" => "长顺县",
        "pid" => 522700,
        "code" => 522729,
        "mark" => "贵州省黔南布依族苗族自治州长顺县"
    ],
    [
        "name" => "龙里县",
        "pid" => 522700,
        "code" => 522730,
        "mark" => "贵州省黔南布依族苗族自治州龙里县"
    ],
    [
        "name" => "惠水县",
        "pid" => 522700,
        "code" => 522731,
        "mark" => "贵州省黔南布依族苗族自治州惠水县"
    ],
    [
        "name" => "三都水族自治县",
        "pid" => 522700,
        "code" => 522732,
        "mark" => "贵州省黔南布依族苗族自治州三都水族自治县"
    ],
    [
        "name" => "云南省",
        "pid" => 86,
        "code" => 530000,
        "mark" => "云南省"
    ],
    [
        "name" => "昆明市",
        "pid" => 530000,
        "code" => 530100,
        "mark" => "云南省昆明市"
    ],
    [
        "name" => "五华区",
        "pid" => 530100,
        "code" => 530102,
        "mark" => "云南省昆明市五华区"
    ],
    [
        "name" => "盘龙区",
        "pid" => 530100,
        "code" => 530103,
        "mark" => "云南省昆明市盘龙区"
    ],
    [
        "name" => "官渡区",
        "pid" => 530100,
        "code" => 530111,
        "mark" => "云南省昆明市官渡区"
    ],
    [
        "name" => "西山区",
        "pid" => 530100,
        "code" => 530112,
        "mark" => "云南省昆明市西山区"
    ],
    [
        "name" => "东川区",
        "pid" => 530100,
        "code" => 530113,
        "mark" => "云南省昆明市东川区"
    ],
    [
        "name" => "呈贡区",
        "pid" => 530100,
        "code" => 530114,
        "mark" => "云南省昆明市呈贡区"
    ],
    [
        "name" => "晋宁县",
        "pid" => 530100,
        "code" => 530122,
        "mark" => "云南省昆明市晋宁县"
    ],
    [
        "name" => "富民县",
        "pid" => 530100,
        "code" => 530124,
        "mark" => "云南省昆明市富民县"
    ],
    [
        "name" => "宜良县",
        "pid" => 530100,
        "code" => 530125,
        "mark" => "云南省昆明市宜良县"
    ],
    [
        "name" => "石林彝族自治县",
        "pid" => 530100,
        "code" => 530126,
        "mark" => "云南省昆明市石林彝族自治县"
    ],
    [
        "name" => "嵩明县",
        "pid" => 530100,
        "code" => 530127,
        "mark" => "云南省昆明市嵩明县"
    ],
    [
        "name" => "禄劝彝族苗族自治县",
        "pid" => 530100,
        "code" => 530128,
        "mark" => "云南省昆明市禄劝彝族苗族自治县"
    ],
    [
        "name" => "寻甸回族彝族自治县",
        "pid" => 530100,
        "code" => 530129,
        "mark" => "云南省昆明市寻甸回族彝族自治县"
    ],
    [
        "name" => "安宁市",
        "pid" => 530100,
        "code" => 530181,
        "mark" => "云南省昆明市安宁市"
    ],
    [
        "name" => "曲靖市",
        "pid" => 530000,
        "code" => 530300,
        "mark" => "云南省曲靖市"
    ],
    [
        "name" => "麒麟区",
        "pid" => 530300,
        "code" => 530302,
        "mark" => "云南省曲靖市麒麟区"
    ],
    [
        "name" => "沾益区",
        "pid" => 530300,
        "code" => 530303,
        "mark" => "云南省曲靖市沾益区"
    ],
    [
        "name" => "马龙县",
        "pid" => 530300,
        "code" => 530321,
        "mark" => "云南省曲靖市马龙县"
    ],
    [
        "name" => "陆良县",
        "pid" => 530300,
        "code" => 530322,
        "mark" => "云南省曲靖市陆良县"
    ],
    [
        "name" => "师宗县",
        "pid" => 530300,
        "code" => 530323,
        "mark" => "云南省曲靖市师宗县"
    ],
    [
        "name" => "罗平县",
        "pid" => 530300,
        "code" => 530324,
        "mark" => "云南省曲靖市罗平县"
    ],
    [
        "name" => "富源县",
        "pid" => 530300,
        "code" => 530325,
        "mark" => "云南省曲靖市富源县"
    ],
    [
        "name" => "会泽县",
        "pid" => 530300,
        "code" => 530326,
        "mark" => "云南省曲靖市会泽县"
    ],
    [
        "name" => "宣威市",
        "pid" => 530300,
        "code" => 530381,
        "mark" => "云南省曲靖市宣威市"
    ],
    [
        "name" => "玉溪市",
        "pid" => 530000,
        "code" => 530400,
        "mark" => "云南省玉溪市"
    ],
    [
        "name" => "红塔区",
        "pid" => 530400,
        "code" => 530402,
        "mark" => "云南省玉溪市红塔区"
    ],
    [
        "name" => "江川区",
        "pid" => 530400,
        "code" => 530403,
        "mark" => "云南省玉溪市江川区"
    ],
    [
        "name" => "澄江县",
        "pid" => 530400,
        "code" => 530422,
        "mark" => "云南省玉溪市澄江县"
    ],
    [
        "name" => "通海县",
        "pid" => 530400,
        "code" => 530423,
        "mark" => "云南省玉溪市通海县"
    ],
    [
        "name" => "华宁县",
        "pid" => 530400,
        "code" => 530424,
        "mark" => "云南省玉溪市华宁县"
    ],
    [
        "name" => "易门县",
        "pid" => 530400,
        "code" => 530425,
        "mark" => "云南省玉溪市易门县"
    ],
    [
        "name" => "峨山彝族自治县",
        "pid" => 530400,
        "code" => 530426,
        "mark" => "云南省玉溪市峨山彝族自治县"
    ],
    [
        "name" => "新平彝族傣族自治县",
        "pid" => 530400,
        "code" => 530427,
        "mark" => "云南省玉溪市新平彝族傣族自治县"
    ],
    [
        "name" => "元江哈尼族彝族傣族自治县",
        "pid" => 530400,
        "code" => 530428,
        "mark" => "云南省玉溪市元江哈尼族彝族傣族自治县"
    ],
    [
        "name" => "保山市",
        "pid" => 530000,
        "code" => 530500,
        "mark" => "云南省保山市"
    ],
    [
        "name" => "隆阳区",
        "pid" => 530500,
        "code" => 530502,
        "mark" => "云南省保山市隆阳区"
    ],
    [
        "name" => "施甸县",
        "pid" => 530500,
        "code" => 530521,
        "mark" => "云南省保山市施甸县"
    ],
    [
        "name" => "龙陵县",
        "pid" => 530500,
        "code" => 530523,
        "mark" => "云南省保山市龙陵县"
    ],
    [
        "name" => "昌宁县",
        "pid" => 530500,
        "code" => 530524,
        "mark" => "云南省保山市昌宁县"
    ],
    [
        "name" => "腾冲市",
        "pid" => 530500,
        "code" => 530581,
        "mark" => "云南省保山市腾冲市"
    ],
    [
        "name" => "昭通市",
        "pid" => 530000,
        "code" => 530600,
        "mark" => "云南省昭通市"
    ],
    [
        "name" => "昭阳区",
        "pid" => 530600,
        "code" => 530602,
        "mark" => "云南省昭通市昭阳区"
    ],
    [
        "name" => "鲁甸县",
        "pid" => 530600,
        "code" => 530621,
        "mark" => "云南省昭通市鲁甸县"
    ],
    [
        "name" => "巧家县",
        "pid" => 530600,
        "code" => 530622,
        "mark" => "云南省昭通市巧家县"
    ],
    [
        "name" => "盐津县",
        "pid" => 530600,
        "code" => 530623,
        "mark" => "云南省昭通市盐津县"
    ],
    [
        "name" => "大关县",
        "pid" => 530600,
        "code" => 530624,
        "mark" => "云南省昭通市大关县"
    ],
    [
        "name" => "永善县",
        "pid" => 530600,
        "code" => 530625,
        "mark" => "云南省昭通市永善县"
    ],
    [
        "name" => "绥江县",
        "pid" => 530600,
        "code" => 530626,
        "mark" => "云南省昭通市绥江县"
    ],
    [
        "name" => "镇雄县",
        "pid" => 530600,
        "code" => 530627,
        "mark" => "云南省昭通市镇雄县"
    ],
    [
        "name" => "彝良县",
        "pid" => 530600,
        "code" => 530628,
        "mark" => "云南省昭通市彝良县"
    ],
    [
        "name" => "威信县",
        "pid" => 530600,
        "code" => 530629,
        "mark" => "云南省昭通市威信县"
    ],
    [
        "name" => "水富县",
        "pid" => 530600,
        "code" => 530630,
        "mark" => "云南省昭通市水富县"
    ],
    [
        "name" => "丽江市",
        "pid" => 530000,
        "code" => 530700,
        "mark" => "云南省丽江市"
    ],
    [
        "name" => "古城区",
        "pid" => 530700,
        "code" => 530702,
        "mark" => "云南省丽江市古城区"
    ],
    [
        "name" => "玉龙纳西族自治县",
        "pid" => 530700,
        "code" => 530721,
        "mark" => "云南省丽江市玉龙纳西族自治县"
    ],
    [
        "name" => "永胜县",
        "pid" => 530700,
        "code" => 530722,
        "mark" => "云南省丽江市永胜县"
    ],
    [
        "name" => "华坪县",
        "pid" => 530700,
        "code" => 530723,
        "mark" => "云南省丽江市华坪县"
    ],
    [
        "name" => "宁蒗彝族自治县",
        "pid" => 530700,
        "code" => 530724,
        "mark" => "云南省丽江市宁蒗彝族自治县"
    ],
    [
        "name" => "普洱市",
        "pid" => 530000,
        "code" => 530800,
        "mark" => "云南省普洱市"
    ],
    [
        "name" => "思茅区",
        "pid" => 530800,
        "code" => 530802,
        "mark" => "云南省普洱市思茅区"
    ],
    [
        "name" => "宁洱哈尼族彝族自治县",
        "pid" => 530800,
        "code" => 530821,
        "mark" => "云南省普洱市宁洱哈尼族彝族自治县"
    ],
    [
        "name" => "墨江哈尼族自治县",
        "pid" => 530800,
        "code" => 530822,
        "mark" => "云南省普洱市墨江哈尼族自治县"
    ],
    [
        "name" => "景东彝族自治县",
        "pid" => 530800,
        "code" => 530823,
        "mark" => "云南省普洱市景东彝族自治县"
    ],
    [
        "name" => "景谷傣族彝族自治县",
        "pid" => 530800,
        "code" => 530824,
        "mark" => "云南省普洱市景谷傣族彝族自治县"
    ],
    [
        "name" => "镇沅彝族哈尼族拉祜族自治县",
        "pid" => 530800,
        "code" => 530825,
        "mark" => "云南省普洱市镇沅彝族哈尼族拉祜族自治县"
    ],
    [
        "name" => "江城哈尼族彝族自治县",
        "pid" => 530800,
        "code" => 530826,
        "mark" => "云南省普洱市江城哈尼族彝族自治县"
    ],
    [
        "name" => "孟连傣族拉祜族佤族自治县",
        "pid" => 530800,
        "code" => 530827,
        "mark" => "云南省普洱市孟连傣族拉祜族佤族自治县"
    ],
    [
        "name" => "澜沧拉祜族自治县",
        "pid" => 530800,
        "code" => 530828,
        "mark" => "云南省普洱市澜沧拉祜族自治县"
    ],
    [
        "name" => "西盟佤族自治县",
        "pid" => 530800,
        "code" => 530829,
        "mark" => "云南省普洱市西盟佤族自治县"
    ],
    [
        "name" => "临沧市",
        "pid" => 530000,
        "code" => 530900,
        "mark" => "云南省临沧市"
    ],
    [
        "name" => "临翔区",
        "pid" => 530900,
        "code" => 530902,
        "mark" => "云南省临沧市临翔区"
    ],
    [
        "name" => "凤庆县",
        "pid" => 530900,
        "code" => 530921,
        "mark" => "云南省临沧市凤庆县"
    ],
    [
        "name" => "云县",
        "pid" => 530900,
        "code" => 530922,
        "mark" => "云南省临沧市云县"
    ],
    [
        "name" => "永德县",
        "pid" => 530900,
        "code" => 530923,
        "mark" => "云南省临沧市永德县"
    ],
    [
        "name" => "镇康县",
        "pid" => 530900,
        "code" => 530924,
        "mark" => "云南省临沧市镇康县"
    ],
    [
        "name" => "双江拉祜族佤族布朗族傣族自治县",
        "pid" => 530900,
        "code" => 530925,
        "mark" => "云南省临沧市双江拉祜族佤族布朗族傣族自治县"
    ],
    [
        "name" => "耿马傣族佤族自治县",
        "pid" => 530900,
        "code" => 530926,
        "mark" => "云南省临沧市耿马傣族佤族自治县"
    ],
    [
        "name" => "沧源佤族自治县",
        "pid" => 530900,
        "code" => 530927,
        "mark" => "云南省临沧市沧源佤族自治县"
    ],
    [
        "name" => "楚雄彝族自治州",
        "pid" => 530000,
        "code" => 532300,
        "mark" => "云南省楚雄彝族自治州"
    ],
    [
        "name" => "楚雄市",
        "pid" => 532300,
        "code" => 532301,
        "mark" => "云南省楚雄彝族自治州楚雄市"
    ],
    [
        "name" => "双柏县",
        "pid" => 532300,
        "code" => 532322,
        "mark" => "云南省楚雄彝族自治州双柏县"
    ],
    [
        "name" => "牟定县",
        "pid" => 532300,
        "code" => 532323,
        "mark" => "云南省楚雄彝族自治州牟定县"
    ],
    [
        "name" => "南华县",
        "pid" => 532300,
        "code" => 532324,
        "mark" => "云南省楚雄彝族自治州南华县"
    ],
    [
        "name" => "姚安县",
        "pid" => 532300,
        "code" => 532325,
        "mark" => "云南省楚雄彝族自治州姚安县"
    ],
    [
        "name" => "大姚县",
        "pid" => 532300,
        "code" => 532326,
        "mark" => "云南省楚雄彝族自治州大姚县"
    ],
    [
        "name" => "永仁县",
        "pid" => 532300,
        "code" => 532327,
        "mark" => "云南省楚雄彝族自治州永仁县"
    ],
    [
        "name" => "元谋县",
        "pid" => 532300,
        "code" => 532328,
        "mark" => "云南省楚雄彝族自治州元谋县"
    ],
    [
        "name" => "武定县",
        "pid" => 532300,
        "code" => 532329,
        "mark" => "云南省楚雄彝族自治州武定县"
    ],
    [
        "name" => "禄丰县",
        "pid" => 532300,
        "code" => 532331,
        "mark" => "云南省楚雄彝族自治州禄丰县"
    ],
    [
        "name" => "红河哈尼族彝族自治州",
        "pid" => 530000,
        "code" => 532500,
        "mark" => "云南省红河哈尼族彝族自治州"
    ],
    [
        "name" => "个旧市",
        "pid" => 532500,
        "code" => 532501,
        "mark" => "云南省红河哈尼族彝族自治州个旧市"
    ],
    [
        "name" => "开远市",
        "pid" => 532500,
        "code" => 532502,
        "mark" => "云南省红河哈尼族彝族自治州开远市"
    ],
    [
        "name" => "蒙自市",
        "pid" => 532500,
        "code" => 532503,
        "mark" => "云南省红河哈尼族彝族自治州蒙自市"
    ],
    [
        "name" => "弥勒市",
        "pid" => 532500,
        "code" => 532504,
        "mark" => "云南省红河哈尼族彝族自治州弥勒市"
    ],
    [
        "name" => "屏边苗族自治县",
        "pid" => 532500,
        "code" => 532523,
        "mark" => "云南省红河哈尼族彝族自治州屏边苗族自治县"
    ],
    [
        "name" => "建水县",
        "pid" => 532500,
        "code" => 532524,
        "mark" => "云南省红河哈尼族彝族自治州建水县"
    ],
    [
        "name" => "石屏县",
        "pid" => 532500,
        "code" => 532525,
        "mark" => "云南省红河哈尼族彝族自治州石屏县"
    ],
    [
        "name" => "泸西县",
        "pid" => 532500,
        "code" => 532527,
        "mark" => "云南省红河哈尼族彝族自治州泸西县"
    ],
    [
        "name" => "元阳县",
        "pid" => 532500,
        "code" => 532528,
        "mark" => "云南省红河哈尼族彝族自治州元阳县"
    ],
    [
        "name" => "红河县",
        "pid" => 532500,
        "code" => 532529,
        "mark" => "云南省红河哈尼族彝族自治州红河县"
    ],
    [
        "name" => "金平苗族瑶族傣族自治县",
        "pid" => 532500,
        "code" => 532530,
        "mark" => "云南省红河哈尼族彝族自治州金平苗族瑶族傣族自治县"
    ],
    [
        "name" => "绿春县",
        "pid" => 532500,
        "code" => 532531,
        "mark" => "云南省红河哈尼族彝族自治州绿春县"
    ],
    [
        "name" => "河口瑶族自治县",
        "pid" => 532500,
        "code" => 532532,
        "mark" => "云南省红河哈尼族彝族自治州河口瑶族自治县"
    ],
    [
        "name" => "文山壮族苗族自治州",
        "pid" => 530000,
        "code" => 532600,
        "mark" => "云南省文山壮族苗族自治州"
    ],
    [
        "name" => "文山市",
        "pid" => 532600,
        "code" => 532601,
        "mark" => "云南省文山壮族苗族自治州文山市"
    ],
    [
        "name" => "砚山县",
        "pid" => 532600,
        "code" => 532622,
        "mark" => "云南省文山壮族苗族自治州砚山县"
    ],
    [
        "name" => "西畴县",
        "pid" => 532600,
        "code" => 532623,
        "mark" => "云南省文山壮族苗族自治州西畴县"
    ],
    [
        "name" => "麻栗坡县",
        "pid" => 532600,
        "code" => 532624,
        "mark" => "云南省文山壮族苗族自治州麻栗坡县"
    ],
    [
        "name" => "马关县",
        "pid" => 532600,
        "code" => 532625,
        "mark" => "云南省文山壮族苗族自治州马关县"
    ],
    [
        "name" => "丘北县",
        "pid" => 532600,
        "code" => 532626,
        "mark" => "云南省文山壮族苗族自治州丘北县"
    ],
    [
        "name" => "广南县",
        "pid" => 532600,
        "code" => 532627,
        "mark" => "云南省文山壮族苗族自治州广南县"
    ],
    [
        "name" => "富宁县",
        "pid" => 532600,
        "code" => 532628,
        "mark" => "云南省文山壮族苗族自治州富宁县"
    ],
    [
        "name" => "西双版纳傣族自治州",
        "pid" => 530000,
        "code" => 532800,
        "mark" => "云南省西双版纳傣族自治州"
    ],
    [
        "name" => "景洪市",
        "pid" => 532800,
        "code" => 532801,
        "mark" => "云南省西双版纳傣族自治州景洪市"
    ],
    [
        "name" => "勐海县",
        "pid" => 532800,
        "code" => 532822,
        "mark" => "云南省西双版纳傣族自治州勐海县"
    ],
    [
        "name" => "勐腊县",
        "pid" => 532800,
        "code" => 532823,
        "mark" => "云南省西双版纳傣族自治州勐腊县"
    ],
    [
        "name" => "大理白族自治州",
        "pid" => 530000,
        "code" => 532900,
        "mark" => "云南省大理白族自治州"
    ],
    [
        "name" => "大理市",
        "pid" => 532900,
        "code" => 532901,
        "mark" => "云南省大理白族自治州大理市"
    ],
    [
        "name" => "漾濞彝族自治县",
        "pid" => 532900,
        "code" => 532922,
        "mark" => "云南省大理白族自治州漾濞彝族自治县"
    ],
    [
        "name" => "祥云县",
        "pid" => 532900,
        "code" => 532923,
        "mark" => "云南省大理白族自治州祥云县"
    ],
    [
        "name" => "宾川县",
        "pid" => 532900,
        "code" => 532924,
        "mark" => "云南省大理白族自治州宾川县"
    ],
    [
        "name" => "弥渡县",
        "pid" => 532900,
        "code" => 532925,
        "mark" => "云南省大理白族自治州弥渡县"
    ],
    [
        "name" => "南涧彝族自治县",
        "pid" => 532900,
        "code" => 532926,
        "mark" => "云南省大理白族自治州南涧彝族自治县"
    ],
    [
        "name" => "巍山彝族回族自治县",
        "pid" => 532900,
        "code" => 532927,
        "mark" => "云南省大理白族自治州巍山彝族回族自治县"
    ],
    [
        "name" => "永平县",
        "pid" => 532900,
        "code" => 532928,
        "mark" => "云南省大理白族自治州永平县"
    ],
    [
        "name" => "云龙县",
        "pid" => 532900,
        "code" => 532929,
        "mark" => "云南省大理白族自治州云龙县"
    ],
    [
        "name" => "洱源县",
        "pid" => 532900,
        "code" => 532930,
        "mark" => "云南省大理白族自治州洱源县"
    ],
    [
        "name" => "剑川县",
        "pid" => 532900,
        "code" => 532931,
        "mark" => "云南省大理白族自治州剑川县"
    ],
    [
        "name" => "鹤庆县",
        "pid" => 532900,
        "code" => 532932,
        "mark" => "云南省大理白族自治州鹤庆县"
    ],
    [
        "name" => "德宏傣族景颇族自治州",
        "pid" => 530000,
        "code" => 533100,
        "mark" => "云南省德宏傣族景颇族自治州"
    ],
    [
        "name" => "瑞丽市",
        "pid" => 533100,
        "code" => 533102,
        "mark" => "云南省德宏傣族景颇族自治州瑞丽市"
    ],
    [
        "name" => "芒市",
        "pid" => 533100,
        "code" => 533103,
        "mark" => "云南省德宏傣族景颇族自治州芒市"
    ],
    [
        "name" => "梁河县",
        "pid" => 533100,
        "code" => 533122,
        "mark" => "云南省德宏傣族景颇族自治州梁河县"
    ],
    [
        "name" => "盈江县",
        "pid" => 533100,
        "code" => 533123,
        "mark" => "云南省德宏傣族景颇族自治州盈江县"
    ],
    [
        "name" => "陇川县",
        "pid" => 533100,
        "code" => 533124,
        "mark" => "云南省德宏傣族景颇族自治州陇川县"
    ],
    [
        "name" => "怒江傈僳族自治州",
        "pid" => 530000,
        "code" => 533300,
        "mark" => "云南省怒江傈僳族自治州"
    ],
    [
        "name" => "泸水市",
        "pid" => 533300,
        "code" => 533301,
        "mark" => "云南省怒江傈僳族自治州泸水市"
    ],
    [
        "name" => "福贡县",
        "pid" => 533300,
        "code" => 533323,
        "mark" => "云南省怒江傈僳族自治州福贡县"
    ],
    [
        "name" => "贡山独龙族怒族自治县",
        "pid" => 533300,
        "code" => 533324,
        "mark" => "云南省怒江傈僳族自治州贡山独龙族怒族自治县"
    ],
    [
        "name" => "兰坪白族普米族自治县",
        "pid" => 533300,
        "code" => 533325,
        "mark" => "云南省怒江傈僳族自治州兰坪白族普米族自治县"
    ],
    [
        "name" => "迪庆藏族自治州",
        "pid" => 530000,
        "code" => 533400,
        "mark" => "云南省迪庆藏族自治州"
    ],
    [
        "name" => "香格里拉市",
        "pid" => 533400,
        "code" => 533401,
        "mark" => "云南省迪庆藏族自治州香格里拉市"
    ],
    [
        "name" => "德钦县",
        "pid" => 533400,
        "code" => 533422,
        "mark" => "云南省迪庆藏族自治州德钦县"
    ],
    [
        "name" => "维西傈僳族自治县",
        "pid" => 533400,
        "code" => 533423,
        "mark" => "云南省迪庆藏族自治州维西傈僳族自治县"
    ],
    [
        "name" => "西藏自治区",
        "pid" => 86,
        "code" => 540000,
        "mark" => "西藏自治区"
    ],
    [
        "name" => "拉萨市",
        "pid" => 540000,
        "code" => 540100,
        "mark" => "西藏自治区拉萨市"
    ],
    [
        "name" => "城关区",
        "pid" => 540100,
        "code" => 540102,
        "mark" => "西藏自治区拉萨市城关区"
    ],
    [
        "name" => "堆龙德庆区",
        "pid" => 540100,
        "code" => 540103,
        "mark" => "西藏自治区拉萨市堆龙德庆区"
    ],
    [
        "name" => "林周县",
        "pid" => 540100,
        "code" => 540121,
        "mark" => "西藏自治区拉萨市林周县"
    ],
    [
        "name" => "当雄县",
        "pid" => 540100,
        "code" => 540122,
        "mark" => "西藏自治区拉萨市当雄县"
    ],
    [
        "name" => "尼木县",
        "pid" => 540100,
        "code" => 540123,
        "mark" => "西藏自治区拉萨市尼木县"
    ],
    [
        "name" => "曲水县",
        "pid" => 540100,
        "code" => 540124,
        "mark" => "西藏自治区拉萨市曲水县"
    ],
    [
        "name" => "达孜县",
        "pid" => 540100,
        "code" => 540126,
        "mark" => "西藏自治区拉萨市达孜县"
    ],
    [
        "name" => "墨竹工卡县",
        "pid" => 540100,
        "code" => 540127,
        "mark" => "西藏自治区拉萨市墨竹工卡县"
    ],
    [
        "name" => "日喀则市",
        "pid" => 540000,
        "code" => 540200,
        "mark" => "西藏自治区日喀则市"
    ],
    [
        "name" => "桑珠孜区",
        "pid" => 540200,
        "code" => 540202,
        "mark" => "西藏自治区日喀则市桑珠孜区"
    ],
    [
        "name" => "南木林县",
        "pid" => 540200,
        "code" => 540221,
        "mark" => "西藏自治区日喀则市南木林县"
    ],
    [
        "name" => "江孜县",
        "pid" => 540200,
        "code" => 540222,
        "mark" => "西藏自治区日喀则市江孜县"
    ],
    [
        "name" => "定日县",
        "pid" => 540200,
        "code" => 540223,
        "mark" => "西藏自治区日喀则市定日县"
    ],
    [
        "name" => "萨迦县",
        "pid" => 540200,
        "code" => 540224,
        "mark" => "西藏自治区日喀则市萨迦县"
    ],
    [
        "name" => "拉孜县",
        "pid" => 540200,
        "code" => 540225,
        "mark" => "西藏自治区日喀则市拉孜县"
    ],
    [
        "name" => "昂仁县",
        "pid" => 540200,
        "code" => 540226,
        "mark" => "西藏自治区日喀则市昂仁县"
    ],
    [
        "name" => "谢通门县",
        "pid" => 540200,
        "code" => 540227,
        "mark" => "西藏自治区日喀则市谢通门县"
    ],
    [
        "name" => "白朗县",
        "pid" => 540200,
        "code" => 540228,
        "mark" => "西藏自治区日喀则市白朗县"
    ],
    [
        "name" => "仁布县",
        "pid" => 540200,
        "code" => 540229,
        "mark" => "西藏自治区日喀则市仁布县"
    ],
    [
        "name" => "康马县",
        "pid" => 540200,
        "code" => 540230,
        "mark" => "西藏自治区日喀则市康马县"
    ],
    [
        "name" => "定结县",
        "pid" => 540200,
        "code" => 540231,
        "mark" => "西藏自治区日喀则市定结县"
    ],
    [
        "name" => "仲巴县",
        "pid" => 540200,
        "code" => 540232,
        "mark" => "西藏自治区日喀则市仲巴县"
    ],
    [
        "name" => "亚东县",
        "pid" => 540200,
        "code" => 540233,
        "mark" => "西藏自治区日喀则市亚东县"
    ],
    [
        "name" => "吉隆县",
        "pid" => 540200,
        "code" => 540234,
        "mark" => "西藏自治区日喀则市吉隆县"
    ],
    [
        "name" => "聂拉木县",
        "pid" => 540200,
        "code" => 540235,
        "mark" => "西藏自治区日喀则市聂拉木县"
    ],
    [
        "name" => "萨嘎县",
        "pid" => 540200,
        "code" => 540236,
        "mark" => "西藏自治区日喀则市萨嘎县"
    ],
    [
        "name" => "岗巴县",
        "pid" => 540200,
        "code" => 540237,
        "mark" => "西藏自治区日喀则市岗巴县"
    ],
    [
        "name" => "昌都市",
        "pid" => 540000,
        "code" => 540300,
        "mark" => "西藏自治区昌都市"
    ],
    [
        "name" => "卡若区",
        "pid" => 540300,
        "code" => 540302,
        "mark" => "西藏自治区昌都市卡若区"
    ],
    [
        "name" => "江达县",
        "pid" => 540300,
        "code" => 540321,
        "mark" => "西藏自治区昌都市江达县"
    ],
    [
        "name" => "贡觉县",
        "pid" => 540300,
        "code" => 540322,
        "mark" => "西藏自治区昌都市贡觉县"
    ],
    [
        "name" => "类乌齐县",
        "pid" => 540300,
        "code" => 540323,
        "mark" => "西藏自治区昌都市类乌齐县"
    ],
    [
        "name" => "丁青县",
        "pid" => 540300,
        "code" => 540324,
        "mark" => "西藏自治区昌都市丁青县"
    ],
    [
        "name" => "察雅县",
        "pid" => 540300,
        "code" => 540325,
        "mark" => "西藏自治区昌都市察雅县"
    ],
    [
        "name" => "八宿县",
        "pid" => 540300,
        "code" => 540326,
        "mark" => "西藏自治区昌都市八宿县"
    ],
    [
        "name" => "左贡县",
        "pid" => 540300,
        "code" => 540327,
        "mark" => "西藏自治区昌都市左贡县"
    ],
    [
        "name" => "芒康县",
        "pid" => 540300,
        "code" => 540328,
        "mark" => "西藏自治区昌都市芒康县"
    ],
    [
        "name" => "洛隆县",
        "pid" => 540300,
        "code" => 540329,
        "mark" => "西藏自治区昌都市洛隆县"
    ],
    [
        "name" => "边坝县",
        "pid" => 540300,
        "code" => 540330,
        "mark" => "西藏自治区昌都市边坝县"
    ],
    [
        "name" => "林芝市",
        "pid" => 540000,
        "code" => 540400,
        "mark" => "西藏自治区林芝市"
    ],
    [
        "name" => "巴宜区",
        "pid" => 540400,
        "code" => 540402,
        "mark" => "西藏自治区林芝市巴宜区"
    ],
    [
        "name" => "工布江达县",
        "pid" => 540400,
        "code" => 540421,
        "mark" => "西藏自治区林芝市工布江达县"
    ],
    [
        "name" => "米林县",
        "pid" => 540400,
        "code" => 540422,
        "mark" => "西藏自治区林芝市米林县"
    ],
    [
        "name" => "墨脱县",
        "pid" => 540400,
        "code" => 540423,
        "mark" => "西藏自治区林芝市墨脱县"
    ],
    [
        "name" => "波密县",
        "pid" => 540400,
        "code" => 540424,
        "mark" => "西藏自治区林芝市波密县"
    ],
    [
        "name" => "察隅县",
        "pid" => 540400,
        "code" => 540425,
        "mark" => "西藏自治区林芝市察隅县"
    ],
    [
        "name" => "朗县",
        "pid" => 540400,
        "code" => 540426,
        "mark" => "西藏自治区林芝市朗县"
    ],
    [
        "name" => "山南市",
        "pid" => 540000,
        "code" => 540500,
        "mark" => "西藏自治区山南市"
    ],
    [
        "name" => "乃东区",
        "pid" => 540500,
        "code" => 540502,
        "mark" => "西藏自治区山南市乃东区"
    ],
    [
        "name" => "扎囊县",
        "pid" => 540500,
        "code" => 540521,
        "mark" => "西藏自治区山南市扎囊县"
    ],
    [
        "name" => "贡嘎县",
        "pid" => 540500,
        "code" => 540522,
        "mark" => "西藏自治区山南市贡嘎县"
    ],
    [
        "name" => "桑日县",
        "pid" => 540500,
        "code" => 540523,
        "mark" => "西藏自治区山南市桑日县"
    ],
    [
        "name" => "琼结县",
        "pid" => 540500,
        "code" => 540524,
        "mark" => "西藏自治区山南市琼结县"
    ],
    [
        "name" => "曲松县",
        "pid" => 540500,
        "code" => 540525,
        "mark" => "西藏自治区山南市曲松县"
    ],
    [
        "name" => "措美县",
        "pid" => 540500,
        "code" => 540526,
        "mark" => "西藏自治区山南市措美县"
    ],
    [
        "name" => "洛扎县",
        "pid" => 540500,
        "code" => 540527,
        "mark" => "西藏自治区山南市洛扎县"
    ],
    [
        "name" => "加查县",
        "pid" => 540500,
        "code" => 540528,
        "mark" => "西藏自治区山南市加查县"
    ],
    [
        "name" => "隆子县",
        "pid" => 540500,
        "code" => 540529,
        "mark" => "西藏自治区山南市隆子县"
    ],
    [
        "name" => "错那县",
        "pid" => 540500,
        "code" => 540530,
        "mark" => "西藏自治区山南市错那县"
    ],
    [
        "name" => "浪卡子县",
        "pid" => 540500,
        "code" => 540531,
        "mark" => "西藏自治区山南市浪卡子县"
    ],
    [
        "name" => "那曲地区",
        "pid" => 540000,
        "code" => 542400,
        "mark" => "西藏自治区那曲地区"
    ],
    [
        "name" => "那曲县",
        "pid" => 542400,
        "code" => 542421,
        "mark" => "西藏自治区那曲地区那曲县"
    ],
    [
        "name" => "嘉黎县",
        "pid" => 542400,
        "code" => 542422,
        "mark" => "西藏自治区那曲地区嘉黎县"
    ],
    [
        "name" => "比如县",
        "pid" => 542400,
        "code" => 542423,
        "mark" => "西藏自治区那曲地区比如县"
    ],
    [
        "name" => "聂荣县",
        "pid" => 542400,
        "code" => 542424,
        "mark" => "西藏自治区那曲地区聂荣县"
    ],
    [
        "name" => "安多县",
        "pid" => 542400,
        "code" => 542425,
        "mark" => "西藏自治区那曲地区安多县"
    ],
    [
        "name" => "申扎县",
        "pid" => 542400,
        "code" => 542426,
        "mark" => "西藏自治区那曲地区申扎县"
    ],
    [
        "name" => "索县",
        "pid" => 542400,
        "code" => 542427,
        "mark" => "西藏自治区那曲地区索县"
    ],
    [
        "name" => "班戈县",
        "pid" => 542400,
        "code" => 542428,
        "mark" => "西藏自治区那曲地区班戈县"
    ],
    [
        "name" => "巴青县",
        "pid" => 542400,
        "code" => 542429,
        "mark" => "西藏自治区那曲地区巴青县"
    ],
    [
        "name" => "尼玛县",
        "pid" => 542400,
        "code" => 542430,
        "mark" => "西藏自治区那曲地区尼玛县"
    ],
    [
        "name" => "双湖县",
        "pid" => 542400,
        "code" => 542431,
        "mark" => "西藏自治区那曲地区双湖县"
    ],
    [
        "name" => "阿里地区",
        "pid" => 540000,
        "code" => 542500,
        "mark" => "西藏自治区阿里地区"
    ],
    [
        "name" => "普兰县",
        "pid" => 542500,
        "code" => 542521,
        "mark" => "西藏自治区阿里地区普兰县"
    ],
    [
        "name" => "札达县",
        "pid" => 542500,
        "code" => 542522,
        "mark" => "西藏自治区阿里地区札达县"
    ],
    [
        "name" => "噶尔县",
        "pid" => 542500,
        "code" => 542523,
        "mark" => "西藏自治区阿里地区噶尔县"
    ],
    [
        "name" => "日土县",
        "pid" => 542500,
        "code" => 542524,
        "mark" => "西藏自治区阿里地区日土县"
    ],
    [
        "name" => "革吉县",
        "pid" => 542500,
        "code" => 542525,
        "mark" => "西藏自治区阿里地区革吉县"
    ],
    [
        "name" => "改则县",
        "pid" => 542500,
        "code" => 542526,
        "mark" => "西藏自治区阿里地区改则县"
    ],
    [
        "name" => "措勤县",
        "pid" => 542500,
        "code" => 542527,
        "mark" => "西藏自治区阿里地区措勤县"
    ],
    [
        "name" => "陕西省",
        "pid" => 86,
        "code" => 610000,
        "mark" => "陕西省"
    ],
    [
        "name" => "西安市",
        "pid" => 610000,
        "code" => 610100,
        "mark" => "陕西省西安市"
    ],
    [
        "name" => "新城区",
        "pid" => 610100,
        "code" => 610102,
        "mark" => "陕西省西安市新城区"
    ],
    [
        "name" => "碑林区",
        "pid" => 610100,
        "code" => 610103,
        "mark" => "陕西省西安市碑林区"
    ],
    [
        "name" => "莲湖区",
        "pid" => 610100,
        "code" => 610104,
        "mark" => "陕西省西安市莲湖区"
    ],
    [
        "name" => "灞桥区",
        "pid" => 610100,
        "code" => 610111,
        "mark" => "陕西省西安市灞桥区"
    ],
    [
        "name" => "未央区",
        "pid" => 610100,
        "code" => 610112,
        "mark" => "陕西省西安市未央区"
    ],
    [
        "name" => "雁塔区",
        "pid" => 610100,
        "code" => 610113,
        "mark" => "陕西省西安市雁塔区"
    ],
    [
        "name" => "阎良区",
        "pid" => 610100,
        "code" => 610114,
        "mark" => "陕西省西安市阎良区"
    ],
    [
        "name" => "临潼区",
        "pid" => 610100,
        "code" => 610115,
        "mark" => "陕西省西安市临潼区"
    ],
    [
        "name" => "长安区",
        "pid" => 610100,
        "code" => 610116,
        "mark" => "陕西省西安市长安区"
    ],
    [
        "name" => "高陵区",
        "pid" => 610100,
        "code" => 610117,
        "mark" => "陕西省西安市高陵区"
    ],
    [
        "name" => "蓝田县",
        "pid" => 610100,
        "code" => 610122,
        "mark" => "陕西省西安市蓝田县"
    ],
    [
        "name" => "周至县",
        "pid" => 610100,
        "code" => 610124,
        "mark" => "陕西省西安市周至县"
    ],
    [
        "name" => "户县",
        "pid" => 610100,
        "code" => 610125,
        "mark" => "陕西省西安市户县"
    ],
    [
        "name" => "铜川市",
        "pid" => 610000,
        "code" => 610200,
        "mark" => "陕西省铜川市"
    ],
    [
        "name" => "王益区",
        "pid" => 610200,
        "code" => 610202,
        "mark" => "陕西省铜川市王益区"
    ],
    [
        "name" => "印台区",
        "pid" => 610200,
        "code" => 610203,
        "mark" => "陕西省铜川市印台区"
    ],
    [
        "name" => "耀州区",
        "pid" => 610200,
        "code" => 610204,
        "mark" => "陕西省铜川市耀州区"
    ],
    [
        "name" => "宜君县",
        "pid" => 610200,
        "code" => 610222,
        "mark" => "陕西省铜川市宜君县"
    ],
    [
        "name" => "宝鸡市",
        "pid" => 610000,
        "code" => 610300,
        "mark" => "陕西省宝鸡市"
    ],
    [
        "name" => "渭滨区",
        "pid" => 610300,
        "code" => 610302,
        "mark" => "陕西省宝鸡市渭滨区"
    ],
    [
        "name" => "金台区",
        "pid" => 610300,
        "code" => 610303,
        "mark" => "陕西省宝鸡市金台区"
    ],
    [
        "name" => "陈仓区",
        "pid" => 610300,
        "code" => 610304,
        "mark" => "陕西省宝鸡市陈仓区"
    ],
    [
        "name" => "凤翔县",
        "pid" => 610300,
        "code" => 610322,
        "mark" => "陕西省宝鸡市凤翔县"
    ],
    [
        "name" => "岐山县",
        "pid" => 610300,
        "code" => 610323,
        "mark" => "陕西省宝鸡市岐山县"
    ],
    [
        "name" => "扶风县",
        "pid" => 610300,
        "code" => 610324,
        "mark" => "陕西省宝鸡市扶风县"
    ],
    [
        "name" => "眉县",
        "pid" => 610300,
        "code" => 610326,
        "mark" => "陕西省宝鸡市眉县"
    ],
    [
        "name" => "陇县",
        "pid" => 610300,
        "code" => 610327,
        "mark" => "陕西省宝鸡市陇县"
    ],
    [
        "name" => "千阳县",
        "pid" => 610300,
        "code" => 610328,
        "mark" => "陕西省宝鸡市千阳县"
    ],
    [
        "name" => "麟游县",
        "pid" => 610300,
        "code" => 610329,
        "mark" => "陕西省宝鸡市麟游县"
    ],
    [
        "name" => "凤县",
        "pid" => 610300,
        "code" => 610330,
        "mark" => "陕西省宝鸡市凤县"
    ],
    [
        "name" => "太白县",
        "pid" => 610300,
        "code" => 610331,
        "mark" => "陕西省宝鸡市太白县"
    ],
    [
        "name" => "咸阳市",
        "pid" => 610000,
        "code" => 610400,
        "mark" => "陕西省咸阳市"
    ],
    [
        "name" => "秦都区",
        "pid" => 610400,
        "code" => 610402,
        "mark" => "陕西省咸阳市秦都区"
    ],
    [
        "name" => "杨陵区",
        "pid" => 610400,
        "code" => 610403,
        "mark" => "陕西省咸阳市杨陵区"
    ],
    [
        "name" => "渭城区",
        "pid" => 610400,
        "code" => 610404,
        "mark" => "陕西省咸阳市渭城区"
    ],
    [
        "name" => "三原县",
        "pid" => 610400,
        "code" => 610422,
        "mark" => "陕西省咸阳市三原县"
    ],
    [
        "name" => "泾阳县",
        "pid" => 610400,
        "code" => 610423,
        "mark" => "陕西省咸阳市泾阳县"
    ],
    [
        "name" => "乾县",
        "pid" => 610400,
        "code" => 610424,
        "mark" => "陕西省咸阳市乾县"
    ],
    [
        "name" => "礼泉县",
        "pid" => 610400,
        "code" => 610425,
        "mark" => "陕西省咸阳市礼泉县"
    ],
    [
        "name" => "永寿县",
        "pid" => 610400,
        "code" => 610426,
        "mark" => "陕西省咸阳市永寿县"
    ],
    [
        "name" => "彬县",
        "pid" => 610400,
        "code" => 610427,
        "mark" => "陕西省咸阳市彬县"
    ],
    [
        "name" => "长武县",
        "pid" => 610400,
        "code" => 610428,
        "mark" => "陕西省咸阳市长武县"
    ],
    [
        "name" => "旬邑县",
        "pid" => 610400,
        "code" => 610429,
        "mark" => "陕西省咸阳市旬邑县"
    ],
    [
        "name" => "淳化县",
        "pid" => 610400,
        "code" => 610430,
        "mark" => "陕西省咸阳市淳化县"
    ],
    [
        "name" => "武功县",
        "pid" => 610400,
        "code" => 610431,
        "mark" => "陕西省咸阳市武功县"
    ],
    [
        "name" => "兴平市",
        "pid" => 610400,
        "code" => 610481,
        "mark" => "陕西省咸阳市兴平市"
    ],
    [
        "name" => "渭南市",
        "pid" => 610000,
        "code" => 610500,
        "mark" => "陕西省渭南市"
    ],
    [
        "name" => "临渭区",
        "pid" => 610500,
        "code" => 610502,
        "mark" => "陕西省渭南市临渭区"
    ],
    [
        "name" => "华州区",
        "pid" => 610500,
        "code" => 610503,
        "mark" => "陕西省渭南市华州区"
    ],
    [
        "name" => "潼关县",
        "pid" => 610500,
        "code" => 610522,
        "mark" => "陕西省渭南市潼关县"
    ],
    [
        "name" => "大荔县",
        "pid" => 610500,
        "code" => 610523,
        "mark" => "陕西省渭南市大荔县"
    ],
    [
        "name" => "合阳县",
        "pid" => 610500,
        "code" => 610524,
        "mark" => "陕西省渭南市合阳县"
    ],
    [
        "name" => "澄城县",
        "pid" => 610500,
        "code" => 610525,
        "mark" => "陕西省渭南市澄城县"
    ],
    [
        "name" => "蒲城县",
        "pid" => 610500,
        "code" => 610526,
        "mark" => "陕西省渭南市蒲城县"
    ],
    [
        "name" => "白水县",
        "pid" => 610500,
        "code" => 610527,
        "mark" => "陕西省渭南市白水县"
    ],
    [
        "name" => "富平县",
        "pid" => 610500,
        "code" => 610528,
        "mark" => "陕西省渭南市富平县"
    ],
    [
        "name" => "韩城市",
        "pid" => 610500,
        "code" => 610581,
        "mark" => "陕西省渭南市韩城市"
    ],
    [
        "name" => "华阴市",
        "pid" => 610500,
        "code" => 610582,
        "mark" => "陕西省渭南市华阴市"
    ],
    [
        "name" => "延安市",
        "pid" => 610000,
        "code" => 610600,
        "mark" => "陕西省延安市"
    ],
    [
        "name" => "宝塔区",
        "pid" => 610600,
        "code" => 610602,
        "mark" => "陕西省延安市宝塔区"
    ],
    [
        "name" => "安塞区",
        "pid" => 610600,
        "code" => 610603,
        "mark" => "陕西省延安市安塞区"
    ],
    [
        "name" => "延长县",
        "pid" => 610600,
        "code" => 610621,
        "mark" => "陕西省延安市延长县"
    ],
    [
        "name" => "延川县",
        "pid" => 610600,
        "code" => 610622,
        "mark" => "陕西省延安市延川县"
    ],
    [
        "name" => "子长县",
        "pid" => 610600,
        "code" => 610623,
        "mark" => "陕西省延安市子长县"
    ],
    [
        "name" => "志丹县",
        "pid" => 610600,
        "code" => 610625,
        "mark" => "陕西省延安市志丹县"
    ],
    [
        "name" => "吴起县",
        "pid" => 610600,
        "code" => 610626,
        "mark" => "陕西省延安市吴起县"
    ],
    [
        "name" => "甘泉县",
        "pid" => 610600,
        "code" => 610627,
        "mark" => "陕西省延安市甘泉县"
    ],
    [
        "name" => "富县",
        "pid" => 610600,
        "code" => 610628,
        "mark" => "陕西省延安市富县"
    ],
    [
        "name" => "洛川县",
        "pid" => 610600,
        "code" => 610629,
        "mark" => "陕西省延安市洛川县"
    ],
    [
        "name" => "宜川县",
        "pid" => 610600,
        "code" => 610630,
        "mark" => "陕西省延安市宜川县"
    ],
    [
        "name" => "黄龙县",
        "pid" => 610600,
        "code" => 610631,
        "mark" => "陕西省延安市黄龙县"
    ],
    [
        "name" => "黄陵县",
        "pid" => 610600,
        "code" => 610632,
        "mark" => "陕西省延安市黄陵县"
    ],
    [
        "name" => "汉中市",
        "pid" => 610000,
        "code" => 610700,
        "mark" => "陕西省汉中市"
    ],
    [
        "name" => "汉台区",
        "pid" => 610700,
        "code" => 610702,
        "mark" => "陕西省汉中市汉台区"
    ],
    [
        "name" => "南郑县",
        "pid" => 610700,
        "code" => 610721,
        "mark" => "陕西省汉中市南郑县"
    ],
    [
        "name" => "城固县",
        "pid" => 610700,
        "code" => 610722,
        "mark" => "陕西省汉中市城固县"
    ],
    [
        "name" => "洋县",
        "pid" => 610700,
        "code" => 610723,
        "mark" => "陕西省汉中市洋县"
    ],
    [
        "name" => "西乡县",
        "pid" => 610700,
        "code" => 610724,
        "mark" => "陕西省汉中市西乡县"
    ],
    [
        "name" => "勉县",
        "pid" => 610700,
        "code" => 610725,
        "mark" => "陕西省汉中市勉县"
    ],
    [
        "name" => "宁强县",
        "pid" => 610700,
        "code" => 610726,
        "mark" => "陕西省汉中市宁强县"
    ],
    [
        "name" => "略阳县",
        "pid" => 610700,
        "code" => 610727,
        "mark" => "陕西省汉中市略阳县"
    ],
    [
        "name" => "镇巴县",
        "pid" => 610700,
        "code" => 610728,
        "mark" => "陕西省汉中市镇巴县"
    ],
    [
        "name" => "留坝县",
        "pid" => 610700,
        "code" => 610729,
        "mark" => "陕西省汉中市留坝县"
    ],
    [
        "name" => "佛坪县",
        "pid" => 610700,
        "code" => 610730,
        "mark" => "陕西省汉中市佛坪县"
    ],
    [
        "name" => "榆林市",
        "pid" => 610000,
        "code" => 610800,
        "mark" => "陕西省榆林市"
    ],
    [
        "name" => "榆阳区",
        "pid" => 610800,
        "code" => 610802,
        "mark" => "陕西省榆林市榆阳区"
    ],
    [
        "name" => "横山区",
        "pid" => 610800,
        "code" => 610803,
        "mark" => "陕西省榆林市横山区"
    ],
    [
        "name" => "神木县",
        "pid" => 610800,
        "code" => 610821,
        "mark" => "陕西省榆林市神木县"
    ],
    [
        "name" => "府谷县",
        "pid" => 610800,
        "code" => 610822,
        "mark" => "陕西省榆林市府谷县"
    ],
    [
        "name" => "靖边县",
        "pid" => 610800,
        "code" => 610824,
        "mark" => "陕西省榆林市靖边县"
    ],
    [
        "name" => "定边县",
        "pid" => 610800,
        "code" => 610825,
        "mark" => "陕西省榆林市定边县"
    ],
    [
        "name" => "绥德县",
        "pid" => 610800,
        "code" => 610826,
        "mark" => "陕西省榆林市绥德县"
    ],
    [
        "name" => "米脂县",
        "pid" => 610800,
        "code" => 610827,
        "mark" => "陕西省榆林市米脂县"
    ],
    [
        "name" => "佳县",
        "pid" => 610800,
        "code" => 610828,
        "mark" => "陕西省榆林市佳县"
    ],
    [
        "name" => "吴堡县",
        "pid" => 610800,
        "code" => 610829,
        "mark" => "陕西省榆林市吴堡县"
    ],
    [
        "name" => "清涧县",
        "pid" => 610800,
        "code" => 610830,
        "mark" => "陕西省榆林市清涧县"
    ],
    [
        "name" => "子洲县",
        "pid" => 610800,
        "code" => 610831,
        "mark" => "陕西省榆林市子洲县"
    ],
    [
        "name" => "安康市",
        "pid" => 610000,
        "code" => 610900,
        "mark" => "陕西省安康市"
    ],
    [
        "name" => "汉滨区",
        "pid" => 610900,
        "code" => 610902,
        "mark" => "陕西省安康市汉滨区"
    ],
    [
        "name" => "汉阴县",
        "pid" => 610900,
        "code" => 610921,
        "mark" => "陕西省安康市汉阴县"
    ],
    [
        "name" => "石泉县",
        "pid" => 610900,
        "code" => 610922,
        "mark" => "陕西省安康市石泉县"
    ],
    [
        "name" => "宁陕县",
        "pid" => 610900,
        "code" => 610923,
        "mark" => "陕西省安康市宁陕县"
    ],
    [
        "name" => "紫阳县",
        "pid" => 610900,
        "code" => 610924,
        "mark" => "陕西省安康市紫阳县"
    ],
    [
        "name" => "岚皋县",
        "pid" => 610900,
        "code" => 610925,
        "mark" => "陕西省安康市岚皋县"
    ],
    [
        "name" => "平利县",
        "pid" => 610900,
        "code" => 610926,
        "mark" => "陕西省安康市平利县"
    ],
    [
        "name" => "镇坪县",
        "pid" => 610900,
        "code" => 610927,
        "mark" => "陕西省安康市镇坪县"
    ],
    [
        "name" => "旬阳县",
        "pid" => 610900,
        "code" => 610928,
        "mark" => "陕西省安康市旬阳县"
    ],
    [
        "name" => "白河县",
        "pid" => 610900,
        "code" => 610929,
        "mark" => "陕西省安康市白河县"
    ],
    [
        "name" => "商洛市",
        "pid" => 610000,
        "code" => 611000,
        "mark" => "陕西省商洛市"
    ],
    [
        "name" => "商州区",
        "pid" => 611000,
        "code" => 611002,
        "mark" => "陕西省商洛市商州区"
    ],
    [
        "name" => "洛南县",
        "pid" => 611000,
        "code" => 611021,
        "mark" => "陕西省商洛市洛南县"
    ],
    [
        "name" => "丹凤县",
        "pid" => 611000,
        "code" => 611022,
        "mark" => "陕西省商洛市丹凤县"
    ],
    [
        "name" => "商南县",
        "pid" => 611000,
        "code" => 611023,
        "mark" => "陕西省商洛市商南县"
    ],
    [
        "name" => "山阳县",
        "pid" => 611000,
        "code" => 611024,
        "mark" => "陕西省商洛市山阳县"
    ],
    [
        "name" => "镇安县",
        "pid" => 611000,
        "code" => 611025,
        "mark" => "陕西省商洛市镇安县"
    ],
    [
        "name" => "柞水县",
        "pid" => 611000,
        "code" => 611026,
        "mark" => "陕西省商洛市柞水县"
    ],
    [
        "name" => "甘肃省",
        "pid" => 86,
        "code" => 620000,
        "mark" => "甘肃省"
    ],
    [
        "name" => "兰州市",
        "pid" => 620000,
        "code" => 620100,
        "mark" => "甘肃省兰州市"
    ],
    [
        "name" => "城关区",
        "pid" => 620100,
        "code" => 620102,
        "mark" => "甘肃省兰州市城关区"
    ],
    [
        "name" => "七里河区",
        "pid" => 620100,
        "code" => 620103,
        "mark" => "甘肃省兰州市七里河区"
    ],
    [
        "name" => "西固区",
        "pid" => 620100,
        "code" => 620104,
        "mark" => "甘肃省兰州市西固区"
    ],
    [
        "name" => "安宁区",
        "pid" => 620100,
        "code" => 620105,
        "mark" => "甘肃省兰州市安宁区"
    ],
    [
        "name" => "红古区",
        "pid" => 620100,
        "code" => 620111,
        "mark" => "甘肃省兰州市红古区"
    ],
    [
        "name" => "永登县",
        "pid" => 620100,
        "code" => 620121,
        "mark" => "甘肃省兰州市永登县"
    ],
    [
        "name" => "皋兰县",
        "pid" => 620100,
        "code" => 620122,
        "mark" => "甘肃省兰州市皋兰县"
    ],
    [
        "name" => "榆中县",
        "pid" => 620100,
        "code" => 620123,
        "mark" => "甘肃省兰州市榆中县"
    ],
    [
        "name" => "嘉峪关市",
        "pid" => 620000,
        "code" => 620200,
        "mark" => "甘肃省嘉峪关市"
    ],
    [
        "name" => "金昌市",
        "pid" => 620000,
        "code" => 620300,
        "mark" => "甘肃省金昌市"
    ],
    [
        "name" => "金川区",
        "pid" => 620300,
        "code" => 620302,
        "mark" => "甘肃省金昌市金川区"
    ],
    [
        "name" => "永昌县",
        "pid" => 620300,
        "code" => 620321,
        "mark" => "甘肃省金昌市永昌县"
    ],
    [
        "name" => "白银市",
        "pid" => 620000,
        "code" => 620400,
        "mark" => "甘肃省白银市"
    ],
    [
        "name" => "白银区",
        "pid" => 620400,
        "code" => 620402,
        "mark" => "甘肃省白银市白银区"
    ],
    [
        "name" => "平川区",
        "pid" => 620400,
        "code" => 620403,
        "mark" => "甘肃省白银市平川区"
    ],
    [
        "name" => "靖远县",
        "pid" => 620400,
        "code" => 620421,
        "mark" => "甘肃省白银市靖远县"
    ],
    [
        "name" => "会宁县",
        "pid" => 620400,
        "code" => 620422,
        "mark" => "甘肃省白银市会宁县"
    ],
    [
        "name" => "景泰县",
        "pid" => 620400,
        "code" => 620423,
        "mark" => "甘肃省白银市景泰县"
    ],
    [
        "name" => "天水市",
        "pid" => 620000,
        "code" => 620500,
        "mark" => "甘肃省天水市"
    ],
    [
        "name" => "秦州区",
        "pid" => 620500,
        "code" => 620502,
        "mark" => "甘肃省天水市秦州区"
    ],
    [
        "name" => "麦积区",
        "pid" => 620500,
        "code" => 620503,
        "mark" => "甘肃省天水市麦积区"
    ],
    [
        "name" => "清水县",
        "pid" => 620500,
        "code" => 620521,
        "mark" => "甘肃省天水市清水县"
    ],
    [
        "name" => "秦安县",
        "pid" => 620500,
        "code" => 620522,
        "mark" => "甘肃省天水市秦安县"
    ],
    [
        "name" => "甘谷县",
        "pid" => 620500,
        "code" => 620523,
        "mark" => "甘肃省天水市甘谷县"
    ],
    [
        "name" => "武山县",
        "pid" => 620500,
        "code" => 620524,
        "mark" => "甘肃省天水市武山县"
    ],
    [
        "name" => "张家川回族自治县",
        "pid" => 620500,
        "code" => 620525,
        "mark" => "甘肃省天水市张家川回族自治县"
    ],
    [
        "name" => "武威市",
        "pid" => 620000,
        "code" => 620600,
        "mark" => "甘肃省武威市"
    ],
    [
        "name" => "凉州区",
        "pid" => 620600,
        "code" => 620602,
        "mark" => "甘肃省武威市凉州区"
    ],
    [
        "name" => "民勤县",
        "pid" => 620600,
        "code" => 620621,
        "mark" => "甘肃省武威市民勤县"
    ],
    [
        "name" => "古浪县",
        "pid" => 620600,
        "code" => 620622,
        "mark" => "甘肃省武威市古浪县"
    ],
    [
        "name" => "天祝藏族自治县",
        "pid" => 620600,
        "code" => 620623,
        "mark" => "甘肃省武威市天祝藏族自治县"
    ],
    [
        "name" => "张掖市",
        "pid" => 620000,
        "code" => 620700,
        "mark" => "甘肃省张掖市"
    ],
    [
        "name" => "甘州区",
        "pid" => 620700,
        "code" => 620702,
        "mark" => "甘肃省张掖市甘州区"
    ],
    [
        "name" => "肃南裕固族自治县",
        "pid" => 620700,
        "code" => 620721,
        "mark" => "甘肃省张掖市肃南裕固族自治县"
    ],
    [
        "name" => "民乐县",
        "pid" => 620700,
        "code" => 620722,
        "mark" => "甘肃省张掖市民乐县"
    ],
    [
        "name" => "临泽县",
        "pid" => 620700,
        "code" => 620723,
        "mark" => "甘肃省张掖市临泽县"
    ],
    [
        "name" => "高台县",
        "pid" => 620700,
        "code" => 620724,
        "mark" => "甘肃省张掖市高台县"
    ],
    [
        "name" => "山丹县",
        "pid" => 620700,
        "code" => 620725,
        "mark" => "甘肃省张掖市山丹县"
    ],
    [
        "name" => "平凉市",
        "pid" => 620000,
        "code" => 620800,
        "mark" => "甘肃省平凉市"
    ],
    [
        "name" => "崆峒区",
        "pid" => 620800,
        "code" => 620802,
        "mark" => "甘肃省平凉市崆峒区"
    ],
    [
        "name" => "泾川县",
        "pid" => 620800,
        "code" => 620821,
        "mark" => "甘肃省平凉市泾川县"
    ],
    [
        "name" => "灵台县",
        "pid" => 620800,
        "code" => 620822,
        "mark" => "甘肃省平凉市灵台县"
    ],
    [
        "name" => "崇信县",
        "pid" => 620800,
        "code" => 620823,
        "mark" => "甘肃省平凉市崇信县"
    ],
    [
        "name" => "华亭县",
        "pid" => 620800,
        "code" => 620824,
        "mark" => "甘肃省平凉市华亭县"
    ],
    [
        "name" => "庄浪县",
        "pid" => 620800,
        "code" => 620825,
        "mark" => "甘肃省平凉市庄浪县"
    ],
    [
        "name" => "静宁县",
        "pid" => 620800,
        "code" => 620826,
        "mark" => "甘肃省平凉市静宁县"
    ],
    [
        "name" => "酒泉市",
        "pid" => 620000,
        "code" => 620900,
        "mark" => "甘肃省酒泉市"
    ],
    [
        "name" => "肃州区",
        "pid" => 620900,
        "code" => 620902,
        "mark" => "甘肃省酒泉市肃州区"
    ],
    [
        "name" => "金塔县",
        "pid" => 620900,
        "code" => 620921,
        "mark" => "甘肃省酒泉市金塔县"
    ],
    [
        "name" => "瓜州县",
        "pid" => 620900,
        "code" => 620922,
        "mark" => "甘肃省酒泉市瓜州县"
    ],
    [
        "name" => "肃北蒙古族自治县",
        "pid" => 620900,
        "code" => 620923,
        "mark" => "甘肃省酒泉市肃北蒙古族自治县"
    ],
    [
        "name" => "阿克塞哈萨克族自治县",
        "pid" => 620900,
        "code" => 620924,
        "mark" => "甘肃省酒泉市阿克塞哈萨克族自治县"
    ],
    [
        "name" => "玉门市",
        "pid" => 620900,
        "code" => 620981,
        "mark" => "甘肃省酒泉市玉门市"
    ],
    [
        "name" => "敦煌市",
        "pid" => 620900,
        "code" => 620982,
        "mark" => "甘肃省酒泉市敦煌市"
    ],
    [
        "name" => "庆阳市",
        "pid" => 620000,
        "code" => 621000,
        "mark" => "甘肃省庆阳市"
    ],
    [
        "name" => "西峰区",
        "pid" => 621000,
        "code" => 621002,
        "mark" => "甘肃省庆阳市西峰区"
    ],
    [
        "name" => "庆城县",
        "pid" => 621000,
        "code" => 621021,
        "mark" => "甘肃省庆阳市庆城县"
    ],
    [
        "name" => "环县",
        "pid" => 621000,
        "code" => 621022,
        "mark" => "甘肃省庆阳市环县"
    ],
    [
        "name" => "华池县",
        "pid" => 621000,
        "code" => 621023,
        "mark" => "甘肃省庆阳市华池县"
    ],
    [
        "name" => "合水县",
        "pid" => 621000,
        "code" => 621024,
        "mark" => "甘肃省庆阳市合水县"
    ],
    [
        "name" => "正宁县",
        "pid" => 621000,
        "code" => 621025,
        "mark" => "甘肃省庆阳市正宁县"
    ],
    [
        "name" => "宁县",
        "pid" => 621000,
        "code" => 621026,
        "mark" => "甘肃省庆阳市宁县"
    ],
    [
        "name" => "镇原县",
        "pid" => 621000,
        "code" => 621027,
        "mark" => "甘肃省庆阳市镇原县"
    ],
    [
        "name" => "定西市",
        "pid" => 620000,
        "code" => 621100,
        "mark" => "甘肃省定西市"
    ],
    [
        "name" => "安定区",
        "pid" => 621100,
        "code" => 621102,
        "mark" => "甘肃省定西市安定区"
    ],
    [
        "name" => "通渭县",
        "pid" => 621100,
        "code" => 621121,
        "mark" => "甘肃省定西市通渭县"
    ],
    [
        "name" => "陇西县",
        "pid" => 621100,
        "code" => 621122,
        "mark" => "甘肃省定西市陇西县"
    ],
    [
        "name" => "渭源县",
        "pid" => 621100,
        "code" => 621123,
        "mark" => "甘肃省定西市渭源县"
    ],
    [
        "name" => "临洮县",
        "pid" => 621100,
        "code" => 621124,
        "mark" => "甘肃省定西市临洮县"
    ],
    [
        "name" => "漳县",
        "pid" => 621100,
        "code" => 621125,
        "mark" => "甘肃省定西市漳县"
    ],
    [
        "name" => "岷县",
        "pid" => 621100,
        "code" => 621126,
        "mark" => "甘肃省定西市岷县"
    ],
    [
        "name" => "陇南市",
        "pid" => 620000,
        "code" => 621200,
        "mark" => "甘肃省陇南市"
    ],
    [
        "name" => "武都区",
        "pid" => 621200,
        "code" => 621202,
        "mark" => "甘肃省陇南市武都区"
    ],
    [
        "name" => "成县",
        "pid" => 621200,
        "code" => 621221,
        "mark" => "甘肃省陇南市成县"
    ],
    [
        "name" => "文县",
        "pid" => 621200,
        "code" => 621222,
        "mark" => "甘肃省陇南市文县"
    ],
    [
        "name" => "宕昌县",
        "pid" => 621200,
        "code" => 621223,
        "mark" => "甘肃省陇南市宕昌县"
    ],
    [
        "name" => "康县",
        "pid" => 621200,
        "code" => 621224,
        "mark" => "甘肃省陇南市康县"
    ],
    [
        "name" => "西和县",
        "pid" => 621200,
        "code" => 621225,
        "mark" => "甘肃省陇南市西和县"
    ],
    [
        "name" => "礼县",
        "pid" => 621200,
        "code" => 621226,
        "mark" => "甘肃省陇南市礼县"
    ],
    [
        "name" => "徽县",
        "pid" => 621200,
        "code" => 621227,
        "mark" => "甘肃省陇南市徽县"
    ],
    [
        "name" => "两当县",
        "pid" => 621200,
        "code" => 621228,
        "mark" => "甘肃省陇南市两当县"
    ],
    [
        "name" => "临夏回族自治州",
        "pid" => 620000,
        "code" => 622900,
        "mark" => "甘肃省临夏回族自治州"
    ],
    [
        "name" => "临夏市",
        "pid" => 622900,
        "code" => 622901,
        "mark" => "甘肃省临夏回族自治州临夏市"
    ],
    [
        "name" => "临夏县",
        "pid" => 622900,
        "code" => 622921,
        "mark" => "甘肃省临夏回族自治州临夏县"
    ],
    [
        "name" => "康乐县",
        "pid" => 622900,
        "code" => 622922,
        "mark" => "甘肃省临夏回族自治州康乐县"
    ],
    [
        "name" => "永靖县",
        "pid" => 622900,
        "code" => 622923,
        "mark" => "甘肃省临夏回族自治州永靖县"
    ],
    [
        "name" => "广河县",
        "pid" => 622900,
        "code" => 622924,
        "mark" => "甘肃省临夏回族自治州广河县"
    ],
    [
        "name" => "和政县",
        "pid" => 622900,
        "code" => 622925,
        "mark" => "甘肃省临夏回族自治州和政县"
    ],
    [
        "name" => "东乡族自治县",
        "pid" => 622900,
        "code" => 622926,
        "mark" => "甘肃省临夏回族自治州东乡族自治县"
    ],
    [
        "name" => "积石山保安族东乡族撒拉族自治县",
        "pid" => 622900,
        "code" => 622927,
        "mark" => "甘肃省临夏回族自治州积石山保安族东乡族撒拉族自治县"
    ],
    [
        "name" => "甘南藏族自治州",
        "pid" => 620000,
        "code" => 623000,
        "mark" => "甘肃省甘南藏族自治州"
    ],
    [
        "name" => "合作市",
        "pid" => 623000,
        "code" => 623001,
        "mark" => "甘肃省甘南藏族自治州合作市"
    ],
    [
        "name" => "临潭县",
        "pid" => 623000,
        "code" => 623021,
        "mark" => "甘肃省甘南藏族自治州临潭县"
    ],
    [
        "name" => "卓尼县",
        "pid" => 623000,
        "code" => 623022,
        "mark" => "甘肃省甘南藏族自治州卓尼县"
    ],
    [
        "name" => "舟曲县",
        "pid" => 623000,
        "code" => 623023,
        "mark" => "甘肃省甘南藏族自治州舟曲县"
    ],
    [
        "name" => "迭部县",
        "pid" => 623000,
        "code" => 623024,
        "mark" => "甘肃省甘南藏族自治州迭部县"
    ],
    [
        "name" => "玛曲县",
        "pid" => 623000,
        "code" => 623025,
        "mark" => "甘肃省甘南藏族自治州玛曲县"
    ],
    [
        "name" => "碌曲县",
        "pid" => 623000,
        "code" => 623026,
        "mark" => "甘肃省甘南藏族自治州碌曲县"
    ],
    [
        "name" => "夏河县",
        "pid" => 623000,
        "code" => 623027,
        "mark" => "甘肃省甘南藏族自治州夏河县"
    ],
    [
        "name" => "青海省",
        "pid" => 86,
        "code" => 630000,
        "mark" => "青海省"
    ],
    [
        "name" => "西宁市",
        "pid" => 630000,
        "code" => 630100,
        "mark" => "青海省西宁市"
    ],
    [
        "name" => "城东区",
        "pid" => 630100,
        "code" => 630102,
        "mark" => "青海省西宁市城东区"
    ],
    [
        "name" => "城中区",
        "pid" => 630100,
        "code" => 630103,
        "mark" => "青海省西宁市城中区"
    ],
    [
        "name" => "城西区",
        "pid" => 630100,
        "code" => 630104,
        "mark" => "青海省西宁市城西区"
    ],
    [
        "name" => "城北区",
        "pid" => 630100,
        "code" => 630105,
        "mark" => "青海省西宁市城北区"
    ],
    [
        "name" => "大通回族土族自治县",
        "pid" => 630100,
        "code" => 630121,
        "mark" => "青海省西宁市大通回族土族自治县"
    ],
    [
        "name" => "湟中县",
        "pid" => 630100,
        "code" => 630122,
        "mark" => "青海省西宁市湟中县"
    ],
    [
        "name" => "湟源县",
        "pid" => 630100,
        "code" => 630123,
        "mark" => "青海省西宁市湟源县"
    ],
    [
        "name" => "海东市",
        "pid" => 630000,
        "code" => 630200,
        "mark" => "青海省海东市"
    ],
    [
        "name" => "乐都区",
        "pid" => 630200,
        "code" => 630202,
        "mark" => "青海省海东市乐都区"
    ],
    [
        "name" => "平安区",
        "pid" => 630200,
        "code" => 630203,
        "mark" => "青海省海东市平安区"
    ],
    [
        "name" => "民和回族土族自治县",
        "pid" => 630200,
        "code" => 630222,
        "mark" => "青海省海东市民和回族土族自治县"
    ],
    [
        "name" => "互助土族自治县",
        "pid" => 630200,
        "code" => 630223,
        "mark" => "青海省海东市互助土族自治县"
    ],
    [
        "name" => "化隆回族自治县",
        "pid" => 630200,
        "code" => 630224,
        "mark" => "青海省海东市化隆回族自治县"
    ],
    [
        "name" => "循化撒拉族自治县",
        "pid" => 630200,
        "code" => 630225,
        "mark" => "青海省海东市循化撒拉族自治县"
    ],
    [
        "name" => "海北藏族自治州",
        "pid" => 630000,
        "code" => 632200,
        "mark" => "青海省海北藏族自治州"
    ],
    [
        "name" => "门源回族自治县",
        "pid" => 632200,
        "code" => 632221,
        "mark" => "青海省海北藏族自治州门源回族自治县"
    ],
    [
        "name" => "祁连县",
        "pid" => 632200,
        "code" => 632222,
        "mark" => "青海省海北藏族自治州祁连县"
    ],
    [
        "name" => "海晏县",
        "pid" => 632200,
        "code" => 632223,
        "mark" => "青海省海北藏族自治州海晏县"
    ],
    [
        "name" => "刚察县",
        "pid" => 632200,
        "code" => 632224,
        "mark" => "青海省海北藏族自治州刚察县"
    ],
    [
        "name" => "黄南藏族自治州",
        "pid" => 630000,
        "code" => 632300,
        "mark" => "青海省黄南藏族自治州"
    ],
    [
        "name" => "同仁县",
        "pid" => 632300,
        "code" => 632321,
        "mark" => "青海省黄南藏族自治州同仁县"
    ],
    [
        "name" => "尖扎县",
        "pid" => 632300,
        "code" => 632322,
        "mark" => "青海省黄南藏族自治州尖扎县"
    ],
    [
        "name" => "泽库县",
        "pid" => 632300,
        "code" => 632323,
        "mark" => "青海省黄南藏族自治州泽库县"
    ],
    [
        "name" => "河南蒙古族自治县",
        "pid" => 632300,
        "code" => 632324,
        "mark" => "青海省黄南藏族自治州河南蒙古族自治县"
    ],
    [
        "name" => "海南藏族自治州",
        "pid" => 630000,
        "code" => 632500,
        "mark" => "青海省海南藏族自治州"
    ],
    [
        "name" => "共和县",
        "pid" => 632500,
        "code" => 632521,
        "mark" => "青海省海南藏族自治州共和县"
    ],
    [
        "name" => "同德县",
        "pid" => 632500,
        "code" => 632522,
        "mark" => "青海省海南藏族自治州同德县"
    ],
    [
        "name" => "贵德县",
        "pid" => 632500,
        "code" => 632523,
        "mark" => "青海省海南藏族自治州贵德县"
    ],
    [
        "name" => "兴海县",
        "pid" => 632500,
        "code" => 632524,
        "mark" => "青海省海南藏族自治州兴海县"
    ],
    [
        "name" => "贵南县",
        "pid" => 632500,
        "code" => 632525,
        "mark" => "青海省海南藏族自治州贵南县"
    ],
    [
        "name" => "果洛藏族自治州",
        "pid" => 630000,
        "code" => 632600,
        "mark" => "青海省果洛藏族自治州"
    ],
    [
        "name" => "玛沁县",
        "pid" => 632600,
        "code" => 632621,
        "mark" => "青海省果洛藏族自治州玛沁县"
    ],
    [
        "name" => "班玛县",
        "pid" => 632600,
        "code" => 632622,
        "mark" => "青海省果洛藏族自治州班玛县"
    ],
    [
        "name" => "甘德县",
        "pid" => 632600,
        "code" => 632623,
        "mark" => "青海省果洛藏族自治州甘德县"
    ],
    [
        "name" => "达日县",
        "pid" => 632600,
        "code" => 632624,
        "mark" => "青海省果洛藏族自治州达日县"
    ],
    [
        "name" => "久治县",
        "pid" => 632600,
        "code" => 632625,
        "mark" => "青海省果洛藏族自治州久治县"
    ],
    [
        "name" => "玛多县",
        "pid" => 632600,
        "code" => 632626,
        "mark" => "青海省果洛藏族自治州玛多县"
    ],
    [
        "name" => "玉树藏族自治州",
        "pid" => 630000,
        "code" => 632700,
        "mark" => "青海省玉树藏族自治州"
    ],
    [
        "name" => "玉树市",
        "pid" => 632700,
        "code" => 632701,
        "mark" => "青海省玉树藏族自治州玉树市"
    ],
    [
        "name" => "杂多县",
        "pid" => 632700,
        "code" => 632722,
        "mark" => "青海省玉树藏族自治州杂多县"
    ],
    [
        "name" => "称多县",
        "pid" => 632700,
        "code" => 632723,
        "mark" => "青海省玉树藏族自治州称多县"
    ],
    [
        "name" => "治多县",
        "pid" => 632700,
        "code" => 632724,
        "mark" => "青海省玉树藏族自治州治多县"
    ],
    [
        "name" => "囊谦县",
        "pid" => 632700,
        "code" => 632725,
        "mark" => "青海省玉树藏族自治州囊谦县"
    ],
    [
        "name" => "曲麻莱县",
        "pid" => 632700,
        "code" => 632726,
        "mark" => "青海省玉树藏族自治州曲麻莱县"
    ],
    [
        "name" => "海西蒙古族藏族自治州",
        "pid" => 630000,
        "code" => 632800,
        "mark" => "青海省海西蒙古族藏族自治州"
    ],
    [
        "name" => "格尔木市",
        "pid" => 632800,
        "code" => 632801,
        "mark" => "青海省海西蒙古族藏族自治州格尔木市"
    ],
    [
        "name" => "德令哈市",
        "pid" => 632800,
        "code" => 632802,
        "mark" => "青海省海西蒙古族藏族自治州德令哈市"
    ],
    [
        "name" => "乌兰县",
        "pid" => 632800,
        "code" => 632821,
        "mark" => "青海省海西蒙古族藏族自治州乌兰县"
    ],
    [
        "name" => "都兰县",
        "pid" => 632800,
        "code" => 632822,
        "mark" => "青海省海西蒙古族藏族自治州都兰县"
    ],
    [
        "name" => "天峻县",
        "pid" => 632800,
        "code" => 632823,
        "mark" => "青海省海西蒙古族藏族自治州天峻县"
    ],
    [
        "name" => "宁夏回族自治区",
        "pid" => 86,
        "code" => 640000,
        "mark" => "宁夏回族自治区"
    ],
    [
        "name" => "银川市",
        "pid" => 640000,
        "code" => 640100,
        "mark" => "宁夏回族自治区银川市"
    ],
    [
        "name" => "兴庆区",
        "pid" => 640100,
        "code" => 640104,
        "mark" => "宁夏回族自治区银川市兴庆区"
    ],
    [
        "name" => "西夏区",
        "pid" => 640100,
        "code" => 640105,
        "mark" => "宁夏回族自治区银川市西夏区"
    ],
    [
        "name" => "金凤区",
        "pid" => 640100,
        "code" => 640106,
        "mark" => "宁夏回族自治区银川市金凤区"
    ],
    [
        "name" => "永宁县",
        "pid" => 640100,
        "code" => 640121,
        "mark" => "宁夏回族自治区银川市永宁县"
    ],
    [
        "name" => "贺兰县",
        "pid" => 640100,
        "code" => 640122,
        "mark" => "宁夏回族自治区银川市贺兰县"
    ],
    [
        "name" => "灵武市",
        "pid" => 640100,
        "code" => 640181,
        "mark" => "宁夏回族自治区银川市灵武市"
    ],
    [
        "name" => "石嘴山市",
        "pid" => 640000,
        "code" => 640200,
        "mark" => "宁夏回族自治区石嘴山市"
    ],
    [
        "name" => "大武口区",
        "pid" => 640200,
        "code" => 640202,
        "mark" => "宁夏回族自治区石嘴山市大武口区"
    ],
    [
        "name" => "惠农区",
        "pid" => 640200,
        "code" => 640205,
        "mark" => "宁夏回族自治区石嘴山市惠农区"
    ],
    [
        "name" => "平罗县",
        "pid" => 640200,
        "code" => 640221,
        "mark" => "宁夏回族自治区石嘴山市平罗县"
    ],
    [
        "name" => "吴忠市",
        "pid" => 640000,
        "code" => 640300,
        "mark" => "宁夏回族自治区吴忠市"
    ],
    [
        "name" => "利通区",
        "pid" => 640300,
        "code" => 640302,
        "mark" => "宁夏回族自治区吴忠市利通区"
    ],
    [
        "name" => "红寺堡区",
        "pid" => 640300,
        "code" => 640303,
        "mark" => "宁夏回族自治区吴忠市红寺堡区"
    ],
    [
        "name" => "盐池县",
        "pid" => 640300,
        "code" => 640323,
        "mark" => "宁夏回族自治区吴忠市盐池县"
    ],
    [
        "name" => "同心县",
        "pid" => 640300,
        "code" => 640324,
        "mark" => "宁夏回族自治区吴忠市同心县"
    ],
    [
        "name" => "青铜峡市",
        "pid" => 640300,
        "code" => 640381,
        "mark" => "宁夏回族自治区吴忠市青铜峡市"
    ],
    [
        "name" => "固原市",
        "pid" => 640000,
        "code" => 640400,
        "mark" => "宁夏回族自治区固原市"
    ],
    [
        "name" => "原州区",
        "pid" => 640400,
        "code" => 640402,
        "mark" => "宁夏回族自治区固原市原州区"
    ],
    [
        "name" => "西吉县",
        "pid" => 640400,
        "code" => 640422,
        "mark" => "宁夏回族自治区固原市西吉县"
    ],
    [
        "name" => "隆德县",
        "pid" => 640400,
        "code" => 640423,
        "mark" => "宁夏回族自治区固原市隆德县"
    ],
    [
        "name" => "泾源县",
        "pid" => 640400,
        "code" => 640424,
        "mark" => "宁夏回族自治区固原市泾源县"
    ],
    [
        "name" => "彭阳县",
        "pid" => 640400,
        "code" => 640425,
        "mark" => "宁夏回族自治区固原市彭阳县"
    ],
    [
        "name" => "中卫市",
        "pid" => 640000,
        "code" => 640500,
        "mark" => "宁夏回族自治区中卫市"
    ],
    [
        "name" => "沙坡头区",
        "pid" => 640500,
        "code" => 640502,
        "mark" => "宁夏回族自治区中卫市沙坡头区"
    ],
    [
        "name" => "中宁县",
        "pid" => 640500,
        "code" => 640521,
        "mark" => "宁夏回族自治区中卫市中宁县"
    ],
    [
        "name" => "海原县",
        "pid" => 640500,
        "code" => 640522,
        "mark" => "宁夏回族自治区中卫市海原县"
    ],
    [
        "name" => "新疆维吾尔自治区",
        "pid" => 86,
        "code" => 650000,
        "mark" => "新疆维吾尔自治区"
    ],
    [
        "name" => "乌鲁木齐市",
        "pid" => 650000,
        "code" => 650100,
        "mark" => "新疆维吾尔自治区乌鲁木齐市"
    ],
    [
        "name" => "天山区",
        "pid" => 650100,
        "code" => 650102,
        "mark" => "新疆维吾尔自治区乌鲁木齐市天山区"
    ],
    [
        "name" => "沙依巴克区",
        "pid" => 650100,
        "code" => 650103,
        "mark" => "新疆维吾尔自治区乌鲁木齐市沙依巴克区"
    ],
    [
        "name" => "新市区",
        "pid" => 650100,
        "code" => 650104,
        "mark" => "新疆维吾尔自治区乌鲁木齐市新市区"
    ],
    [
        "name" => "水磨沟区",
        "pid" => 650100,
        "code" => 650105,
        "mark" => "新疆维吾尔自治区乌鲁木齐市水磨沟区"
    ],
    [
        "name" => "头屯河区",
        "pid" => 650100,
        "code" => 650106,
        "mark" => "新疆维吾尔自治区乌鲁木齐市头屯河区"
    ],
    [
        "name" => "达坂城区",
        "pid" => 650100,
        "code" => 650107,
        "mark" => "新疆维吾尔自治区乌鲁木齐市达坂城区"
    ],
    [
        "name" => "米东区",
        "pid" => 650100,
        "code" => 650109,
        "mark" => "新疆维吾尔自治区乌鲁木齐市米东区"
    ],
    [
        "name" => "乌鲁木齐县",
        "pid" => 650100,
        "code" => 650121,
        "mark" => "新疆维吾尔自治区乌鲁木齐市乌鲁木齐县"
    ],
    [
        "name" => "克拉玛依市",
        "pid" => 650000,
        "code" => 650200,
        "mark" => "新疆维吾尔自治区克拉玛依市"
    ],
    [
        "name" => "独山子区",
        "pid" => 650200,
        "code" => 650202,
        "mark" => "新疆维吾尔自治区克拉玛依市独山子区"
    ],
    [
        "name" => "克拉玛依区",
        "pid" => 650200,
        "code" => 650203,
        "mark" => "新疆维吾尔自治区克拉玛依市克拉玛依区"
    ],
    [
        "name" => "白碱滩区",
        "pid" => 650200,
        "code" => 650204,
        "mark" => "新疆维吾尔自治区克拉玛依市白碱滩区"
    ],
    [
        "name" => "乌尔禾区",
        "pid" => 650200,
        "code" => 650205,
        "mark" => "新疆维吾尔自治区克拉玛依市乌尔禾区"
    ],
    [
        "name" => "吐鲁番市",
        "pid" => 650000,
        "code" => 650400,
        "mark" => "新疆维吾尔自治区吐鲁番市"
    ],
    [
        "name" => "高昌区",
        "pid" => 650400,
        "code" => 650402,
        "mark" => "新疆维吾尔自治区吐鲁番市高昌区"
    ],
    [
        "name" => "鄯善县",
        "pid" => 650400,
        "code" => 650421,
        "mark" => "新疆维吾尔自治区吐鲁番市鄯善县"
    ],
    [
        "name" => "托克逊县",
        "pid" => 650400,
        "code" => 650422,
        "mark" => "新疆维吾尔自治区吐鲁番市托克逊县"
    ],
    [
        "name" => "哈密市",
        "pid" => 650000,
        "code" => 650500,
        "mark" => "新疆维吾尔自治区哈密市"
    ],
    [
        "name" => "伊州区",
        "pid" => 650500,
        "code" => 650502,
        "mark" => "新疆维吾尔自治区哈密市伊州区"
    ],
    [
        "name" => "巴里坤哈萨克自治县",
        "pid" => 650500,
        "code" => 650521,
        "mark" => "新疆维吾尔自治区哈密市巴里坤哈萨克自治县"
    ],
    [
        "name" => "伊吾县",
        "pid" => 650500,
        "code" => 650522,
        "mark" => "新疆维吾尔自治区哈密市伊吾县"
    ],
    [
        "name" => "昌吉回族自治州",
        "pid" => 650000,
        "code" => 652300,
        "mark" => "新疆维吾尔自治区昌吉回族自治州"
    ],
    [
        "name" => "昌吉市",
        "pid" => 652300,
        "code" => 652301,
        "mark" => "新疆维吾尔自治区昌吉回族自治州昌吉市"
    ],
    [
        "name" => "阜康市",
        "pid" => 652300,
        "code" => 652302,
        "mark" => "新疆维吾尔自治区昌吉回族自治州阜康市"
    ],
    [
        "name" => "呼图壁县",
        "pid" => 652300,
        "code" => 652323,
        "mark" => "新疆维吾尔自治区昌吉回族自治州呼图壁县"
    ],
    [
        "name" => "玛纳斯县",
        "pid" => 652300,
        "code" => 652324,
        "mark" => "新疆维吾尔自治区昌吉回族自治州玛纳斯县"
    ],
    [
        "name" => "奇台县",
        "pid" => 652300,
        "code" => 652325,
        "mark" => "新疆维吾尔自治区昌吉回族自治州奇台县"
    ],
    [
        "name" => "吉木萨尔县",
        "pid" => 652300,
        "code" => 652327,
        "mark" => "新疆维吾尔自治区昌吉回族自治州吉木萨尔县"
    ],
    [
        "name" => "木垒哈萨克自治县",
        "pid" => 652300,
        "code" => 652328,
        "mark" => "新疆维吾尔自治区昌吉回族自治州木垒哈萨克自治县"
    ],
    [
        "name" => "博尔塔拉蒙古自治州",
        "pid" => 650000,
        "code" => 652700,
        "mark" => "新疆维吾尔自治区博尔塔拉蒙古自治州"
    ],
    [
        "name" => "博乐市",
        "pid" => 652700,
        "code" => 652701,
        "mark" => "新疆维吾尔自治区博尔塔拉蒙古自治州博乐市"
    ],
    [
        "name" => "阿拉山口市",
        "pid" => 652700,
        "code" => 652702,
        "mark" => "新疆维吾尔自治区博尔塔拉蒙古自治州阿拉山口市"
    ],
    [
        "name" => "精河县",
        "pid" => 652700,
        "code" => 652722,
        "mark" => "新疆维吾尔自治区博尔塔拉蒙古自治州精河县"
    ],
    [
        "name" => "温泉县",
        "pid" => 652700,
        "code" => 652723,
        "mark" => "新疆维吾尔自治区博尔塔拉蒙古自治州温泉县"
    ],
    [
        "name" => "巴音郭楞蒙古自治州",
        "pid" => 650000,
        "code" => 652800,
        "mark" => "新疆维吾尔自治区巴音郭楞蒙古自治州"
    ],
    [
        "name" => "库尔勒市",
        "pid" => 652800,
        "code" => 652801,
        "mark" => "新疆维吾尔自治区巴音郭楞蒙古自治州库尔勒市"
    ],
    [
        "name" => "轮台县",
        "pid" => 652800,
        "code" => 652822,
        "mark" => "新疆维吾尔自治区巴音郭楞蒙古自治州轮台县"
    ],
    [
        "name" => "尉犁县",
        "pid" => 652800,
        "code" => 652823,
        "mark" => "新疆维吾尔自治区巴音郭楞蒙古自治州尉犁县"
    ],
    [
        "name" => "若羌县",
        "pid" => 652800,
        "code" => 652824,
        "mark" => "新疆维吾尔自治区巴音郭楞蒙古自治州若羌县"
    ],
    [
        "name" => "且末县",
        "pid" => 652800,
        "code" => 652825,
        "mark" => "新疆维吾尔自治区巴音郭楞蒙古自治州且末县"
    ],
    [
        "name" => "焉耆回族自治县",
        "pid" => 652800,
        "code" => 652826,
        "mark" => "新疆维吾尔自治区巴音郭楞蒙古自治州焉耆回族自治县"
    ],
    [
        "name" => "和静县",
        "pid" => 652800,
        "code" => 652827,
        "mark" => "新疆维吾尔自治区巴音郭楞蒙古自治州和静县"
    ],
    [
        "name" => "和硕县",
        "pid" => 652800,
        "code" => 652828,
        "mark" => "新疆维吾尔自治区巴音郭楞蒙古自治州和硕县"
    ],
    [
        "name" => "博湖县",
        "pid" => 652800,
        "code" => 652829,
        "mark" => "新疆维吾尔自治区巴音郭楞蒙古自治州博湖县"
    ],
    [
        "name" => "阿克苏地区",
        "pid" => 650000,
        "code" => 652900,
        "mark" => "新疆维吾尔自治区阿克苏地区"
    ],
    [
        "name" => "阿克苏市",
        "pid" => 652900,
        "code" => 652901,
        "mark" => "新疆维吾尔自治区阿克苏地区阿克苏市"
    ],
    [
        "name" => "温宿县",
        "pid" => 652900,
        "code" => 652922,
        "mark" => "新疆维吾尔自治区阿克苏地区温宿县"
    ],
    [
        "name" => "库车县",
        "pid" => 652900,
        "code" => 652923,
        "mark" => "新疆维吾尔自治区阿克苏地区库车县"
    ],
    [
        "name" => "沙雅县",
        "pid" => 652900,
        "code" => 652924,
        "mark" => "新疆维吾尔自治区阿克苏地区沙雅县"
    ],
    [
        "name" => "新和县",
        "pid" => 652900,
        "code" => 652925,
        "mark" => "新疆维吾尔自治区阿克苏地区新和县"
    ],
    [
        "name" => "拜城县",
        "pid" => 652900,
        "code" => 652926,
        "mark" => "新疆维吾尔自治区阿克苏地区拜城县"
    ],
    [
        "name" => "乌什县",
        "pid" => 652900,
        "code" => 652927,
        "mark" => "新疆维吾尔自治区阿克苏地区乌什县"
    ],
    [
        "name" => "阿瓦提县",
        "pid" => 652900,
        "code" => 652928,
        "mark" => "新疆维吾尔自治区阿克苏地区阿瓦提县"
    ],
    [
        "name" => "柯坪县",
        "pid" => 652900,
        "code" => 652929,
        "mark" => "新疆维吾尔自治区阿克苏地区柯坪县"
    ],
    [
        "name" => "克孜勒苏柯尔克孜自治州",
        "pid" => 650000,
        "code" => 653000,
        "mark" => "新疆维吾尔自治区克孜勒苏柯尔克孜自治州"
    ],
    [
        "name" => "阿图什市",
        "pid" => 653000,
        "code" => 653001,
        "mark" => "新疆维吾尔自治区克孜勒苏柯尔克孜自治州阿图什市"
    ],
    [
        "name" => "阿克陶县",
        "pid" => 653000,
        "code" => 653022,
        "mark" => "新疆维吾尔自治区克孜勒苏柯尔克孜自治州阿克陶县"
    ],
    [
        "name" => "阿合奇县",
        "pid" => 653000,
        "code" => 653023,
        "mark" => "新疆维吾尔自治区克孜勒苏柯尔克孜自治州阿合奇县"
    ],
    [
        "name" => "乌恰县",
        "pid" => 653000,
        "code" => 653024,
        "mark" => "新疆维吾尔自治区克孜勒苏柯尔克孜自治州乌恰县"
    ],
    [
        "name" => "喀什地区",
        "pid" => 650000,
        "code" => 653100,
        "mark" => "新疆维吾尔自治区喀什地区"
    ],
    [
        "name" => "喀什市",
        "pid" => 653100,
        "code" => 653101,
        "mark" => "新疆维吾尔自治区喀什地区喀什市"
    ],
    [
        "name" => "疏附县",
        "pid" => 653100,
        "code" => 653121,
        "mark" => "新疆维吾尔自治区喀什地区疏附县"
    ],
    [
        "name" => "疏勒县",
        "pid" => 653100,
        "code" => 653122,
        "mark" => "新疆维吾尔自治区喀什地区疏勒县"
    ],
    [
        "name" => "英吉沙县",
        "pid" => 653100,
        "code" => 653123,
        "mark" => "新疆维吾尔自治区喀什地区英吉沙县"
    ],
    [
        "name" => "泽普县",
        "pid" => 653100,
        "code" => 653124,
        "mark" => "新疆维吾尔自治区喀什地区泽普县"
    ],
    [
        "name" => "莎车县",
        "pid" => 653100,
        "code" => 653125,
        "mark" => "新疆维吾尔自治区喀什地区莎车县"
    ],
    [
        "name" => "叶城县",
        "pid" => 653100,
        "code" => 653126,
        "mark" => "新疆维吾尔自治区喀什地区叶城县"
    ],
    [
        "name" => "麦盖提县",
        "pid" => 653100,
        "code" => 653127,
        "mark" => "新疆维吾尔自治区喀什地区麦盖提县"
    ],
    [
        "name" => "岳普湖县",
        "pid" => 653100,
        "code" => 653128,
        "mark" => "新疆维吾尔自治区喀什地区岳普湖县"
    ],
    [
        "name" => "伽师县",
        "pid" => 653100,
        "code" => 653129,
        "mark" => "新疆维吾尔自治区喀什地区伽师县"
    ],
    [
        "name" => "巴楚县",
        "pid" => 653100,
        "code" => 653130,
        "mark" => "新疆维吾尔自治区喀什地区巴楚县"
    ],
    [
        "name" => "塔什库尔干塔吉克自治县",
        "pid" => 653100,
        "code" => 653131,
        "mark" => "新疆维吾尔自治区喀什地区塔什库尔干塔吉克自治县"
    ],
    [
        "name" => "和田地区",
        "pid" => 650000,
        "code" => 653200,
        "mark" => "新疆维吾尔自治区和田地区"
    ],
    [
        "name" => "和田市",
        "pid" => 653200,
        "code" => 653201,
        "mark" => "新疆维吾尔自治区和田地区和田市"
    ],
    [
        "name" => "和田县",
        "pid" => 653200,
        "code" => 653221,
        "mark" => "新疆维吾尔自治区和田地区和田县"
    ],
    [
        "name" => "墨玉县",
        "pid" => 653200,
        "code" => 653222,
        "mark" => "新疆维吾尔自治区和田地区墨玉县"
    ],
    [
        "name" => "皮山县",
        "pid" => 653200,
        "code" => 653223,
        "mark" => "新疆维吾尔自治区和田地区皮山县"
    ],
    [
        "name" => "洛浦县",
        "pid" => 653200,
        "code" => 653224,
        "mark" => "新疆维吾尔自治区和田地区洛浦县"
    ],
    [
        "name" => "策勒县",
        "pid" => 653200,
        "code" => 653225,
        "mark" => "新疆维吾尔自治区和田地区策勒县"
    ],
    [
        "name" => "于田县",
        "pid" => 653200,
        "code" => 653226,
        "mark" => "新疆维吾尔自治区和田地区于田县"
    ],
    [
        "name" => "民丰县",
        "pid" => 653200,
        "code" => 653227,
        "mark" => "新疆维吾尔自治区和田地区民丰县"
    ],
    [
        "name" => "伊犁哈萨克自治州",
        "pid" => 650000,
        "code" => 654000,
        "mark" => "新疆维吾尔自治区伊犁哈萨克自治州"
    ],
    [
        "name" => "伊宁市",
        "pid" => 654000,
        "code" => 654002,
        "mark" => "新疆维吾尔自治区伊犁哈萨克自治州伊宁市"
    ],
    [
        "name" => "奎屯市",
        "pid" => 654000,
        "code" => 654003,
        "mark" => "新疆维吾尔自治区伊犁哈萨克自治州奎屯市"
    ],
    [
        "name" => "霍尔果斯市",
        "pid" => 654000,
        "code" => 654004,
        "mark" => "新疆维吾尔自治区伊犁哈萨克自治州霍尔果斯市"
    ],
    [
        "name" => "伊宁县",
        "pid" => 654000,
        "code" => 654021,
        "mark" => "新疆维吾尔自治区伊犁哈萨克自治州伊宁县"
    ],
    [
        "name" => "察布查尔锡伯自治县",
        "pid" => 654000,
        "code" => 654022,
        "mark" => "新疆维吾尔自治区伊犁哈萨克自治州察布查尔锡伯自治县"
    ],
    [
        "name" => "霍城县",
        "pid" => 654000,
        "code" => 654023,
        "mark" => "新疆维吾尔自治区伊犁哈萨克自治州霍城县"
    ],
    [
        "name" => "巩留县",
        "pid" => 654000,
        "code" => 654024,
        "mark" => "新疆维吾尔自治区伊犁哈萨克自治州巩留县"
    ],
    [
        "name" => "新源县",
        "pid" => 654000,
        "code" => 654025,
        "mark" => "新疆维吾尔自治区伊犁哈萨克自治州新源县"
    ],
    [
        "name" => "昭苏县",
        "pid" => 654000,
        "code" => 654026,
        "mark" => "新疆维吾尔自治区伊犁哈萨克自治州昭苏县"
    ],
    [
        "name" => "特克斯县",
        "pid" => 654000,
        "code" => 654027,
        "mark" => "新疆维吾尔自治区伊犁哈萨克自治州特克斯县"
    ],
    [
        "name" => "尼勒克县",
        "pid" => 654000,
        "code" => 654028,
        "mark" => "新疆维吾尔自治区伊犁哈萨克自治州尼勒克县"
    ],
    [
        "name" => "塔城地区",
        "pid" => 650000,
        "code" => 654200,
        "mark" => "新疆维吾尔自治区塔城地区"
    ],
    [
        "name" => "塔城市",
        "pid" => 654200,
        "code" => 654201,
        "mark" => "新疆维吾尔自治区塔城地区塔城市"
    ],
    [
        "name" => "乌苏市",
        "pid" => 654200,
        "code" => 654202,
        "mark" => "新疆维吾尔自治区塔城地区乌苏市"
    ],
    [
        "name" => "额敏县",
        "pid" => 654200,
        "code" => 654221,
        "mark" => "新疆维吾尔自治区塔城地区额敏县"
    ],
    [
        "name" => "沙湾县",
        "pid" => 654200,
        "code" => 654223,
        "mark" => "新疆维吾尔自治区塔城地区沙湾县"
    ],
    [
        "name" => "托里县",
        "pid" => 654200,
        "code" => 654224,
        "mark" => "新疆维吾尔自治区塔城地区托里县"
    ],
    [
        "name" => "裕民县",
        "pid" => 654200,
        "code" => 654225,
        "mark" => "新疆维吾尔自治区塔城地区裕民县"
    ],
    [
        "name" => "和布克赛尔蒙古自治县",
        "pid" => 654200,
        "code" => 654226,
        "mark" => "新疆维吾尔自治区塔城地区和布克赛尔蒙古自治县"
    ],
    [
        "name" => "阿勒泰地区",
        "pid" => 650000,
        "code" => 654300,
        "mark" => "新疆维吾尔自治区阿勒泰地区"
    ],
    [
        "name" => "阿勒泰市",
        "pid" => 654300,
        "code" => 654301,
        "mark" => "新疆维吾尔自治区阿勒泰地区阿勒泰市"
    ],
    [
        "name" => "布尔津县",
        "pid" => 654300,
        "code" => 654321,
        "mark" => "新疆维吾尔自治区阿勒泰地区布尔津县"
    ],
    [
        "name" => "富蕴县",
        "pid" => 654300,
        "code" => 654322,
        "mark" => "新疆维吾尔自治区阿勒泰地区富蕴县"
    ],
    [
        "name" => "福海县",
        "pid" => 654300,
        "code" => 654323,
        "mark" => "新疆维吾尔自治区阿勒泰地区福海县"
    ],
    [
        "name" => "哈巴河县",
        "pid" => 654300,
        "code" => 654324,
        "mark" => "新疆维吾尔自治区阿勒泰地区哈巴河县"
    ],
    [
        "name" => "青河县",
        "pid" => 654300,
        "code" => 654325,
        "mark" => "新疆维吾尔自治区阿勒泰地区青河县"
    ],
    [
        "name" => "吉木乃县",
        "pid" => 654300,
        "code" => 654326,
        "mark" => "新疆维吾尔自治区阿勒泰地区吉木乃县"
    ],
    [
        "name" => "石河子市",
        "pid" => 650000,
        "code" => 659001,
        "mark" => "新疆维吾尔自治区石河子市"
    ],
    [
        "name" => "阿拉尔市",
        "pid" => 650000,
        "code" => 659002,
        "mark" => "新疆维吾尔自治区阿拉尔市"
    ],
    [
        "name" => "图木舒克市",
        "pid" => 650000,
        "code" => 659003,
        "mark" => "新疆维吾尔自治区图木舒克市"
    ],
    [
        "name" => "五家渠市",
        "pid" => 650000,
        "code" => 659004,
        "mark" => "新疆维吾尔自治区五家渠市"
    ],
    [
        "name" => "铁门关市",
        "pid" => 650000,
        "code" => 659006,
        "mark" => "新疆维吾尔自治区铁门关市"
    ],
];